{"ID":2605,"title":"Day 100 &#8211; Carson City, NV to South Lake Tahoe, CA","content":"<p>Day 100 on the road, and our last state of the trip! Six days of riding to go&hellip;<p>After a little continental breakfast we got on the road early, pedaling along a quieter side road south through Carson City. Eventually we met back up with Route 50, which was a four lane highway leading steeply up into the mountains. Thankfully the shoulder was stout.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DEA6C620-6206-42D6-9615-54604E636DE1-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8CA3EEC9-9D02-4819-A508-D99508C95A90-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>This highway wound slowly higher with sharp curves and pretty fast traffic. We hugged the far-right side of the shoulder as close as we could, dodging huge pinecones as we went. At a pee stop, we examined these specimens more closely.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/30C37AAE-2E8B-4B43-8669-10BEA396B157-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/82D73F61-861A-43A8-B014-D36C2FAF7EB8-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DCD22780-D557-4655-ABB3-5F019BDFDEAF-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E6687C60-319E-45AB-88D8-99E17E044688-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Boy, this climb went on forever. A &rdquo;bear crossing&rdquo; sign got Tess even more anxious to get over the pass. Finally, we made it to the top of Spooner Pass! We had some clementines and got pumped for some dowhill coasting down to the shore of Lake Tahoe.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BF021836-31FF-4481-BCF3-302A8226FC67-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7B4366C0-D9AD-43D8-879D-0200595477DA-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>For some reason, the shoulder completely disappeared on the descent, and wouldn&rsquo;t reappear until we hit the California state line. It was really harrowing. Sunday traffic barreled past us at close range. We were unsure if we should take the right lane completely or hug the side, as each had its downside. We pulled over at one point so I could put on every piece of reflective gear I had. Then we went through a short tunnel and I went over a big sharp rock, which immediately gave me a flat tire. I screamed Tess&rsquo; name to get her to stop, but she didn&rsquo;t hear me and kept going. I rode down to a safe pullout and got to work. Once I realized I couldn&rsquo;t patch the tube, I had to walk down to where Tess was to get a spare. Despite all of this, I felt I kept a pretty level head.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E1F307BC-68EE-4426-ABB2-2BA05541F09D-768x1024.jpeg\" alt=\"\"><figcaption>Walking down to secure a tube<\/figcaption><\/figure><\/figure><p>We couldn&rsquo;t wait to be done with this road. Stateline was the last town before the border, and looked like Disneyland Tahoe - casinos, huge resorts, and oblivious tourists. The last state sign of our trip was the lamest by a mile.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/908CB212-C271-472B-82F9-4840F09E6A1F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Then California came through for us, and a separated bike lane appeared. We rode this all the way to South Lake Tahoe, dodging tourists on e-scooters and big 4-person pedal carts. When we got to a view of the lake, we stopped and gathered ourselves. Tess went down to the lake to splash some water on her face. The lake was dazzlingly blue.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D73D8348-A151-4EF2-A97F-2FADC5459DAE-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FE92C7B4-07D9-4567-BA77-594902DC2453-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9540CAAE-EFFE-4D34-A0FF-B07AAD2A35BA-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Just down the road was Sprouts Cafe, buzzing with the Sunday lunch crowd. After a decent wait, we got some deliciously fresh food and top notch coffee. We ordered way too much and ate all of it.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BB6DE593-57FF-4FD9-86A3-4DE9DFC9F9A7-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We hung out there for a while and then made our way to the home of our Warmshowers hosts Dan and Natasha. It was nice bike paths all the way there.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/82699ED2-65AE-4AE3-A985-A2C59B29635E-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Dan and Natasha greeted us warmly as we pulled into their garage, offering us cold drinks and snacks (including some tasty homemade hummus). They had recently been on a bike trip from Tahoe to Seattle, and Dan had done a cross-country trip a few years before.  Basically, they&rsquo;d been through bike tours and knew exactly what we needed. We instantly hit it off with them. They&rsquo;d met working at the Kirkwood ski resort several years ago, where Dan currently manages base operations. Natasha is currently self-employed, doing writing, freelance data work, and online trainings. Dan flitted around as we talked, repairing a free espresso maker he got online for free.<\/p><p>After talking for a while we showered and napped (big surprise). Actually, Tess took a hot bath with epsom salts. When we emerged, Natasha had dinner pretty much ready to go - pasta with two sauce choices: vegan alfredo with asparagus and red sauce with spinach, both containing soyrizo. It was scrumptious.<\/p><p>After dinner, the conversation quickly got deep, and we sat around their fireplace eating Halloween candy. Then Dan made us Bengal spice tea with honey and steamed milk, and the conversation continued in Natasha&rsquo;s office. We stayed up quite late, and eventually succumbed to sleep but not before we got a selfie by the fire. What an evening!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/28AA67DE-39E4-442D-989A-54B59AB3222F-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"October 18, 2022","fields":{"date":"10\/16\/2022","day_number":"100","multiple_days":false,"weather":"Quite Nice","locations":{"single":false,"start":"Carson City, NV","end":"South Lake Tahoe, CA"},"miles_and_elevation":{"rest_day":false,"miles":"30","elevation_gain":"3783","elevation_loss":"2195","flats":"1"}}}