{"ID":341,"title":"Day 12 &#8211; Columbus OH (Rest Day)","content":"<p>Tess finally has a true rest day, and in true rest day fashion we laid in bed until 10am. We came downstairs to an empty house but a kitchen containing fresh coffee and all the fixings for an eggy delight, including pesto made by Lindsay. We sat on their back patio and vegged out hard.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/45131E1D-8435-4C8C-8A72-B2AC75B4A3F0-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DCA10218-B0BF-4582-ACC6-50F3206AF90F.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9DB2FC1A-F7AF-4093-897C-797D665352AF.jpeg\" alt=\"\"><\/figure><\/figure><p>Eventually Lindsay returned from dropping off their delightful canine Bert at her mom&rsquo;s, and we hit the town. We dropped Tess&rsquo; bike off at Paradise Garage to get her brake levers fixed while we&rsquo;re at Grassroots Music Festival in Trumansburg, NY. I also got myself a treat I&rsquo;ve been considering buying for months, and after over a week of rides have decided would really help my setup - a Revelate Designs Tangle half-frame bag. This will get my water bladder off my back and provide extra storage space. This was partially inspired by seeing Deb&rsquo;s full Revelate Designs setup. I figure the earlier I get it, the better the investment will be, with which Lindsay agreed.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/864FCE55-858F-48D4-B030-8122BC01EC5F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We then realized the true reason for our trip to Columbus with a trip to Fox In The Snow, a cafe with bomb pastries and a souffl&eacute;d egg sandwich. We enjoyed this greatly, and were feeling so good after that we got Gavin a sandwich for when he got out of work.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/61453F07-15A5-4552-8F34-E7F0C6A0F7C6-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E69C8AB7-B0F7-4C96-B44D-08203A1CB063-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We had to boogie back to the house to get packed so we&rsquo;d be ready for the drive when Gavin returned at 2pm. As a passenger, the seven hour drive went pretty quick but can&rsquo;t imagine Gavin and Lindsay felt the same way. We passed the time with many a game - Mind Meld, Jaboodle, How Much Would It Take, and Stick Your Feet In Gavin&rsquo;s Face.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FBD63E24-D88B-4615-87DF-101E77595FCB-768x1024.jpeg\" alt=\"\"><figcaption>My view for seven hours<\/figcaption><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C55A98DE-F5C7-4F06-88F4-FCB139DDBC85-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.206B9346-5691-4D19-ADE9-C3F5FA564024.mov\"><\/video><figcaption>The winds of Seneca Lake doth blow<\/figcaption><\/figure><p>We stopped at the home of Will (Gavin&rsquo;s older brother and wonderful person) to say hello and drop off some gear when we got to Trumansburg, and also got to say hi to Ava and Ada (human and canine, both lovely). <\/p><p>We then arrived at the famed house at Gorge Road, owned and operated by Liz and Bob, Gavin&rsquo;s mom and stepdad, who open their doors generously to family and friends during Grassroots (and any other time really). They were both up, and even prepared us some food which included an amuse-bouche of heirloom tomato in oil, vinegar and spices. We caught up with each other until late, when we finally had to get to sleep to prepare for an action-packed weekend. We went to sleep in our favorite screened-in outdoor room that they always remember to save for us, which happens to be right outside the room where I proposed to Tess seven years ago. The hum of cicadas put us right to sleep.<\/p><\/p>","date":"July 21, 2022","fields":{"date":"07\/20\/2022","day_number":"12","weather":"Hot","locations":{"single":true,"start":"Columbus, OH","end":""},"miles_and_elevation":{"rest_day":true,"miles":"","elevation_gain":"","elevation_loss":"","flats":""}}}