{"ID":510,"title":"Day 19 &#8211; Xenia, OH to Cincinnati OH","content":"<p>Morning thunderstorms in the forecast, an 11:00am hotel checkout time, and West Side Story playing on HBO made for the latest start yet on our highest mileage day of the trip so far. We got a pretty darn good free breakfast downstairs and laid around, periodically checking the Windy app. By the time we checked out, there had been no thunderstorms and not much more than a drizzle. It also looked like the worst of the storm had passed well south of us.<p>At this late point in the day we considered camping halfway to Cincinnati and not taking our planned sightseeing day. We opted to bust out the 60+ miles as planned, as we were looking forward to checking out the city and we had a day to rest, after all.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/909965FB-66D5-4FB4-91D7-28CE45C7B5F1-769x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>As soon as we set out, it started raining pretty hard. We waterproofed everything, including our shoes with our newly-purchased rain covers. It felt nice setting out in the rain knowing everything was packed away and dry. <br><\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.5515A566-562C-4FF3-92BF-AB04D8700F6A.mov\"><\/video><\/figure><p>After 15 miles on the Little Miami Scenic Trail we made a pit stop in Corwin where there were some nice bike amenities. This would be the case for the majority of this trail, which was always within sight of the pretty Little Miami River. We ate bananas and peanut butter and took off all our rain gear, as the rain had just stopped.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A08F6ABF-74C1-4AD6-A683-93FDA3A0DCD6-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/898ECF56-2758-4D3B-8A42-CD100805ADA9-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Over the next 15 miles my knee started to hurt again. I&rsquo;d been careful thus far to avoid too much downward force with my right leg, but I think the mileage of the day before was catching up to me. I&rsquo;m noticing a pattern of it hurting after a lot of flat miles, we&rsquo;ll see if anything changes once we start getting to the hills of Kentucky (for better or worse). Going to continue to ice it as much as I can, and start thinking about getting a brace. Tess&rsquo; hamstrings had been in pain early on in the day but felt fine at this juncture.<\/p><p>On our next stop in the town of Morrow I took out my fancy chair and gave my leg a good rest. We wolfed down some Gatorade and a bag of chocolate-covered peanut butter pretzels. When we hit the road again, my knee felt significantly better. I blasted Chairlift to help ride the wave of energy I was feeling.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.3B84A178-D4B0-4475-B340-25AB47556D15.mov\"><\/video><\/figure><p>We hit another detour by Middletown Junction, which brought us up a large hill onto busy roads for five miles. As it didn&rsquo;t add mileage and was a welcome break from the &ldquo;green tunnel&rdquo; of the bike path, we didn&rsquo;t mind much.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D26635AE-CA02-4264-A4BD-96A09E0EB1BA-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Time slowed to a crawl in the last 30 miles. Despite biking at a good pace, it felt like we weren&rsquo;t making much headway. Finally, when we had fewer than 20 miles left we took a little break in the town of Loveland. The downtown of this little paradise is centered around the bike\/pedestrian path, and there were few vehicles to be seen. Hopefully we were seeing the future of American towns. We got some cinnamon-covered pecans from Trailside Provisions and pressed on for the final push.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6A8D25CD-1662-417D-9FA8-3EA6231C70EC-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.1DD22E5B-E863-45F9-87AA-70F36660E83C.mov\"><\/video><\/figure><p>Not long down the road I met Rick, who had seen our touring setup and offered his property down the road to pitch our tent. Rick had done portions of the Appalachian Trail and so &rdquo;understood trail magic&rdquo;. I thanked him warmly but said we were expected in Cincy.<\/p><p>We left the Little Miami Trail and were dumped out on a very steep four-lane road during rush hour. There were bike symbols painted in the right lane and signs everywhere saying that bikes could use the full lane, but I don&rsquo;t think motorists were taking it to heart and we certainly didn&rsquo;t feel comfortable. <\/p><p>At the end of a welcome separated path running through an outer Cincinnati neighborhood, Tess was dragged down by her bike again at a stop sign. Understandably she was pissed, a feeling made worse by fatigue and the heat. She was starting to wonder how many more times her wrist could break these falls without breaking itself. We discussed options - switching back to platform pedals or getting a wrist guard for her left hand. She&rsquo;s undoubtedly getting better at clipless pedals, but we&rsquo;re not sure if the benefit is worth the cost of these falls.<\/p><p>We gritted our teeth and dug deep to finish out the last six and a half miles. We quickly learned Cincinnati is very hilly. I found myself smiling and whispering &rdquo;fuck you&rdquo; to each hill I was presented with in this stretch. In my rear-view Tess was expressionless.<\/p><p>When we thought we could take no more, we arrived at our destination, our Warmshowers host Mark&rsquo;s home across from Eden Park. Mark immediately came out to help us bring in our gear. He has an apartment in a beautiful old brick building, and he made us feel right at home in it. He served us veggie samosas and water which was most welcome. Mark is doing his residency in Cincinnati and currently applying for fellowships around the country. He is an avid biker and runner, and he and Tess quickly found out they had both walked the Camino de Santiago in Spain. <\/p><p>We cleaned up and then Mark drove us to get pizza at Goodfella&rsquo;s in the Over-The-Rhine neighborhood, stopping at the Eden Park overlook on the way. We were struck by how many old brick buildings were preserved in Cincinnati. The German influence gives it a very European feel. We had a delicious and enjoyable dinner with Mark (Tess had a tasty local IPA).<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8C350EC9-DB62-4456-A00A-55DD5D465E2C-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E572B113-BCEC-4074-A43B-3DB288910D18-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E2CBD9EC-2495-4042-8DE3-77F53DEBA090-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Feeling hit by a wave of exhaustion after satisfying our hunger, Mark drove us back, highlighting points of interest along the way. We set up our sleeping mat in his living room and fell asleep full and happy not long after.<\/p><\/p>","date":"July 28, 2022","fields":{"date":"07\/27\/2022","day_number":"19","weather":"Rain, Then Hot","locations":{"single":false,"start":"Xenia, OH","end":"Cincinnati, OH"},"miles_and_elevation":{"rest_day":false,"miles":"66","elevation_gain":"889","elevation_loss":"1112","flats":""}}}