{"ID":672,"title":"Day 25 &#8211; Louisville, KY to Brandenburg, KY","content":"<p>As far as roads go, today&rsquo;s were the worst of the trip so far. <p>When we got up at 6:30 I was on the Warmshowers app and happened to notice there was a host I had overlooked not far from Brandenburg. Originally we were planning on staying at an RV park that doesn&rsquo;t usually allow tent campers and had no bath house, so this would be a step up. I messaged him, and so instead of following the Adventure Cycling route to Brandenburg via Indiana, we decided on a Kentucky route that made more sense for our new destination (gambling on him saying yes on such late notice). A cursory look at the roads on StreetView didn&rsquo;t reveal anything too bad&hellip;<\/p><p>We started on city roads with bike lanes, and happened to pass Wiltshire Bakery again so we had to stop. I ordered my favorite cookie and Tess got an apricot turnover. A mix-up resulted in them throwing in a second cookie for free. What a delight!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E4EDC827-2995-42D7-8429-031F263A6B96-768x1024.jpeg\" alt=\"\"><figcaption>My kind of bike lane - same width as car lane!<\/figcaption><\/figure><\/figure><p>On our way out of the city, Google Maps took us down this weird back alley that quickly turned into a forest of brambles. It seemed like every adjacent backyard had a big, mean dog that started barking as we passed. My leg brushed against stinging nettle, and when I slowed down to avoid a mud pit, I saw an open manhole that was disguised by tall grass. Close call. Was Google messing with us? Felt like a level in a video game.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/42C4F7C2-C9D2-4935-81CC-C82061FB3450-768x1024.jpeg\" alt=\"\"><figcaption>Looking back at Bramble Alley<\/figcaption><\/figure><\/figure><p>That was just an amuse-bouche it turns out. We then were dumped out onto Route 1934 for five miles, which was a four-lane road with no shoulder. A thin sidewalk appeared for the last two miles which we decided to use.<\/p><p>From there, we had a reprieve on the Louisville Loop trail, the one bright spot of the riding day. We stopped at Lindsay&rsquo;s Kitchen to use the restroom and had the first of our Wiltshire treats. What followed was a bike path atop what I think was a levee along the Ohio River.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.13CB5D6E-B7FE-4A87-A444-32C97B7903BF.mov\"><\/video><\/figure><p>Eventually we hit the massive Mill Creek Generating Station and jumped on the &rdquo;Dixie Highway&rdquo;. Sounds quaint, but it was ten miles of terrifyingly fast traffic and an unreliable shoulder. To top it off, the last three miles was a massive hill. We started to understand why the Adventure Cycling route didn&rsquo;t go this way, and this result didn&rsquo;t embolden us to make our own route in future days.<\/p><p>When we reached the town of Muldraugh where we were turning off the Dixie Highway, we had to stop to de-stress. The Backstreets Caf&eacute; was right at the intersection, and there we sat for a long time, stress eating and drinking. We had a good conversation with Felipe, an Army serviceman who worked at the nearby Fort Knox and who said we were living his dream of doing a long bike trip. He gave us tips on getting to Brandenburg safely. Hope to meet him on the road someday!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1B6993F4-CD8E-4D8D-96B3-96E81F503179-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9F07DFAF-0AE0-4AB0-8359-B8D0E8FE9DFC-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We gritted our teeth and drilled through the final 10 miles to Troy and Donna&rsquo;s home. The road to the final turnoff was only marginally better than Dixie Highway. They live in a private community on the human-made Doe Valley lake, and we encountered a lot of deer on the winding roads we took to finally arrive at their house.<\/p><p>In the driveway we encountered a husky mix that barely acknowledged our arrival, which was a welcome change from our usual dog reception these days. No one was home yet, but Troy had said to go in and make ourselves at home, so we got a couple cold drinks and sat on the porch swing.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C3CDC440-F42C-499B-B62B-D45A17B738D2-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>It was a full house - Troy&rsquo;s son Matt also lives there, and Donna&rsquo;s son Ian, his wife Chelsea, and their kids Jase, Rowan, and Silas were visiting from Omaha. Ian had just gotten a new job as a pilot and they were stopping by mom&rsquo;s place before it started. Troy and Donna were nice enough to host us anyways, and set us up on an air mattress\/futon on the bottom floor.<\/p><p>Tess and I were dead tired and took a nap so we could recharge and be able to socialize. When we got up, Donna and Troy were setting out a whole spread for dinner - pork (which looked great but we had to pass on), broccoli salad, potato salad, vegetarian baked beans, cucumber and tomato salad, cole slaw, watermelon and rolls. Food and conversation were top-notch.<\/p><p>After dinner they took us out on their boat with the whole family, on which they had affixed a platform and slide.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/75E83817-93A8-45C2-B686-4EFC656EC9DF-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We all drove (and the kids steered) around the lake, stopping at a little spring waterfall and a beach. Tess and I tried out the slide and played sea monster with the kids. The water was warm and we stayed out until after the sun set.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6F64C8A8-E6B8-4E09-9CCD-6D4BEFEE2F95-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3A4DB706-9E8A-4BB1-94A4-B920727B0D72-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/397EB8FA-7A63-4CD5-9F3C-67321806EE6C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4942171C-03CB-4DBA-9C6F-0C5030C9B0EB-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C9909574-3EA9-4AE0-B35E-5AD3C87B5DAE-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.68A64B30-71CB-4074-8E07-B4E245E4B468.mov\"><\/video><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.E4A51E63-B2B2-43B6-9466-3DE384401A44.mov\"><\/video><\/figure><p>We knew the weather was going to be hot the next day, so we showered and got to bed as soon as we got back with the intent to get up early. Once again, a great Warmshowers stay turned a bad day into a good one. <\/p><p>This was the first day when I felt pretty down at points - the gray weather, the roads, and some of the poverty we witnessed all contributed. Sadness is a part of life, and the bike trip is a part of life, so it makes sense that they&rsquo;d intersect at some point. More happiness and sadness to come, guaranteed!<\/p><\/p>","date":"August 3, 2022","fields":{"date":"08\/02\/2022","day_number":"25","weather":"Overcast","locations":{"single":false,"start":"Louisville, KY","end":"Brandenburg, KY"},"miles_and_elevation":{"rest_day":false,"miles":"42","elevation_gain":"656","elevation_loss":"584","flats":""}}}