{"ID":713,"title":"Day 27 &#8211; Hawesville, KY to Utica, KY","content":"<p>You may notice that we ended in Cloverport yesterday and started in Hawesville today. Let me explain! Mitch was going to drive us and our gear back to Cloverport in the morning, but asked if we didn&rsquo;t want a ride to our original destination of Hawesville and to bypass a section of busy highway with two massive hills. This solved a conundrum Tess and I were having with routing to Utica from Cloverport, where our options were:<ul><li>Follow the less direct but more bike-friendly Underground Railroad trail, which would now be 60+ miles, mileage we decided we didn&rsquo;t want to do anymore in one day<\/li><li>Take Kelly and Mitch&rsquo;s suggestion of just following busy Route 60, which had a section without shoulders<\/li><li>Take more direct but very hilly back roads that were not recommended by the locals and were very &rdquo;off book&rdquo;<\/li><\/ul><p>We could now do option 1 but it would be a more friendly ~50 miles and we could skip the kind of highway that makes Tess moan with fear. Went against my strict &rdquo;skip no miles&rdquo; rule, but I mean he was already driving us back and just went a little farther, right? Right??<\/p><p>Mitch dropped us at Bill&rsquo;s IGA on Route 60 outside of Hawesville where we could get breakfast. Behind the parking lot we saw the unlikeliest of friendships unfolding: a kitten and a raccoon sharing some food. A Disney movie turned into a horror movie when the raccoon bit the kitten, who limped away.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/18F41454-E2ED-44A6-860A-BE8859F12B45-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>As we were on our knees sobbing our thanks to Mitch (and asking him to pass them along to Edie as well), who would drive up but Kelly from Cloverport. He joined our selfie before they headed back to town.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/90D21836-EF0B-4A6E-88CB-0BC1BD0AD65B-1024x769.jpeg\" alt=\"\"><figcaption>Tess, Kelly, Mitch and me<\/figcaption><\/figure><\/figure><p>We got coffees and some breakfast sandwiches (brought to you by friends of Wheelie Babes) and parked outside. As usual, we hit the road later than we wanted to at 8:30.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/28DD7C5D-07E3-4E2B-815F-B485FFE59EEE-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A053F62F-7397-4E08-BF86-EBA0D2EF0C5E-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We were overjoyed that it was mostly cloudy, and surprisingly most of the ride was flat as a pancake. The morning started on the Ohio River floodplain, peppered with &rdquo;This Road May Flood&rdquo; signs. There were few cars and we could ride next to each other most of the way.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FC9335F3-B89D-4461-A077-E6DC70D59E5F-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/56056072-AB2A-4D89-BFEB-E58532D0E020-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Later we passed the site where Lincoln defended himself and won his first case as a lawyer.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/28F850D5-4FBD-4A9B-A810-70EA25561B34-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Afterwards we crossed over Route 60 and passed through some increasingly large towns as we got closer to Owensboro. At a gas station in the outskirts of Owensboro we shared a delicious apple fritter Tess had gotten at Bill&rsquo;s that morning. We were on a nice greenway for several miles until we got to Southerland Road, a long straight farm road that had recently flooded. There was a bunch of mud and some water in the road, and we crossed a dead deer, dead fish and a live turtle. Tess had a handy bandanna to cover her nose during this stretch.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A7A2E28F-6C36-4552-9D2B-5A64FBF45D2D-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D48ABB97-0E85-4D57-B680-606B1EFB5A80-769x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We&rsquo;d been texting our WS host for that night Ang&eacute;lica about our timing and she offered to pick us up in Owensboro so we could avoid the 8 miles of busy Route 431 which had no shoulder and led to their house. Since we were only on it for four miles, Tess and I decided we&rsquo;d try to do it, but take a look at the road and if it looked really bad we&rsquo;d accept their offer. It wasn&rsquo;t great, but we went for it, arriving safely at Ang&eacute;lica and Jo&rsquo;s. <\/p><p>We were greeted by Ang&eacute;lica and her son Noe. We could tell she was a seasoned WS host because her first question was &rdquo;what are your immediate needs?&rdquo; She and Jo have 30-40 WS guests per year since they live just off the TransAmerica trail, and they have a separate &rdquo;bunk house&rdquo; for guests with a TV, couch and a bed. They have six guests coming on August 9!<\/p><p>Ang&eacute;lica, originally from New Mexico, is a warm person who is quick to laugh, and we talked with her for a while over ice water and some peanut butter and Nutella wraps that Tess and I made for lunch. Her left leg was pulverized in a bad car accident several years ago and so her mobility is limited and deals with a lot of pain, but you&rsquo;d never tell from her demeanor. Noe is a huge help to her, and is kind and respectful. Ang&eacute;lica took Tess to the post office to send some unused items home, and then Tess and I took a nap.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/134F8F06-0E43-41C5-BF30-DD11EF6F8312-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/24F47D-3BA1-43A1-A29C-9631D7EE7CD4-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When we got up Jo had returned from work, who is also super friendly (and coincidentally also from New Mexico). She and Ang&eacute;lica had gotten married two years ago. Tess told Jo she&rsquo;d never mowed a lawn before so she rolled it out and Tess took it for a spin. I pitched in as well.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D88067BF-BDE4-41D9-8BA2-57BEB7F7E207-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1E965536-16F4-4439-B56F-069BC1207274.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A8219E61-04D8-4057-AFB6-51FEAB8C095A.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/68A44379-71E5-40E9-98CE-21E13757D4D9.jpeg\" alt=\"\"><\/figure><\/figure><p>We planned to go into Owensboro for dinner, but first we made a stop at the open house at Noe&rsquo;s new middle school (he had been home schooled since COVID). We walked around with him to all his eighth grade classrooms.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D0F0DF3E-CDAC-4422-B31B-8EFDA169EA41-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Then Jo and Ang&eacute;lica took us to Papa Grande&rsquo;s where we ate delicious queso and very delicious veggie quesadillas. When we returned to their house we all played Mortal Kombat (Tess had admitted she&rsquo;d never played) and we tried out Noe&rsquo;s VR headset.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/ED6CD3D9-4CA4-4E2D-AD89-499DD36ECE4F.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/497E1690-8C43-4E70-8A8B-3279C6D651EC-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Tired from all the fun, we said our goodbyes and thanks to Jo, who had to get up early for work the next day. On our way to the bunk house Tess was dive-bombed by a bat and made a terrified sound I&rsquo;d never heard out of her before. Sort of like a dolphin.<\/p><\/p>","date":"August 5, 2022","fields":{"date":"08\/04\/2022","day_number":"27","weather":"Overcast","locations":{"single":false,"start":"Hawesville, KY","end":"Utica, KY"},"miles_and_elevation":{"rest_day":false,"miles":"48","elevation_gain":"262","elevation_loss":"338","flats":""}}}