{"ID":827,"title":"Day 31 &#8211; Eddyville, IL to Carbondale, IL","content":"<p>I noticed light through the window when I woke up, which was bad because we meant to get up when it was dark. Tess made an error in her alarm computations and an hour had slipped by. We got up and packed quickly, stuffing muffins in our mouths and guzzling coffee. By 6:30 we were out of Hayes Canyon Campground and on the road, and we were determined to make as few stops as possible to make up the time.<p>The morning was gorgeous as all mornings have been lately, and we relished in the cool air on our descents. There were a bunch of big hills but we weren&rsquo;t really feeling them, and we were going at quite a click. By 9:30 (the time we&rsquo;d left breakfast the day before) we&rsquo;d already knocked off half the day&rsquo;s mileage.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4C05ACEA-694D-43F4-A51C-BF70A76F5B11-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C192C66B-DAC7-42D1-B3F4-BCA8BD43C898-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0EBD14CC-C30D-4B83-A799-550A4B78DB24-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Our first stop to apply sunscreen and have a snack was across from &rdquo;Southern Illinois Equine Sale&rdquo;, which was a big barn with incessant mooing emanating from it. It sounded like dozens and dozens of cows who were all screaming? Talking? Whatever it was it was making us uncomfortable so we quickly ate our peanut butter and nutella sandwiches and left.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2E288279-0958-4C84-BB2C-94680B34F2AD-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>On one big hill Tess&rsquo; gears screwed up again, as they had started to do over the past couple days. We decided we needed to stay in Carbondale until the problem was dealt with for good. <br><br>Just when the sun started getting high enough to scorch us we hit Lick Creek Road, a beautiful tree-lined road that provided us with shade. Miraculously, we would have shade for most of the rest of the day&rsquo;s ride. On one big hill on this road, I was propelled to the top by Chuck Berry&rsquo;s &rdquo;Maybellene&rdquo;, which had the perfect tempo.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/34CB66CF-65EF-4B9C-A32B-675D2FFFB23C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/04475C0C-770D-46E7-A56F-79E308B5DE96-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9A1ECE-88C2-4286-958A-C27EE5909933.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2281B570-54AC-40FC-879B-BBC5541B1DB0-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We then entered Crab Orchard Wildlife Refuge, which brought us through woods and along some lakes. It was a nice break from hilly farmland. Here Tess tried again to call the bike shop in Carbondale (her fourth attempt in so many days) to no avail. We then noticed there was another bike shop there who answered immediately. Cool.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DCD31A6B-5AE9-4B29-9055-FD755FBA3FF5.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3F19A15D-CBAF-46FB-9128-8100302A94A5-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3A847AE2-2E97-432A-B183-C1B0AE8BBD6F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>At a quarter to noon we made it into Carbondale! Our Airbnb wasn&rsquo;t ready yet so we unloaded our gear into the backyard and brought our bikes into Phoenix Cycles, a five minute ride away. I was getting irritated at little things at this point, which I would later learn was due to hunger and heat exposure.<\/p><p>We dropped off our bikes with some nice, calming gentlemen who gave us the feeling they would really delve into the matter and find a solution. Then it was lunch time - should we check out the highly-rated vegetarian restaurant a minute&rsquo;s walk from our Airbnb? Oh neat, they&rsquo;re closed the two days we&rsquo;d be in town? <\/p><p>Instead we went to Town Square Market, a natural grocery store on the same block that had a deli. When we walked in we were told the deli was closed, but fortunately there were pre-made items in the fridge. We had assorted salads, chips, cold drinks and iced coffee, and immediately felt better.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/87D4A7E6-FB08-4BCE-9D01-5F26C822E01F-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We waited there for an hour or so, eating and writing our posts. At one point Tess complimented a woman&rsquo;s impressively flared bellbottoms. This was Terry, a member of a community of 45 or so in Carbondale who have a farm, grow herbs and produce, create herbal medicines and practice Sufism. We talked to her for quite a while, and she introduced us to Kiersten and Cindy who were also eating there and were involved with the community and its businesses (the vegetarian restaurant Longbranch, Town Square Market, the farm and the herbal medicine company). <\/p><p>Terry said that, in fact, Kiersten and Cindy were going to the farm in Anna the next morning for a few hours if we wanted to check it out and go swimming in the pond. We jumped on that opportunity, and exchanged numbers with Kiersten. As we were leaving, Terry gave us a little bottle of elderberry syrup (for immune support) and some herbal salve to help us on our ride.<\/p><p>At long last we got to our Airbnb, which was beautifully air-conditioned and had every possible thing we might need - frosted Coke mugs, tons of amazing records, a guitar, a beautifully stocked kitchen, firewood, cold seltzers, s&rsquo;mores fixings, laundry - the list goes on. Most of all, we were super excited to nap.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6295C487-C3E9-4B6B-862B-598900D35180-768x1024.jpeg\" alt=\"\"><figcaption>Bed, seltzer and Netflix<\/figcaption><\/figure><\/figure><p>We didn&rsquo;t leave the Airbnb for the rest of the day and didn&rsquo;t want to. For dinner we made tamales and a salad of fresh veggies. From there we watched Lightyear and went to bed. A glorious evening.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/385DFCD8-5590-49B7-963F-B07610064718-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A2AA419F-8483-49D4-9C7F-7752A8785DA0-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"August 9, 2022","fields":{"date":"08\/08\/2022","day_number":"31","multiple_days":false,"weather":"Caliente","locations":{"single":false,"start":"Eddyville, IL","end":"Carbondale, IL"},"miles_and_elevation":{"rest_day":false,"miles":"54","elevation_gain":"1946","elevation_loss":"2185","flats":""}}}