{"ID":866,"title":"Day 33 &#8211; Carbondale, IL (Rest Day 2)","content":"<p>After getting to bed at midnight the night before, we were a bit sleepy after our alarm went off at 7am. We had coffee and muffins in bed again, and slowly got to packing. I tinkered with my bike setup a bit too long, and by the time we left the place it was 9:30; we were surprised to see it was pouring. We figured since it wasn&rsquo;t getting too hot that day we weren&rsquo;t in any real rush, so we went to the vegetarian caf&eacute; Longbranch which we&rsquo;d been longing for for a couple days.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A1F6F4A5-2FFA-425E-8035-FD76FA653106-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/22369029-1A85-47E9-AD3E-C1F97D02183E-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Not long after we sat down, we confessed we didn&rsquo;t really feel like riding today. What if we stayed another night? The beauty of the flexibility of our trip is that we can listen to our bodies in this way. Fifteen minutes later, we&rsquo;d arranged to stay with Kierstin that night, and extended our checkout time at the Airbnb until 2pm. After eating some vegetarian biscuits and gravy, we went back to nap.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3DD2ADBC-555C-4DE8-8370-BA5C09DE11F4-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A80FF7C2-A8EA-481D-A23B-55A36357F209-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>At 2pm we went straight back to Longbranch for lunch, where we met Kierstin and Luella. Tess and I split Chinese noodles with veggies and tofu steak, and a veggie burger wrap. Once we moved our stuff to Kierstin&rsquo;s place we ran some errands - post office to send back some stuff we weren&rsquo;t using and the co-op for groceries. Outside the co-op we discussed just about everything with a man named Darren for an hour - photography, history of racial tensions in Cairo IL, Carbondale, biking, an on and on.<\/p><p>After, we headed to Buckwater Brew Works for a sit-down and a sip. We did some FaceTiming and split the most delicious (and probably biggest) pretzel I&rsquo;ve ever tasted.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CBABD84E-F703-4C09-A79A-5C887E35D79E-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When Kierstin and Luella got back to the house, we headed over and got our stuff set up. They were big fans of our sleeping bag. We talked for a while and then got to sleep early. Thanks again for hosting us Kierstin!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EE4702A0-15B8-4E35-8E25-4F1B73533450-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BD73827D-67B1-43A6-80D7-46302840B847-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><hr><p><strong>Rest Day Thoughts<\/strong><\/p><p>After a month of riding and about 1,000 miles, here are some key takeaways (lots of wood-knocking here):<\/p><ul><li>After falling just about every day, Tess hasn&rsquo;t fallen since Cincinatti! We loosened her pedals and she hasn&rsquo;t been doing podcasts or making phone calls while riding, which tend to distract.<\/li><li>My knee hasn&rsquo;t been hurting much at all since Ohio. Since then we&rsquo;ve been limiting our daily mileage, there&rsquo;s been a lot more variation in terrain, and we&rsquo;ve gotten stronger, all of which I think have helped.<\/li><li>Tess no longer fears hills. Her ability to avoid falls and the sheer number of hills we&rsquo;ve done has gotten her to this point. Missouri might test this - we&rsquo;ve heard we&rsquo;re in for some huge hills and narrow shoulders.<\/li><li>Motor vehicles are the one thorn in my side so far on this trip. You can wait out weather, you can scare away dogs, you can walk up hills if needed, but three-ton death machines are always a threat or at least an annoyance. A good or bad day is largely influenced by how much traffic we encounter. I eagerly await a future when there is a TransAmerica trail on bike-only roads.<\/li><li>We eat a LOT. We&rsquo;re always hungry. We&rsquo;re going over-budget on food because we can&rsquo;t control ourselves. Thankfully we&rsquo;re staying a lot of places for free, so we&rsquo;re gladly moving those funds into the food bucket.<\/li><li>People are mostly kind, or at least friendly. We&rsquo;ve seen a lot of generosity. It helps to clearly look like travelers, and the bike is a good conversation starter. Willie Weir, a longtime bike tourist and columnist, calls his loaded bike his &ldquo;passport&rdquo;, with which he finds it easy to &rdquo;initiate kindess&rdquo; in strangers. We&rsquo;re looking forward to the people we&rsquo;ll encounter on the rest of the trip. It&rsquo;s also important to remember the privilege we have as a young white couple, and how that influences the reception we get from strangers. We have heard about or seen very few people of color attempting what we&rsquo;re doing, and I can imagine the experience would be quite different, especially in the part of the country we&rsquo;ve been through most recently.<\/li><\/ul><p>One more day of Illinois, and then on to Missouri, the first state that will be new for both of us!<\/p><\/p>","date":"August 11, 2022","fields":{"date":"08\/10\/2022","day_number":"33","multiple_days":false,"weather":"Cooler, Finally","locations":{"single":true,"start":"Carbondale, IL","end":""},"miles_and_elevation":{"rest_day":true,"miles":"","elevation_gain":"","elevation_loss":"","flats":""}}}