{"ID":1073,"title":"Day 43 &#8211; Ash Grove, MO to Golden City, MO","content":"<p>We felt resistant to getting out of bed, but were eventually driven by our desire to eat more food. We packed up and reluctantly left the cool oasis of the bike hostel for Maple Lane Bakery again - we&rsquo;d scoped out the breakfast options at dinner the night before. The Southwest Sandwich didn&rsquo;t list meat on the menu but surprisingly came with sausage anyway. I guess we&rsquo;re deep enough into meat country that we&rsquo;ll have to start checking first. We felt bad sending them back, but after they subbed the meat for avocado it was worth it&hellip;incredible sandwich. Best breakfast sandwich of the trip so far.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AB0636CC-AF1B-4750-B628-1709973C3643-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>With the taste of heaven still on our tongues, we powered away from Ash Grove. A biker at the bakery had told us that we had about 24 more miles of hill country before the flat terrain began. We hit some pretty good ones, but were feeling strong and we had solid cloud cover. At one point it started to rain so we started waterproofing, but it stopped as soon as we finished.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/76BAC413-93DE-44D6-B747-EB7A964FB132-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/90872F0E-4C89-40E3-B0F5-45FAF52C4D4F-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8D07D7A9-9431-4A72-B347-668B4A798DA6-1024x549.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.BBA568C2-1264-4E0C-BE9F-89F4D540C6BE.mov\"><\/video><figcaption>One of the last hills<\/figcaption><\/figure><p>At exactly 24 miles, it got flat. From what we know and have heard, it will stay flat for a good long while. It was a very welcome change. The cross breeze turned into a tailwind as we turned north for the last few miles to get to our destination, Golden City.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B828220F-CD62-4FC5-8EC1-B35D01F813CB-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A15ECB4A-2E11-4100-8493-95EF9C3C20CE-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>A stop in Golden City is guaranteed for TransAm cyclists for the famous pie at Cooky&rsquo;s Cafe. Pretty much the only restaurant operating in the small town, it has existed in its location since 1946. We beelined for Cooky&rsquo;s the moment we arrived. It had a very cute interior with an orange motif and plenty of lunch customers for such an empty-seeming town. Our mouths watered as we walked by the huge pie display. We slid into a booth and were immediately attended to by one of the quick-moving servers. They provided us with the cyclist notebook that contained the WiFi password (TrumpPence2020). We got a small chef salad, basket of fries and of course, two pieces of pie - strawberry rhubarb (with a scoop of ice cream) and chocolate pecan. Magnificent. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F25BA877-4D07-48E5-B43F-FE2352706947-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/480C5FF1-F407-44F3-8D75-9E82BD9BF0A5.jpeg\" alt=\"\"><\/figure><\/figure><p>It was pretty early in the day still, so we hung around for a while. We listened to the waitresses talking about &rdquo;lazy Mexican immigrants&rdquo; and how Biden and Harris &rdquo;need to be done away with&rdquo; and what an outrage it is that they don&rsquo;t teach cursive in school anymore. Satisfied but not full, we left around 3pm, informing the staff we would be back for dinner.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CB39E502-3AB8-490D-BB96-87A7FC16380B-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>As we were packing up our bikes outside, Tess&rsquo; bike fell over on her and her pedal jammed into her knee. A man came over at that moment asking about our trip, saw the distress Tess was in, and ran to get a bag of ice inside. Charlie came back out a couple minutes later with ice and his name and number written on a piece of paper. He told us he lived across from the park, and to call him at any time if we had anything we needed while we were in Golden City. We were very thankful. <\/p><p>Our lodging for the night was a pavilion in the city park where we could pitch our tent, and we had access to the shower in the maintenance building. We decided to wait on showering as it was pretty hot and we knew we would be covered in sweat minutes after. I tried napping in the shade, but not long after the sun was beating down on me. We were thankful for the cold bag of ice, which we used in various ways to keep cool. Tess went and got us Gatorades from the gas station across the street.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/506F3BD9-6CCA-43AD-A712-7D8F4A8854A4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2E89DC77-EEE2-4504-B798-F9803B75EB7C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/971FC516-0DB4-4149-8843-3B975FB652F6-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FC0DBB69-949C-4BA1-AA53-253E181ABEB8-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B3B705CA-B654-4E40-B1B3-FF2DB8D8D09A-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>As it was getting towards dinner time, it poured for a good 15 minutes which helped to cool things off. Another cycling couple arrived around this time and set up camp in the neighboring pavilion. Matt and Grace are heading east, and we were happy to provide them with the code to enter the shower, which they didn&rsquo;t have. When it was late enough where we could justify going back to Cooky&rsquo;s, we showered and headed over. <\/p><p>This time, Tess got a catfish dinner with a mindblowing &rdquo;breaded tomato&rdquo; side, while I got a deluxe grilled cheese with a side of &rdquo;Suzy Qs&rdquo; - basically really thin curly-Q fries. For dessert, more pie! Tess got a coconut creme pie and I got a &rdquo;sawdust&rdquo; pie, which is basically a gooey cookie pie. We both agreed each of our pies were the best we&rsquo;d ever had.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BF6FC8A7-178B-45D1-AA24-02710F937C20-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/938161D8-99BB-4262-9F23-F24A58FBD812-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6004D48B-19DF-4746-A452-05617F7543C0-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C843EA8D-0458-4607-8923-3170599C0159-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3F4782CE-BEC1-4683-9571-635B3E88FA5A-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>This time we were definitely full when we left. Back at the ranch we set up our tent under the pavilion. It took me a while to wind down from all the sugar I&rsquo;d consumed, but eventually we fell asleep and dreamed of pie. What a day for food!<\/p><\/p>","date":"August 22, 2022","fields":{"date":"08\/20\/2022","day_number":"43","multiple_days":false,"weather":"Cloudy, Then Sunny","locations":{"single":false,"start":"Ash Grove, MO","end":"Golden City, MO"},"miles_and_elevation":{"rest_day":false,"miles":"36","elevation_gain":"938","elevation_loss":"922","flats":""}}}