{"ID":1172,"title":"Day 47 &#8211; Eureka, KS to Newton, KS","content":"<p>We decided to go big today (for us) with a 74-miler to Newton, emboldened by our performance the past couple days. Tess was a little unsure about how her knee would hold up, as it had started to hurt the day before. She&rsquo;d also been having her first bout with true saddle sore. We had a bailout point in Cassoday where we could end our day early if it came to that.<p>We had our delicious white chocolate craisin scones with hard-boiled eggs and coffee. The sun wasn&rsquo;t quite up yet as we set off, and we were actually a bit cold. We knew it wouldn&rsquo;t last long so we tried to enjoy the feeling. The sun started poking out not long after we left which looked pretty neat.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3E748446-E5B9-4766-B9FC-0C166563FAA8-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9A633843-28EB-444C-A00D-711F5622CF74-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/96D0EE8C-FC33-48CE-BB68-3124EA97F86A-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1308C652-A0C8-438D-875C-52E1B085ED05-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>It was about 18 more miles on busier Route 54 until our turn north at Rosalia. There wasn&rsquo;t much to Rosalia except a closed Mexican restaurant with a very foul-smelling dumpster next to it. After a snack and a rest we were more than ready to move on. There wouldn&rsquo;t be anything - and I mean anything - for the next 16 miles to Cassoday. We could have been the only ones alive.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C0965D61-E29A-4B72-BC51-FEC72FBB5F88-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0DB2BC54-079E-4772-8599-4DA95B02885F-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/05B28D45-27A4-4366-87B1-BDABF430939E-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1C17364B-9616-4B72-BCFA-EB313F379D5B-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>A little before Cassoday there was a barn next to a stand of trees where a few dozen horses were hanging around looking awesome.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8C08EC64-BF32-431F-BED8-AA7866E28B54-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>There were a few people on the porch of Cassoday Country Store when we pulled in, including the owners Rick and Jenny. We talked to them for a while about the importance of knowing where your food comes from and how the media is trying to drive Americans apart despite our many similarities. They get all their food from local farmers, and Jenny was making homemade burger patties from raw beef. I was almost tempted to try one (cooked, of course). By the cash register there was a tank containing a very young tortoise aptly named Torty.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9E82C116-8528-47C4-BA44-FCA6DAD143E7-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0A74A79B-4BA3-42EB-9B3B-837192B458B8-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2811484F-9871-48C3-A401-0D428E300171-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/46D2A8C2-74FD-479A-9A48-8E7A3AB970B3-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8DE57503-6F80-48B4-A118-D3F5F4D344FC-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Rick fixed us some egg sandwiches on Texas toast and coffee. An older man who up to this point had been quietly observing our conversation started chatting with us when we got our food. Eric was riding east on the TransAm trail on a recumbent trike, and we&rsquo;d actually heard about him from Matt and Grace. Apparently the three of them had arrived together at a church that housed cyclists, and Eric had burst open the doors and yelled &rdquo;The cyclists are here!&rdquo; It turned out to be poor timing, as a funeral was happening at the time. Matt and Grace had made sure to show that Eric wasn&rsquo;t &rdquo;with them&rdquo;.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BC53E997-4382-4821-A58D-F4A03779ED41-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Being a solo cyclist, Eric was chattier than we really had time for at that point, considering we had 40 miles left and the sun was getting higher. He was taking a rest day in Cassoday and camping at the Country Store. He showed us the daily knee stretches he had made up, and told us about his living situation in Santa Monica. When we could depart without seeming rude, we wished him a good trip and set off past the fuel pumps (&ldquo;No Fuel, Thank Biden&rdquo;). Tess had decided to push on to Newton where we were expected by a Warmshowers host.<\/p><p>The final 40 were tough in the heat. Before long, both of Tess&rsquo; knees were hurting and she popped some more aspirin. We had to take a couple emergency stops to get out of the sun. During one stop, we laid down on Tess&rsquo; yoga mat and ate a whole bag of Chex Mix. It being dry, the shade was actually quite comfortable compared to the humid Missouri shade. Approaching Newton, a big dust devil whipped up the debris on a newly-harvested corn field. I was flipped off by an oncoming driver when I weaved too far over looking up at how high the debris had been carried. <br><\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.01F4E04B-B9C6-4726-95C0-C9BF18C4B38C.mov\"><\/video><\/figure><p>When we finally got into Newton, we had to cross seven different train tracks, and a couple of them had trains running through. We were like &rdquo;C&rsquo;monnnnnn&hellip;.&rdquo; and tapping our feet impatiently.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6AA3B775-6AF6-4F13-A894-3A30FEAD1280-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E5118FE8-B23E-4850-BF18-B5A4D73F1C9A-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Eventually, we made it! Our host Orvin was sitting on the porch steps when we arrived and greeted us warmly. Orvin and Janet live in a massive, beautiful old house on the corner built in the 1880s.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CAB88FC4-9CEE-48CB-8353-7042112DFA66-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>As soon as we stepped inside, Orvin had two massive cups of water ready for us. This wasn&rsquo;t his first rodeo. He showed us downstairs where we&rsquo;d be staying, and in the kitchen we met Janet who was unhappy with how her pie crust was turning out. She had a homemade mulberry (picked from the tree outside) and rhubarb pie in the works for dessert. We met a few other creatures as well - Enzo, an old chill dog, a couple massive fish in tanks, and Tiger, quite possibly the largest cat we&rsquo;d ever seen. Tess was immediately smitten.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/51F7F996-86C3-4463-8A4B-2DD60BF1A7F3-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A4500580-E761-47AE-B9E2-31878184E571-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/288F44F1-4ECF-41E7-9083-714503C6EBE3-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/704F2934-7535-4483-A2A5-69790484FF21-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8830DA0A-D62A-4119-BB81-85222BCFFA70-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Janet and Orvin have a really interesting story. They met at Bethel College in Newton, and made the decision early on to not attempt having children. Instead, they have fostered and adopted children from traumatic backgrounds. They regularly visit Newfoundland, where they were originally obligated to go provide teaching services for two years when Orvin conscientiously objected to serving in the Vietnam War. A few years ago, Orvin and their two adopted children cycled to Alaska from Newton while Janet provided support services in their big, red 8-passenger van. Janet is a retired high school science teacher and Orvin is a retired petroleum chemist and farmer. They attend Mennonite church, which is directly affiliated with Bethel College.<\/p><p>After we took a catnap, we had a dinner of spaghetti, Texas toast garlic bread, and sweet corn. Next was the pie with ice cream, which was scrumptious. An in-depth, enjoyable tour of Newton from the van followed, where we saw a lot of cool street art.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A27757D1-5727-4BA6-8FF7-DA6A4BBA4B38-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9CD5CC80-D7D5-41EC-A4DD-BEAC9487AF8A-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We decided on going to a breakfast buffet the next morning at 6:30, their treat. We had a shorter day to Hutchinson so we weren&rsquo;t as worried about leaving as soon as possible. Not surprisingly, we slept very well.<\/p><\/p>","date":"August 26, 2022","fields":{"date":"08\/24\/2022","day_number":"47","multiple_days":false,"weather":"Sunny, Crispy","locations":{"single":false,"start":"Eureka, KS","end":"Newton, KS"},"miles_and_elevation":{"rest_day":false,"miles":"74","elevation_gain":"873","elevation_loss":"499","flats":""}}}