{"ID":1349,"title":"Day 55 &#8211; Eads, CO to Ordway, CO","content":"<p>Catch up time! Had a few days off after reaching Pueblo, and didn&rsquo;t have time to post.<p>We didn&rsquo;t end up seeing much of Eads, but we got to know its Cobblestone Inn and Suites pretty well. During the usual delicious breakfast, the trio of eastbound cyclists rolled through the dining room and we wished each other a good trip. Before they left we got a picture of them with their gear. Brice&rsquo;s Da Brim helmet shade apparatus made us excited for ours, which would be arriving in Pueblo in a couple days&rsquo; time. They&rsquo;d been sold out for a while online, but Tess&rsquo; dad called them and was able to secure the last two they had on hand. Thanks Alan!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/55E6EB0A-8A52-4C11-B77D-6B8F87DA4747-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We were determined to get in earlier than we had the day before to avoid the heat of the sun. We basically made one stop in Haswell and otherwise rode straight through. Around Haswell a man in a pickup in the oncoming lane yelled &rdquo;fuck you&rdquo; and threw an empty Coke bottle at me, which missed. He seemed nice.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/379651DF-36D8-4845-A96E-088BA0BD7244-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A69BBDFF-FA10-4C8D-8A20-8D078BBC5D4C-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Riding was pretty smooth, and around noon we stopped in Sugar City, a small town five miles down the road from Ordway. As we approached the town and its shiny white grain elevator, it looked like Oz, and the sunflowers lining the roads were reminiscent of poppy fields. <\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.9F13C55B-B60B-4AA2-BB8C-6BFE6207D6F8.mov\"><\/video><\/figure><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6A4FDB77-D4C9-432F-957D-FEFAA9398B12-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4A1B9D7F-A62E-42DA-B750-245966119955-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We had been told to go to Lynette&rsquo;s Sugar City Cafe, so we stopped at the sight of its appealing exterior. Outside, we blew the minds of a couple locals who had never heard of people doing such a thing. Aside from a comment about how the government was trying to poison people in New York via drinking water, they were very friendly and wished us luck on our trip.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1FE3F9AC-3D32-4610-BD56-C49DAFFCC945-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The inside of Lynette&rsquo;s was even more appealing. No music, frozen in the early 1900s, and most tables filled with old-timers and young cowboy types. The menu was short and mostly meat, so when Lynette came around, Tess asked, &rdquo;Could I please have two eggs&hellip;&rdquo; Lynette cut her short. &rdquo;You sure can&rsquo;t.&rdquo; She wasn&rsquo;t kidding. Breakfast ended at 10:30, she said. We decided to wait until Ordway to get a meal, instead settling on pie and iced tea (apple crumb and blueberry). They were quite tasty.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B17206D8-68E3-4E5A-BCB9-F04CD7DFFBF4-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2006D3CD-DCC5-45AB-A8B7-90CE75C2758A-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/88C9BD4C-8D32-404F-A4EE-B7F6CAA2B79E-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Despite the heat, the five miles to Ordway felt easy after our pit stop. We passed the big feed lots that Guy and company had told us about as we were coming into town. I&rsquo;ve smelled many better things in my life.<\/p><p>We headed to Sand Cherry Coffee for lunch, where we had veggie wraps with Italian sodas (canteloupe for me, blood orange for Tess). A large group of older women that had been having a meeting of some kind at a nearby table all questioned us individually about our trip. Back outside, we noticed that the town had a smell due to the feed lots, another thing we were warned about. The city park where we planned to camp was small and not very appealing, so out of curiosity we checked out the Hotel Ordway across the street to see if they had any rooms. Not only did they have affordable rooms, but they were fancy! We didn&rsquo;t hesitate to snag one on the ground floor. Tess told me to strike a seductive pose on the bed, and I think I nailed it.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/456740AB-FE36-4302-AC90-0F0C8D5FDFA5-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After a nap we headed out to get dinner at Feelin&rsquo; Saucy, really the only dinner game in town. When we emerged from the hotel, we discovered the stench outside had increased tenfold. This made us extra glad we weren&rsquo;t staying in the park. At dinner we talked to some friendly locals. As the town is based around the feed lots, he remarked that it &rdquo;smelled like money outside&rdquo;. I asked how often it smelled like money, and he said whenever the wind is blowing this way. We split a salad, Tess had some ravioli and I had a veggie version of a Philly Cheesesteak which was actually pretty good. After dinner the smell wasn&rsquo;t quite as bad so we walked up and down the main drag a little. There was a very out-of-tune piano outside a store that I played for a short time.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BD25FAFC-3341-491D-A6D2-E83BA0DF55E7-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DAEA4413-AD3F-468F-B03D-38441980FF80-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/420B14B2-FD6C-499C-9446-09DEAEC84671-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5FF03068-8952-4C92-865F-33EEBA26E01E-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Afterwards we headed back to the hotel and fell asleep to Bridges of Madison County. We quite liked Ordway (or Odorway as we lovingly called it) and its residents, despite the smell.<\/p><\/p>","date":"September 6, 2022","fields":{"date":"09\/01\/2022","day_number":"55","multiple_days":false,"weather":"Hot","locations":{"single":false,"start":"Eads, CO","end":"Ordway, CO"},"miles_and_elevation":{"rest_day":false,"miles":"61","elevation_gain":"568","elevation_loss":"463","flats":""}}}