{"ID":1374,"title":"Day 56 &#8211; Ordway, CO to Pueblo, CO","content":"<p>Sub-par hotel room Folger&rsquo;s coffee started our day off, but the caffeine was needed. We had about 50 miles to go to get to Pueblo, the end of our last TransAmerica trail map, and the beginning of the Western Express map. Once we made it to Pueblo, we had a three-day hiatus planned with our friend Mel from Denver (originally Buffalo), which lined up nicely with Tess&rsquo; birthday.<p>Tess&rsquo; tire was flat again when we woke up, so we pumped it up again, figuring we&rsquo;d have the bike shop in Pueblo find and patch the slow leak. We were going there anyway to (again) sort out Tess&rsquo; bike before the Rockies. Still doesn&rsquo;t count as a flat if it holds air!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/16A1AB17-CF28-4373-B90D-822A98E25737-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Immediately upon turning onto Route 96, a pickup truck rolled coal on us. It was very successful, as the black smoke from the exhaust pipe lingered around us for a good 10 seconds. If I weren&rsquo;t annoyed I would have been impressed.<\/p><p>We had our first glimpse of mountains in the Ordway area, though distant and faint. As the day wore on, their looming presence grew. The terrain started to get more rugged as well, though it was still mainly flat.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6D917CAF-1D6D-4AB9-8ABF-5474ECA0366A-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/339BD75C-7E49-452A-A7A3-A4B3C6A793FD-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Prior to reaching Boone, we passed the 2,000 mile mark! The second 1,000 miles went a lot quicker than the first. In Boone we stopped at Figaro&rsquo;s General Store, run by a very nice man. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/755FD0EE-8E8E-4473-A768-A5E9130D0AE1-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>With 15 miles to go, we turned onto Route 50, which at this juncture was a full-on four-lane highway. The shoulder was huge, but I wasn&rsquo;t very comfortable with it. At one point a car pulled onto the shoulder a way&rsquo;s ahead of us, forcing us into traffic. The driver was throwing up and looking sad, which drew sympathy from Tess. I, however, had no energy for sympathy and was focused on staying alive. On the last quarter mile before our exit the shoulder dwindled almost completely so we booked it as fast as we could.<\/p><p>There was a lot of car traffic getting into Pueblo and it was quite hot, so we were happy to arrive at Grounded Cafe for lunch. After the meat-centric cuisine of Kansas and Eastern Colorado, my portabella mushroom panini and Tess&rsquo; fig and goat cheese panini were very welcome, if a bit pricey. They even came with a side bag of cherry tomatoes! It was good to be in a bigger city again.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6BF8A8C0-4096-4BC9-995E-087BD5905597-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6317F8C3-29CE-4E83-B716-465C678B632F-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>From there, we headed to Great Divide Ski Bike and Hike to drop our bikes off. Tess got an awesome new bike jersey to replace the tank top she sent back. After waiting for about 45 minutes, an Uber finally came to pick us and our gear up to take us to our hotel on the southern edge of town. When we arrived, our Da Brims and a package from Tess&rsquo; mom were waiting at the front desk.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AC5B20CB-775C-4286-BEF4-C9C34D11E40F-769x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/422E9B3F-867F-4711-905F-962946B7719E-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After calling my sister, we showered and napped until Mel arrived. Since our reservation was only for two, we had to be a bit sneaky about Mel&rsquo;s entrance. She came bearing some packages we&rsquo;d delivered to her house. It was like Christmas! Even though we hadn&rsquo;t seen Mel in earnest since before COVID, it was like no time had passed. We tried on some huge brimmed hats we&rsquo;d ordered before Alan was able to secure us the Da Brims.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/60C599E6-6188-405D-A78B-12D531E1E23D-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/48861EBC-B238-48BD-98BE-095DEEA68965-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>For dinner we headed to Mr. Tandoori&rsquo;s downtown. In keeping with the Pueblo theme, we ordered spicy green chili and cheese naan which was quite good. During dinner Tess got a FaceTime call from Rachele, who had invited some of Tess&rsquo; friends over to celebrate her birthday in her absence. What a sweetie.<\/p><p>Unbeknownst to us, behind the restaurant was Neon Alley. You can see from the pictures below why it was so named.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/744F9585-6668-408C-AD2F-B72C913F6565.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3767B36F-EC72-46E5-8642-8F21FFC6C2DD.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/333FDFAA-0D6B-4778-B412-D45C491F1168-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1FD22D38-E5CE-4A7A-B53B-0B8D1B96D132-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We walked through Pueblo&rsquo;s super cute downtown to The Clink, a cocktail bar situated in an old jail, but they were closed. We settled for Brues Beer Garden next door, which had a patio down on the level of the city&rsquo;s gorgeous riverwalk. We had a swell time catching up with Mel, and I had a rare real beer to celebrate Tess&rsquo; birthday. Mel filmed our rendition of a Fleet Foxes song under the bridge as we headed back to the car.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/80A02395-B404-4B9F-826C-285B7EFBE441-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8CF86F4B-E6A1-4ACA-B2FE-F45D39348C7C-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.C525F0F5-8939-4813-A3DD-A5751F229C8E.mov\"><\/video><\/figure><p>We drove back to the hotel and snuck in the side door to avoid possible questions about the third occupant. Probably over-paranoid. We fell asleep to a Harry Potter marathon, hoping to get some quality sleep before an action-packed weekend.<\/p><\/p>","date":"September 7, 2022","fields":{"date":"09\/02\/2022","day_number":"56","multiple_days":false,"weather":"Quite Warm","locations":{"single":false,"start":"Ordway, CO","end":"Pueblo, CO"},"miles_and_elevation":{"rest_day":false,"miles":"49","elevation_gain":"525","elevation_loss":"151","flats":""}}}