{"ID":1490,"title":"Day 62 &#8211; Westcliffe, CO to Salida, CO","content":"<p>We&rsquo;d created a two-part breakfast plan - pastries from Sugar and Spice Mountain Bakery, and coffee from Peregrine Coffee Roasters. The plan was executed successfully and enjoyed. We went a little overboard at the bakery - a slice of veggie quiche, blueberry muffin, sticky bun, toffee bar, and lemon bar were purchased. We figured it would cover breakfast and lunch. We enjoyed our treats in the motel room, which was nice but we ended up leaving after 9 because we were so comfy. Though it was cold when we went to get breakfast, it was already warm when we left.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6E473E7D-DB1D-44C7-8FDC-C36D3EA0B0D4-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3AF5699C-C21E-48C8-9807-3B630C4AF568-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/216F0D14-D163-4E17-A323-2385C4E4F856-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We rode through Wet Mountain Valley north on Route 96 for about 15 miles, and the surrounding mountains were gorgeous though it was a bit hazy. Traffic was fairly light and we felt at ease.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AFF2C633-8F75-4D4E-8E9F-8723AD87D583-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BE7ABFE6-F57D-4E4D-B297-97C52CB9453C-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/63B96967-1C95-49DD-B830-CCF2B9036F18-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We turned onto Route 1A which gave us some climbing followed by a long downhill through a canyon. Each curve revealed a cool new rock feature. Tess was having trouble with her Da Brim, which kept blowing her helmet back because it wasn&rsquo;t tight enough.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/20C5CB-95AC-4389-AFCB-0D4F130CBB07-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/06C1E810-C0EC-43D2-A720-5E23859F2F69-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>At the bottom we hit the small town of Cotopaxi which had a delightful little country store across from the Arkansas River. Down here the canyon really got canyony. We had some Gatorades and fixed Tess&rsquo; helmet.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C12CFB05-2F7C-4C0E-B179-7D86AE03C197-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FDD259D1-825A-4DE4-8C64-D7C4B80919D3-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/19964434-762C-40C5-91BC-B963070E51A6-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We turned onto Route 50 where there was a definite uptick in traffic, but the shoulders were OK and the scenery was gorgeous. People were camping, fishing, and rock climbing all over, and the water looked really inviting. We were really in the Rockies now, we felt.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/332A60F7-1ED4-471C-AF7F-79BC092B6CB6-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EFF279D8-B922-4C5F-A521-46DB0C5AD85A-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C48EB5D0-D7D6-4590-B24E-BE1355C9D917-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9D027CEA-53DA-4542-AD40-9AF919707BE7-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Eventually the narrow canyon opened up into a wide valley. Around Howard, the traffic got pretty bad, made up of mostly RVs, massive pickups, and Jeep Wranglers. A couple of them rolled coal on us. It was also getting pretty hot, so we were itching to get to Salida. Tess in particular was disgusted and frightened by the traffic. After a lot of curves along the river - which would have been lovely without cars, as always - we arrived in Salida. Later I looked at the &rdquo;Riding Conditions&rdquo; section of our Western Express map and they said that section had the heaviest traffic of the whole route. That was comforting to know.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B826345F-7639-4FFA-9857-978A01713B14-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>By the time we got to Salida&rsquo;s downtown (good Ithaca\/Burlington vibes), I was pretty cranky. I later deduced that it was due to being tired, hot, hungry, and thirsty. We stopped into Howl Mercantile and Coffee so we could satisfy the thirst part. I about lost it when my bike fell over on the sidewalk. The terrible, repetitive hipster music playing in the cafe didn&rsquo;t help either. Tess captured my annoyance for posterity.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AB5BD961-35F6-45BF-9C70-DC94F1B05045-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Another reason we were cranky was that we couldn&rsquo;t satisfy the fatigue need because our Warmshowers host wouldn&rsquo;t be available until after 5pm. After a quick discussion we decided that since our Continental Divide traverse was the next day, satisfying our fatigue needs was of the utmost importance. We booked a private room at the Salida Hostel nearby, and after letting our Warmshowers host know, before long we were napping in the &rdquo;Sunset Room&rdquo; (after I shoved a Kind Bar in my mouth to satisfy hunger).<\/p><p>Before we headed back out to town, we met Tyler, a really nice guy from West Texas who was hiking the Colorado Trail. We also met one of the owners of the hostel, originally from Jersey, who recommended that we go a different route over the Divide. Route 50 over Monarch Pass had an inconsistent shoulder and too much traffic, whereas the hard dirt road over Marshall Pass was gorgeous and had no traffic. It also led directly to Sargents, our destination. Tess was very interested after today&rsquo;s traffic, but I had my reservations, remembering our troubles on previous days where we deviated from the official route. We said we&rsquo;d consider it, and headed to Absolute Bikes.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FF30AEAC-1A4B-4A42-BAFB-899721786DF2-883x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The tread of my rear tire was all worn down so I needed a replacement. The one I decided on was a little more gravel-oriented than I would have liked, but seeing as we&rsquo;re not looking to set any speed records I figured it would serve me fine. At the register we were discussing our bike trip with one of the employees and without us mentioning it, he also recommended Marshall Pass over the paved Monarch Pass. I had him look at both our bikes and tires, and asked if the route would be suitable when we were fully loaded. He said it would be no problem, that the roads were nice. His comments about worrisome traffic on Route 50 struck a chord with Tess, and I agreed, as I figured who better to trust than local bikers? <em>Spoiler alert: the answer is the Adventure Cycling organization that creates bike touring routes based on tried-and-tested tours.<\/em><\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B2E16006-E94E-4150-8B2E-C8D40CC50C39-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We had a delicious pizza and salad dinner (again) at Amica&rsquo;s pizza, followed by a cannoli. Can&rsquo;t go wrong with thin crust, veggies and pesto!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/95EAB8E4-B30C-43AD-A1AA-61B14D4B7C6D-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After dinner, we headed back and I put on my new tire and finally replaced Tess&rsquo; tube that had the slow leak.  Okay, okay - if I have to replace it, I guess it counts as a flat. I got all sweaty and covered in bike grease so I took another shower and went to bed. Nerves were a little high in anticipation of the big climb, so I laid awake for a while.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6A5C0B63-3EF7-4891-9DA3-BEE615BF909E-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"September 10, 2022","fields":{"date":"09\/08\/2022","day_number":"62","multiple_days":false,"weather":"Sunny, then Cloudy","locations":{"single":false,"start":"Westcliffe, CO","end":"Salida, CO"},"miles_and_elevation":{"rest_day":false,"miles":"48","elevation_gain":"2218","elevation_loss":"2963","flats":"1"}}}