{"ID":206,"title":"Day 7 &#8211; Medina, OH (Rest Day 1)","content":"<p>Tess and Meg headed to yoga early, so I woke up to a quiet house. I have an aversion to Keurigs (as some old NFTA coworkers well know), so my first trial of the day came quick.  Free coffee, or environmentally responsible coffee? Now that I&rsquo;m jobless, free won out. My tiny carbon footprint these days should negate that pretty quickly.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A99F67A2-E648-4C17-BAFB-1B9B62C121EA-768x1024.jpeg\" alt=\"\"><figcaption>Sweaty palms<\/figcaption><\/figure><\/figure><p>Our friend Matt was supposed to come up with Meg the day before, but is recovering from COVID so decided to wait another day. We appreciate his responsible decision. Therefore a buddy day turned into a solo day, which worked out OK since I had a little to-do list to work on:<\/p><ul><li>Laundry at laundromat<\/li><li>Renew car registration<\/li><li>Separate out gear to send back with Matt and Megan<\/li><li>Write blog post<\/li><li>Do some yoga<\/li><li>Study Spanish<\/li><li>Install Tess&rsquo; bike horn<\/li><li>Charge all electronics<\/li><li>Watch 30 Rock<\/li><li>Take a nap<\/li><\/ul><p>I got some bike time in zooming around town with laundry and delivering coffees to some tired ladies at a yoga training. Mental note: do not get used to the weightlessness of riding an unloaded bike. Medina is feeling like home already, probably because it&rsquo;s basically the East Aurora of northeast Ohio.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EC12AC11-F8FF-48F4-A4DE-CE0AE23DA6E1-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/546D3C7A-ADE5-4595-BA4F-BCBDCCAA9EF2-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After slaughtering my to-do list I dozed in the sun with a grapefruit seltzer in hand.<\/p><p>Tess and Megan finished an hour early around 7pm and I met Tess, her yoga friend Bree and her mom Anita at (yet another) Mexican restaurant. They were exhausted but excited about the day. Nick drove in from Stow to join us soon after. He stood his ground when they brought him a carne asada burrito, insisting on the bowl version he ordered. We were proud of him.<\/p><p>Megan had gone to meet the arriving Matt at the Airbnb and locked herself out in the process. Yolanda saved the day! They went to a different restaurant with an outdoor patio for Matt&rsquo;s sake, where we met them after our dinner. On our way, Tess disappeared into the dog vortex with two pups named Fudge and Herbie. I knew it would be a while so in the meantime I got some footage of a band that was playing in the gazebo in the square. <\/p><figure><figure><img src=\"https:\/\/i0.wp.com\/wheelie-babes.bsik-site-wp.test\/wp-content\/uploads\/sites\/3\/2022\/0199DD76-A5AE-4DEC-8481-D041E30C0780.jpeg?fit=768%2C1024&amp;ssl=1\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.330A66BA-D503-4122-A6C3-CB50EF59E811.mov\"><\/video><\/figure><p>Later, Nick, Tess and I got the selfie we had neglected to take during our visit with him.<\/p><figure><figure><img src=\"https:\/\/i0.wp.com\/wheelie-babes.bsik-site-wp.test\/wp-content\/uploads\/sites\/3\/2022\/F4EA054C-5F05-4C1D-A684-946CAD01D3E3.jpeg?fit=1024%2C768&amp;ssl=1\" alt=\"\"><\/figure><\/figure><\/p>","date":"July 16, 2022","fields":{"date":"07\/15\/2022","day_number":"7","miles_and_elevation":{"rest_day":true,"miles":"","elevation_gain":"","elevation_loss":"","flats":""},"weather":"Sunny, Pretty Warm","locations":{"single":true,"start":"Medina, OH (Day 1)","end":""}}}