{"ID":1789,"title":"Day 72 &#8211; Telluride, CO to Priest Gulch, CO","content":"<p>We slept a good 11 hours that night while Buddy Guy was blaring from the mainstage and people were partying around us. When we were packing up in the morning, so were Anoop and Ariel, who had stayed up all night but needed to get to Denver to catch a flight that evening. As we were heading to breakfast we also caught Dalan and said our thanks and goodbyes. We&rsquo;d completely neglected to get a picture of any of them.<p>In town, The Butcher and Baker had a line out the door so we went back to the Phoenix Bean. Turns out they were out of most food items because it was their last day in business (the storefront was purchased by a fishing supply company or something). So we ordered a couple cafe au laits and brought them to Baked in Telluride. The place was brimming with delicious breakfast items. I got an egg and cheese croissant (they did not skimp on the eggs, so delicious) and Tess got a bagel sandwich. We got a couple Dosants - glazed croissant donuts - for the road. <\/p><p>The way out of town was south on Route 145, which was an immediate incline for a few miles. At the top, Sunshine Mountain and Wilson Peak came into view. We wound our way through thick aspen groves in the cool morning air.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7808D1C3-9379-4258-AB87-36274962040A-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DD5B01B1-ABC6-488D-84C3-B36FD1D032CD-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5AC25902-3B8A-4AE8-9FB6-E088F39B939E-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Around a corner and boom - an incredible vista of San Miguel Peak framed by a perfect U-shaped valley came into view. From there, we had one more long climb up to Lizard Head Pass, which would be our last pass in the Rockies.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1C556661-136F-4B21-955B-CFFA5047706B-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B9EF92-B3FF-44FF-920C-1C966E155C31-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D9ECE5BE-7E1F-4EB4-B5AF-45D03909C47D-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.1446CD8D-8EE1-4503-9CFF-B2052563956C.mov\"><\/video><\/figure><p>On the way up to the pass, a bee got into Tess&rsquo; jersey and stung her a couple times. She hasn&rsquo;t had great luck on passes as of late. She applied some of her magic creams and we continued on. Towards the top we passed the picturesque Trout Lake. Like with most other lakes we&rsquo;d seen, the water level looked low.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/49302ABC-4F41-46BD-96B3-D7E3CF9EF944-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D9551B89-0B70-4EC5-BDE7-CE5B544366DB-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>&ldquo;Dosants&hellip;dosants&hellip;dosants&hellip;&rdquo; we chanted as we neared the top. As usual, an annoying headwind plowed into us at the crest. We celebrated our achievement with a sugary delight. The dosant was so good, I was mad at myself for only getting one.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/20502D3D-8BBF-48A4-96E9-572AD2D0E2EF-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/869E00DF-8F3D-4DD0-940D-7A577813F9E7-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Down the mountain, shaken about by winds, getting passed dangerously close by older folks in giant Winnebagos&hellip;it was all routine at this point. We reached the little town of Rico around midday ready for some lunch. We only had a vague idea where we&rsquo;d stay tonight. Maybe along the river in Rico, or one of the many campgrounds down the road. In Enterprise Bar and Grill, we ordered (and waited close to an hour for) a veggie pizza. While we waited, we had a conversation with Lew, Ginny, David and Linda who were staying down the valley at Priest Gulch Campground in their RVs for the summer. They were from Arizona and made a habit of leaving town during the summer months. They recommended Priest Gulch highly, so we decided we&rsquo;d get a tent site there. We were urged to come hang out at their sites if we ended up there, to which we agreed.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/00339224-6DE0-400E-8DF0-AFC312CC3D34-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4E965550-B4DC-4CCD-A9B2-311C737B7037-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After lunch we wandered through Rico to find some groceries for dinner. We found Fireweed Cafe and Mercantile, which had groceries and a delightfully hipster vibe. Why hadn&rsquo;t we come here for lunch? Instead we ordered a couple wraps to go along with some other goods, and continued on down the dusty trail.<\/p><p>Priest Gulch is perched along the Dolores River, and looked mighty inviting as we pulled in. Many of the RV customers spend the entire season there, and get a little too settled - gardens, lawns, and patios meticulously cared for. Our site was right on the river. Definitely a top 5 campsite of the trip.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DCD6D66C-7EBD-46FE-A2F8-EF097A424928-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After showers and getting laundry going, we walked over to Lew and Ginny&rsquo;s site. We sat around their fire, were given libations, and chatted for quite a while. David and Linda also joined a bit later. We met a lot of the other camp residents that passed by, as everyone seemed to know each other. We had a lovely time, and remembered to get a picture with Lew and Ginny before we left for dinner.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D1DBDD3B-64A0-4C72-B209-97E9425B1C05-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After our delicious veggie wraps and a few too many peanut butter sandwich cookies by the river, we retired into our tent. It had gotten super cold, so we had all our layers on. The sound of the running water was heavenly.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F5FB9347-501D-4A0F-92EB-7FB6765EB84E-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/98F06B50-637E-4BD3-AB31-133090A21598.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"September 21, 2022","fields":{"date":"09\/18\/2022","day_number":"72","multiple_days":false,"weather":"Great","locations":{"single":false,"start":"Telluride, CO","end":"Priest Gulch, CO"},"miles_and_elevation":{"rest_day":false,"miles":"40","elevation_gain":"2054","elevation_loss":"2825","flats":""}}}