{
    "ID": 1891,
    "title": "Day 76 &#8211; Dove Creek, CO to Monticello, UT",
    "content": "<blockquote><p>Together we could break this trap, we&rsquo;ll run 'til we drop, baby, we'll never go back</p><cite>Bruce Springsteen, on leaving Dove Creek</cite></blockquote><p>It was raining as we pedaled away from the Country Inn Motel, and it kept up for a big portion of our ride to Monticello. We think this was the first time we were riding in the rain since Ohio. Could that be? We&rsquo;ll have to check the tapes. It was a refreshing change from the usual sun beating down. Semi trucks would be followed by huge clouds of mist that would lightly coat us and our gear. It felt like it had been longer than one rest day, and we were relieved to be moving again.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/04922BD9-37B9-4CBA-A1E6-26C78EB47D9B-1024x768.jpeg\" alt=\"\"></figure></figure><p>After not too long, we hit the Utah border! It&rsquo;s been a while since we hit a new state. Tess got all up on that Utah sign. It was a nice lookin&rsquo; sign, to be fair.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/A55A05F3-C724-46B4-8142-663AC0034231-1024x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/5340E563-B00E-4034-AEF2-EEF787B0AB6A-768x1024.jpeg\" alt=\"\"></figure></figure><p>The sun slowly came out, and as the road curved west we started getting a decent headwind. We first saw Monticello from pretty far away, which is always a tease - it took way longer to get there than we thought. </p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/CB4B6837-5DB9-40C9-AD99-1318E862B4D8-1024x768.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/5874FE07-7CBC-4D46-AB6E-DF991B0DF27E-768x1024.jpeg\" alt=\"\"></figure></figure><p>First stop was the Atomic Blue Motor Inn, our home for the night. Our room was ready early, so we got clean and gussied up to hit the town for lunch.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/B4B6204C-4156-4ED8-A1B4-CD5BF6F97B96-1024x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/135C47DD-69B2-43A3-9D12-DC8470D9060F-768x1024.jpeg\" alt=\"\"></figure></figure><p>Wouldn&rsquo;t you know it, there was a Thai restaurant in town! We hadn&rsquo;t had anything but American and Mexican food for ages, so we were really excited. It was a little bit of a walk to get there, and when we arrived there was a cash only sign so we had to walk back to the gas station ATM. I was a little cranky from hunger and thirst, so a Gatorade got me halfway to satisfied. When we finally got our food, we were more than satisfied - it was some of the best Thai food we&rsquo;d ever had. We started off with a tofu salad in a spicy lime sauce, followed by Pad See Ew for Tess and Drunken Noodles for me. Wowzer. We were super tired and gassy after but it was so worth it.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/CF5DBD09-669A-40F7-B203-EF80C9FCE467-768x1024.jpeg\" alt=\"\"></figure></figure><p>We headed back to the motel and napped very hard. I&rsquo;ve been having a recurring dream about going back to grad school and taking a calculus class, which continued during this particular nap. What does it mean??</p><p>After the nap, we relaxed outside on our little patio in the afternoon sun. The temperature was absolutely perfect with no humidity. We got veggies and hummus from the grocery store for dinner, plus I got some Reese&rsquo;s Pieces for dessert. What I really wanted was Nutter Butters but they didn&rsquo;t have it! Have you ever heard of a supermarket not having Nutter Butters? Outrageous.</p><p>Titanic was on TV, which really hit the spot. We thought Back to the Future was on next, but they just started playing Titanic again which we saw as a sign to go to bed. One last easier day tomorrow, then heading into a 3-day desert stretch with no services. Excited for the challenges ahead!</p>",
    "date": "September 23, 2022",
    "fields": {
        "date": "09/22/2022",
        "day_number": "76",
        "multiple_days": false,
        "weather": "Rainy, then Sunny",
        "locations": {
            "single": false,
            "start": "Dove Creek, CO",
            "end": "Monticello, UT"
        },
        "miles_and_elevation": {
            "rest_day": false,
            "miles": "25",
            "elevation_gain": "1020",
            "elevation_loss": "814",
            "flats": ""
        }
    }
}
