{"ID":2377,"title":"Day 90 &#8211; Cedar City, UT to Milford, UT","content":"<p>Milford is the last stop before the long desert stretches of Nevada. We woke up after our rest day rejuvenated and ready to hit the road. More Raisin Bran and coffee, and we loaded up our freshly oiled bikes and got our goodbye photo with our generous hosts.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2D1F8A8C-F92B-4CCF-8040-968777B69FB2-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C9445E93-AD0F-49F2-AE35-658401C1D2B9-1024x768.jpeg\" alt=\"\"><figcaption>My new tape job<\/figcaption><\/figure><\/figure><p>The road out of Cedar City was thick with commuters. We stopped at a gas station so Tess could hit the restroom, and what do you know it was also a Cinnabon! After a couple cinnamon buns, we were sugared up for the day. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A17DE07E-0D13-4D52-9028-CE71609372EA-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3EF49E66-1D63-4417-AB09-B5BB4B75E2B6-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Once we passed the highway interchange the traffic died down a bit and it got pretty desolate. We noticed several empty semi trucks pass us going north that looked like they were meant to hold animals. Then&hellip;one passed us going south and the foulest stench filled the air that lingered long after it passed. What was in there?? A few minutes later&hellip;another one passed and our nostrils were choked by the same rotten intestinal smell. After a while every time I saw one coming in the distance I would yell, &rdquo;NO! <em>NO!&rdquo; <\/em>and then let out high-pitched screams as they passed. Tess got a kick out of it, but I was really suffering. Later we finally figured out the southbound trucks were filled with pigs; we noticed their pink snouts sticking out of the holes. I can only imagine they were being brought to the city to be slaughtered. Yet another reason I&rsquo;m glad I chose vegetarianism. To lighten the mood and pass the time, we made up a song about pigs and poop. Keep an eye out for it on the Billboard Hot 100.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/01D2D6DE-1822-4932-AB5F-F65DD833F4A8-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The big mystery was the origin of all these pigs. We figured it was Minersville, the only town between us and Milford. When we stopped there for a snack, however, we didn&rsquo;t see or smell anything. That could only mean&hellip;no&hellip;was it in Milford?<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F3DD015D-04FC-4E1A-8056-EBD537F85F7C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6A09F7F3-E3C5-4CFB-B81D-7D80B5E34DC4-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Indeed it was. Disgustingly called the &ldquo;Smithfield Hog Production Mill&rdquo;, it was east of town as we rolled in. Fortunately the wind was favorable and we didn&rsquo;t smell anything. We arrived at our hotel which awesomely had a 24-hour diner on site. Apparently, Penny&rsquo;s Diner is under contract by the Union Pacific Railroad (which runs through town) and has a shuttle to bring railroad workers to it during all hours. We decided to have a late lunch there before we showered and napped.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/331A7389-2479-4AB9-92C5-CEFED24425D4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/39536016-E21D-487C-86E7-91BC8CA51F02-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We had a nice restful day at the hotel and dipped into our food bag for dinner. We planned to have an early breakfast at the diner the next morning and figured three diner meals in 24 hours might be a bit much. We got to bed early, as we planned to do the entire 83-mile stretch to the next town in one day. This was the stretch we&rsquo;d put on a pedestal since the beginning of the trip, but we felt confident we could pull it off. We fell asleep to Jackie Brown, whose main character&rsquo;s badassery got us pumped up for the next day&rsquo;s journey.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/28A36B43-30D7-47BA-A50D-8F82AFC70813.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"October 12, 2022","fields":{"date":"10\/06\/2022","day_number":"90","multiple_days":false,"weather":"Pleasant","locations":{"single":false,"start":"Cedar City, UT","end":"Milford, UT"},"miles_and_elevation":{"rest_day":false,"miles":"57","elevation_gain":"1506","elevation_loss":"2320","flats":""}}}