{"ID":2594,"title":"Day 99 &#8211; Fallon, NV to Carson City, NV","content":"<p>After we packed up our gear we set our sights on Telegraph Coffee and Tap for some breakfast. The coffee was delightful, and so were the pastries. We had some oatmeal after to better fill our stomachs. Our ride today was mostly flat and mostly a straight shot to Nevada&rsquo;s capital.<p>With the cool morning breeze in our face, we were getting into a nice groove early on. I noticed that while the shoulder was nice and wide, the road had widened into more of a freeway. Puzzled, I checked the route and found out I&rsquo;d missed a turn five miles back. We were on Route 50 Alternate, not Route 50. Our day just got ten miles longer. I never really regained my good mood from that point forward. You can tell by how few pictures I took today.<\/p><p>What&rsquo;s more, when we stopped to strip our layers a little later, I found out my back wheel was wobbling, signaling a hub issue. The mechanic in Cedar City had mentioned he&rsquo;d needed to tighten the rear hub, so I was starting to think there was a deeper issue. I figured I&rsquo;d be fine until Carson City where I could take it to the bike shop. They closed at 4, so we kind of had to book it.<\/p><p>Rumble strip shoulders continued, and we were really starting to tire of it. It was pretty hot due to the lower elevation as well. When we pulled into Silver Springs to get a cold drink, we were at a pretty low point. We agreed that in this moment we were ready for the trip to be done. Next door, a little flea market was going on and a confederate flag was flying. Get us out of here! <\/p><p>Thankfully, the shoulder improved right after Silver Springs, and the road widened to four lanes. It was straight and repetitive though, and traffic was pretty heavy. Riding down into the valley into Carson City, it felt like we were on a treadmill, never getting any closer.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A2D35E2B-57D2-43A3-99CD-9C09D057F6C3-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>At long last, we arrived at the Bike Smith and left my bike in Adam&rsquo;s able hands. We&rsquo;d planned to stay with a Warmshowers host, but quickly agreed we were in no mood to be around other people. Right across the street was the Hardman House Hotel which had very reasonably priced rooms, so we didn&rsquo;t think twice and booked one. We were extremely relieved to be able to relax, and I sent a long apologetic text to our host to explain. After we loaded our stuff into the room I walked back to get my bike. Adam said I would probably need a hub overhaul but he rigged it so it would certainly last the next week. He didn&rsquo;t charge me anything either!<\/p><p>Glorious shower, glorious nap. We had a fabulous Thai dinner at The Basil Restaurant, followed by a little nightcap at Great Basin Brewery. Before we returned to our hotel, we headed to the convenience store for something sweet. Tess had some difficulty choosing. After a frustrating day, we had a rather nice evening.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/664781F8-7E20-40AD-A1C5-49A057506155-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/77DAC3DA-17A6-4710-8979-E5FA4B18DE8B-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9790E126-C99C-42FA-B7B8-1ED02317FF81-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E1F2FEE9-6FF2-4BD8-BE16-18FA150609FD-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"October 18, 2022","fields":{"date":"10\/15\/2022","day_number":"99","multiple_days":false,"weather":"Scorchy","locations":{"single":false,"start":"Fallon, NV","end":"Carson City, NV"},"miles_and_elevation":{"rest_day":false,"miles":"68","elevation_gain":"1818","elevation_loss":"1115","flats":""}}}