{
    "ID": 300,
    "title": "Day 10 &#8211;  Millersburg, OH to Mount Vernon, OH",
    "content": "<blockquote><p>Adventure is adversity fondly recalled.</p><cite>As quoted by Myron Skott</cite></blockquote><p>We awoke in an island of dry in an ocean of wet. What seemed like a clever idea - leaving our soaked clothes draped off our bikes under a tree to dry - turned out to be ill-fated. Our bikes had toppled over in the storm, clothes were strewn across the ground, and worst of all my bike shoes were wet and covered in mud. It took us twice as long to pack up our wet gear, and though I tried to soak up the water in my shoes the best I could, there was a definite squish as we pedaled away from the campsite.</p><p>In an alternate timeline, we were pushing our bikes through the front door of the Comfort Inn, dry as a bone. It turns out we would meet some people later that day who chose that very timeline. We agreed that in the future, if we knew a storm would be raging through the night, we&rsquo;d choose the hotel option.</p><p>Our first stop was a few miles back down the Hill of Doom - Jitters Coffee House. We stayed at this coffee stop longer than usual, relishing the cool dryness. One man came over to inquire about our trip, and upon hearing our destination said &rdquo;that tickles me right to death&ldquo;. Which tickled us right to death.</p><p>The next person we talked to at Jitters was Tom, who was riding the length of Ohio in the same direction with his wife Deb. They were very friendly and easy to talk with, and we parted ways with the prediction we would meet again on the trail, which we did.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/9809088E-FE31-4860-99F3-677F786333C3-1024x768.jpeg\" alt=\"\"></figure></figure><p>Despite our general sogginess and the day&rsquo;s general mugginess, we left Millersburg in good spirits. More of the same pretty rails-to-trails led us to a nice winding road through farmlands nearing the town of Glenmont. At one point Google Maps pointed us up a very steep hill that deviated from the main bike route, which we started up and then turned back, laughing at Google&rsquo;s mistake. A few miles later, a construction crew was blocking the road. As we approached, none of the dozen or so construction workers looked up from the meter-wide trench they were digging across the road. Eventually they could ignore us no longer and proclaimed that we could not cross. At this point Deb and Tom pulled up behind us also wanting to cross. Despite our inquiries and Tess&rsquo; cute young woman charm, they didn&rsquo;t budge, instead pointing us back down the road to a possible detour. </p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/25885536-E7E3-4661-8E77-122E8AF834D9-768x1024.jpeg\" alt=\"\"></figure></figure><p>The four of us took the right-hand turn that was recommended to us, which quickly turned into an uneven dirt road that went straight up a hill for about a mile. We scrambled up the hill at a snail&rsquo;s pace, and were saved by good conversation. It was well documented (Deb took a bunch of these).</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/8EC3420F-DD01-442E-A372-E18987F64705-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/A318B73B-2C41-474B-83EC-0A806D8FE3D1.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/2709B184-ED5C-42A8-AB60-8DB05E75D962.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/29C8573C-AC77-4B83-8741-8328D5A87539-1024x685.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/4842556C-5165-406E-8478-AFA530FF2739-768x1024.jpeg\" alt=\"\"></figure></figure><p>The road we were dumped out on at the top was paved and scenic but quite hilly. We stopped at the top of a nice hill to practice our PB&amp;J making craft. We also ran into David, who had toured from the west coast and was doing the detour in the opposite direction.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/C5B28138-D85B-4DDB-8881-87E84440B410-1024x768.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/37A76380-1873-4D88-9810-405EB4B9E10F-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/31C02289-9E07-4103-9C93-3C5F6594F851-1024x685.jpeg\" alt=\"\"></figure></figure><p>After a long downhill gravel road, we finally rejoined the trail. We&rsquo;d spent a good deal of time and knocked off very few miles on the detour. Thankfully the rest of the trail was flat and easy.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/5A6B68FF-177C-40D8-A2D3-0E7BC80B7473-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/E818D91C-3EB7-47EA-B5E0-1D67BC5AB40A-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/1B51DF76-E9FC-4CF2-AD48-373881E27822-1024x768.jpeg\" alt=\"\"></figure></figure><p>Chip, our Warmshowers host met us on a recumbent bike on the trail a few miles from her home, and she rode back with us. Her warmth and good humor was immediately apparent as we chatted the rest of the way. She taught us a bike trail game to play with a partner, wherein points are earned by animals darting off the path on your side. Points breakdown are as follows:</p><ul><li>Chipmunk - 1 point</li><li>Bunny - 2 points</li><li>Squirrel - 3 points</li><li>Deer - 5 points</li><li>Groundhog - minus 5 points</li><li>Bird (walking off, not flying) - Wild Card [choose 5 points OR double the next animal]</li></ul><p>A Volkswagon Beetle with flower decals. Handfuls of kittens running around and on every surface. An outdoor fridge filled with cold drinks. A hot tub perched atop a rolling endless lawn. Our own bathroom and a bedroom with a queen bed. This is Chip and Paul&rsquo;s home, and a bike tourist&rsquo;s paradise after a long day of riding. We were delighted by how quickly we were made to feel at home.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/B507F80E-071D-498A-82E3-853CF1C1D65D-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/BA5BAF-4B2F-4301-AB2E-2F0F4C16A5D1-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/307905BD-ABF3-4B95-BA9B-261EB69C5E6F-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/368439B3-5554-449B-AD24-1D8B20BA6141-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/800E16CF-6734-4A54-A251-F29F93262772-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/343476A2-C96C-4F93-A9BB-6B4655DB9220-768x1024.jpeg\" alt=\"\"></figure></figure><p>Chip told us that Paul had just broken a couple ribs, so I figured we wouldn&rsquo;t be seeing too much of him. Boy, was I wrong. Paul had the energy of someone younger than us, and a razor-sharp wit to boot. He was full of stories, jokes and pearls of wisdom. He also taught us a game - &rdquo;How Much Would It Take&rdquo;. Someone picks an unpleasant scenario, and you have to come up with a round dollar value of how much you&rsquo;d have to receive to be able to have that scenario take effect. The others try to guess your value, and the closest wins.</p><p>As if we weren&rsquo;t already in great company, Myron and Cathy Skott rolled in on recumbents soon after. From the Atlanta area, they had driven to Cincinnati to bike to Cleveland and back, and were now coming back. They&rsquo;d stayed with Chip and Paul before, so were greeted like old friends. Myron and Cathy are kind, fun-loving people with bushels of interesting stories from past bike tours. Myron&rsquo;s touring days all started with the &rdquo;Mother Trip&rdquo; where he and his friend Basil rode down the length of the Mississippi. When he and Cathy did the Mississippi years later, Cathy insisted they ride on the other side of the river to avoid hearing &ldquo;Oh, this is where Basil and I&hellip;&rdquo; the entire time. </p><blockquote><p>Hunger is the best spice.</p><cite>As quoted by Paul Pozderac</cite></blockquote><p>Chip (with Cathy&rsquo;s help) made up a delicious dinner of pasta and salad which we all shared at the kitchen table. Afterwards, Chip and Paul pulled the van around and took us to get frozen custard at Whit&rsquo;s (Myron and Cathy treated). They gave us a little tour of Mount Vernon and took us to Ariel Foundation Park, with neatly manicured terraces, old brick buildings, and at the middle, an old tower with stairs built around the outside leading to an observation point. We walked up with Paul and Myron, and had a great view of the surrounding area at the top. When we lingered a bit too long, Chip called up from the van below. Myron grabbed the bars and yelled back, &rdquo;We&rsquo;re on strike! We&rsquo;re not comin&rsquo; down till you satisfy our demands!&rdquo;</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/2C3099DF-AE1D-4856-911E-69CA4D4C0023-1024x768.jpeg\" alt=\"\"></figure></figure><p>After our fun-filled (and custard-filled) evening, Tess and I were pretty wiped out so we said our good-nights and fell asleep in a very comfortable bed to Kitchen Nightmares. We were completely blown away by the generosity of Chip and Paul, of which there was more to come.</p>",
    "date": "July 20, 2022",
    "fields": {
        "date": "07/18/2022",
        "day_number": "10",
        "weather": "Overcast",
        "locations": {
            "single": false,
            "start": "Millersburg, OH",
            "end": "Mount Vernon, OH"
        },
        "miles_and_elevation": {
            "rest_day": false,
            "miles": "48",
            "elevation_gain": "1322",
            "elevation_loss": "1106",
            "flats": ""
        }
    }
}
