{"ID":325,"title":"Day 11 &#8211; Mount Vernon, OH to Columbus, OH","content":"<blockquote><p>There&rsquo;s nothing you can&rsquo;t accomplish with enough confidence and ignorance.<\/p><cite>As quoted by Paul Pozderac<\/cite><p>We woke up naturally at Chip and Paul&rsquo;s and slowly undid the mild nesting we had done in their guest room. When I walked into the kitchen full of people with all my bags, they joked &rdquo;He can&rsquo;t wait to get out of here!&rdquo;<\/p><p>The table was already set for us and laden with toast, salted pecans, dates, coffee and OJ. Paul was perched at the stove, and said &rdquo;I hope omelettes are OK. Do you like mushrooms, onions and cheese?&rdquo; I assured him that the menu and the suggested toppings were more than adequate. Chip and Paul had been very attentive to our vegetarianism throughout our stay.<\/p><p>After a nice breakfast with good conversation, and after turning down Paul&rsquo;s inquiry about another omelette, we all got to packing up. Chip and Paul were going to ride with us as far as Centerburg, the highest point of the Ohio bike trail and apparently the only place in the world with its name.<\/p><p>As we were finishing packing, Chip gave us even more (if possible) - little packets of laundry detergent, energy gels, bags of salted pecans and dates (together, these two taste like mini pecan pies), and pepper spray for Tess. We were very grateful. We all got together for a pro-level selfie taken by Paul.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9C418873-BD60-410A-B1C9-43507C8CEBEF-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><p>I took a little test ride on Paul&rsquo;s recumbent trike with motor assist, which was pretty cool. Might be something I pick up later in life. We all rode out together, Tess and I towering over the others on our regular bikes amongst recumbents. The miles to Centerburg passed without me realizing it, as we were busy chatting away. Our stop in Centerburg was Kolacheez Coffee Bar, famous for their kolaches - pastries filled with sweet or savory delights. We tried valiantly to treat the others, but were refused by Chip, who insisted that she pay because we were young and on a long trip. We got blackberry and cream cheese kolaches which were out of this world.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/00E28E1E-DADE-4107-9DC5-AEB8C05DEFAC-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>As we sat in the dining area upstairs talking, who would walk upstairs but Deb and Tom. We exchanged information, shared pictures, and hugged them goodbye.<\/p><p>Downstairs, more hugs goodbye and thank-yous as we parted ways with Chip,  Paul,  Cathy, and Myron. We will never forget Chip and Paul&rsquo;s warmth and generosity.<\/p><p>Our spirits couldn&rsquo;t have been higher as we started back on the trail, sun shining, music blasting. With few exceptions, we had easy and scenic riding all the way to our next stop, REI in Columbus.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FEA1B56D-0FDA-4DD8-B87E-34FF05DB2CF5-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DE537565-740B-4F05-9A1A-5146120D2921-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.8B6B1613-C588-4635-8F6A-6C7529A0834D.mov\"><\/video><\/figure><p>We had a growing list of gear that we wanted to pick up that we decided we&rsquo;d get at REI on our way to Gavin and Lindsay&rsquo;s:<\/p><ul><li>All-around pants (Eric)<\/li><li>UV sleeves (Eric)<\/li><li>Tent stakes<\/li><li>Rain shoe covers<\/li><li>Longer shorts (Tess)<\/li><\/ul><p>When we arrived we ate what we&rsquo;d been thinking about all afternoon - the cookies we&rsquo;d saved from Kolacheez. They were right up there with Levain cookies from NYC - high praise.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0012AB03-467D-456E-80D9-9A3464D6F3B4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3268EDDB-9F9D-4AA0-B3F7-B2CD85B6F4E2-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>As usual, we spent more time and money at REI than we planned. We took turns shopping as the other watched the bikes. Outside, I got a lot of inquiries about our trip from like-minded REI shoppers. By the time we were finished and loaded up, it was later than expected and it had gotten really hot. Tess requested a sit-down and cold drink nearby.<\/p><p>At this point Lindsay offered to come pick us up at the mall, which was 10 miles from our destination. Tess, who was feeling a bit faint from the heat, and was unsure about riding through city streets during rush hour, thought we should accept the offer. I realized this was counter to my yet unspoken &rdquo;purist&rdquo; vision of the bike trip, where all miles should be ridden and no shortcuts should be taken. This turned out to be a revealing and somewhat tense conversation that could very well have some bearing on how the rest of the trip unfolds. We ultimately erred on the side of safety and said yes to Lindsay, which I had trouble with but accepted. As we were loading up Tess&rsquo; bike, I realized we could both have our way and decided to ride the last 10 miles solo. The heat and fatigue were undoubtedly factors in how long it took to find this solution.<\/p><p>The first 7 miles of my solo trip was gorgeous, weaving back and forth over Alum Creek. The last three were on East 5th Ave, a busy four-lane road with no shoulder. I was glad Tess had avoided this last stretch.<\/p><p>At long last I arrived at Gavin and Lindsay&rsquo;s beautiful brick home where a welcoming party awaited. It had been since Neill and Alex&rsquo;s wedding party last July that we&rsquo;d seen those two, and we spent the next hour or so on their back patio catching up, including in-person congratulations on their engagement! <\/p><p>After showers they took us to dinner at Brassica&rsquo;s, a delicious Mediterranean restaurant with a Chipotle model of building your own masterpiece. I walked there in my newly-received replacement flip-flops which brought me great joy.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8EABE373-D9C0-46EC-9E58-BAF7DAFCE063-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We spent most of our dinner workshopping a joke Paul told us where someone walks into [any place of business, doctor&rsquo;s office, hair salon, etc] and asks:<\/p><blockquote><p>&ldquo;What&rsquo;s the difference between a [place of business] and a butcher shop?&rdquo;<\/p><p>Employee: &rdquo;I don&rsquo;t know.&rdquo;<\/p><p>&rdquo;I&rsquo;m outta here!!&rdquo;<\/p><cite>-P.P.<\/cite><\/blockquote><p>Afterwards we walked to S&rsquo;wich Social, an ice cream sandwich joint where I tried out the joke with the employee to mediocre effect. We had a nice walk back in the balmy late evening.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5F3B0588-A1A4-4E27-9301-8006174DF712-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After a hot tub session and a round of &rdquo;How Much Would It Take&rdquo;, we got ready for bed and zonked.<\/p><\/blockquote>","date":"July 20, 2022","fields":{"date":"07\/19\/2022","day_number":"11","weather":"Beautiful, Quite Toasty","locations":{"single":false,"start":"Mount Vernon, OH","end":"Columbus, OH"},"miles_and_elevation":{"rest_day":false,"miles":"46","elevation_gain":"423","elevation_loss":"961","flats":""}}}