{"ID":483,"title":"Day 17 &#8211; Columbus, OH (Rest Day)","content":"<p>We had driven back to Columbus with Gavin and Lindsay Sunday night, weary from a weekend of dancing and staying up late. Lindsay was the MVP of the drive back, with 4+ hours logged. <p>Monday was the last day of our mini vacation within a vacation, and was built in as a recovery and supplies day. We got up pretty late, catching up on the hours we&rsquo;d missed staying up until 4am the night before. The morning started with some coffee on their back patio, something I could get used to. Another thing I could get used to is breakfast at Fox In The Snow. This time we split a bunch of pastries - a chocolate croissant morning bun, blueberry galette, cinnamon bun, and strawberry diamond. Cutting them into thirds was tricky. Eating them was not.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4004BD3C-D2E7-40FB-B15B-4463A6D67AAC.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/86C0B7DA-72C1-4AB2-8F28-8792D0BB950F.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9A600C63-A779-4FB9-9893-769E7CF80851.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BE82130B-DA83-49AA-9FD1-8BFD4BF20B88.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D68BA737-2B5A-4A0D-9E21-604775A8E86D.jpeg\" alt=\"\"><\/figure><\/figure><p>On our way to pick up Tess&rsquo; bike we stopped into a thrift store where Tess got a couple pairs of light off-the-bike shorts. At the bike shop I had to stop myself from getting a top tube bag - bike gear is an addiction.<\/p><p>We met Lindsay&rsquo;s lovely mom Cathy back at the house, who was there to reunite Bert with Lindsay. He fell asleep on her immediately.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/290D772E-5FE9-49EB-B8C0-8699E3D33BFD.jpeg\" alt=\"\"><\/figure><\/figure><p>Instead of our original plan to go see a movie, I napped while the ladies dyed their hair. When I got up, the man of the house had returned from a tough day at work and a commute where he&rsquo;d almost gotten run over. Fortunately he was able to unwind with a cribbage defeat by yours truly.<\/p><p>During a jaunt to Weinland Park, Tess and Lindsay walked Bert while Gavin and I undertook the important business of tossing a frisbee. When our work was done we retired to the house for Indian food and homemade peach cobbler. After packing up most of our gear for the next day, we went through hundreds of photos and videos from our college days. Major differences noted were that Gavin and I have quite a bit more facial hair now, and we party a lot less.<\/p><p>The next day would be a flat but long 67-mile day, which didn&rsquo;t stop us from staying up until midnight. No regrets, as Gavin and Lindsay are the last good buds we&rsquo;ll be certain to see for the next couple weeks. We hope they consider our application to be live-in friends after our trip is over.<\/p><\/p>","date":"July 27, 2022","fields":{"date":"07\/25\/2022","day_number":"17","weather":"Hot, Then Nice","locations":{"single":true,"start":"Columbus, OH","end":""},"miles_and_elevation":{"rest_day":true,"miles":"","elevation_gain":"","elevation_loss":"","flats":""}}}