{"ID":700,"title":"Day 26 &#8211; Brandenburg, KY to Cloverport, KY","content":"<p>We hit snooze more times than was necessary, but eventually roused ourselves and were treated by Donna to french toast, eggs, and fresh fruit. We ate with the family sans Troy, who had to head to work (we thanked him profusely for his hospitality). She packed us away a few more french toasts and a little jar of syrup for the road.<p>We said our goodbyes on the front porch and had to regretfully say no to Rowan who was begging to race us one more time. We set out around 8, and it was already starting to get hot.<\/p><p>We followed some busy roads past Brandenburg proper, but eventually ended up on quieter country roads. The repeated smaller hills of southern Indiana have been replaced by repeated long hills in Kentucky. We were pretty much always on a long down or a long up, which made for some nice views but tired us out quicker than usual.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.3BF03377-723D-4793-84D8-00F23E6CABC5.mov\"><\/video><\/figure><p>The heat slowly cranked up as the day went on. When we crossed from Meade County into Breckinridge County we entered the Central time zone and gained an hour.  Unfortunately, that didn&rsquo;t change the angle of the sun.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B470E6CA-7F19-41E0-9E3D-643B38E69E54-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Around 10am Central we had to take a break from the sun, and took refuge at Kountry Korner market. When we walked in we were soothed by the sound of choral music and the smell of spices. We were greeted by Esther and David Beechie, owners of the store. I believe they may have been a Mennonite family but can&rsquo;t be certain, as I didn&rsquo;t ask. We got Gatorades, a gallon of water and tortilla chips. Esther took our address down so she could send us a letter later on. Outside, David helped us move the bench to the shade where we ate the remaining french toast. We talked for a bit, and when we got on the topic of our surnames he said was amazed at how many &ldquo;Z&rdquo; names there were in the Iowa City phonebook. We probably went in and out a dozen more times to get more Gatorade, go to the bathroom and throw out our trash. We left hydrated, but now it was like being in a furnace. We knew we were in the danger zone and needed to take it easy for the last 17 miles.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E51E6AE1-D019-4525-83D6-2B4BC45CA093-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>At one water break spot, a big group of cows came out to meet us, all looking fierce and standing in a line looking at us. As we rode away, they all started running at full speed alongside us until they reached the limit of the property.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.54922923-3110-4AF1-B8B4-A1C6D5E04C3A.mov\"><\/video><\/figure><p>Towards the end of the ride we finally hit a downhill that brought us to the level of the Ohio River and it was flat for a while (but there was no shade). We passed the Holt House, home of Joseph Holt, a member of Buchanan and Lincoln&rsquo;s administration that helped steer Kentucky toward pro-Union and pro-abolition sentiment leading up to the Civil War.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E5418105-388C-4130-93C1-1652EDD47FEE-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6C445409-E9AA-4AF6-93DA-DFF4768DB41E-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Our original destination for the day was Hawesville, but with the heat and the change of start location by staying at Troy and Donna&rsquo;s, we tried to see if there was a place to stop in Cloverport, 12 or so miles before. They had given us a tip to stop in Candy&rsquo;s Mile Marker 711 in town, owned and run by the mayor (whose name was Candy), and see if there was a place along the water we could pitch our tent. We had to battle one more long hill before we got into Cloverport and escaped the blazing heat into Candy&rsquo;s air-conditioned haven.<\/p><p>Candy was sitting at a table by the one customer that happened to be there. The business is a bar, liquor and beer store, and general hangout spot. We ordered an ice-cold Coke and water, and waited as our body temperature slowly went down. After talking for a while we inquired about a place to pitch a tent, and she said we could use the gazebo down by the water. We immediately relaxed knowing we&rsquo;d have to go no further. We started charging our electronics and settled in. At this point it was only 1pm, so we had a bunch of time to kill in Cloverport.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FE4AE8AD-9E5F-461C-AB29-B4BED5064C27-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>As we sat there, people came and went. The people that stayed for a drink would walk behind the bar and help themselves to a cold one from the fridge, and come sit down and start chatting. Everyone knew everyone else. We met Billy, Candy&rsquo;s husband, who had a kind demeanor and a good sense of humor. People were pretty amazed by and curious about our adventure. At one point, Candy took a break from bartending and conducted a meeting as mayor with a couple from town.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AD4B66C5-3E23-4993-B719-FA897150A856-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After spending about three hours there, and after the heat of the day we were starting to get very tired. We figured we&rsquo;d head to Bert&rsquo;s  - the only restaurant in town - for an early dinner. Opening the door of Candy&rsquo;s was like opening an oven door, and we stumbled our way across town to the refuge of another climate controlled environment. We had a veggie pizza and a fish wrap which were pretty darn good.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AAF9E7AC-EB65-4609-B45B-72C20D4C8CD7-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Back to Candy&rsquo;s to wait until it was cool enough to set up our tent. We figured we&rsquo;d wait it out until they closed at 8pm. In the meantime we met Kelly (co-owner of Candy&rsquo;s) and Mitch, both friendly guys that we passed the time talking with. Mitch&rsquo;s wife Edie came in not long after for a beer and joined the conversation. When we got up to start setting our tent up, Mitch came over and asked if we&rsquo;d rather load up our bikes in his truck and sleep in their guest bedroom for the night. We eagerly accepted!<\/p><p>Mitch took us to Dollar General to get us some Gatorades and snacks, then drove us back to their lovely house outside of Cloverport, where Edie&rsquo;s mom and two English bulldogs Oreo and Hank were waiting (Hank is mostly blind and licks everything). They cooked up a bunch of veggies from their farm, so we had a second dinner. They threw our clothes in the laundry to boot! Mitch&rsquo;s younger cousin had come down from Louisville as well to talk bourbons with Mitch, who has an extensive bourbon collection. We stayed up talking to Edie, who has an impressive golf career under her belt and teaches golf lessons.<\/p><p>When our fatigue finally overwhelmed us, we thanked Cloverport angels Edie and Mitch and headed to bed. We couldn&rsquo;t believe we were sleeping in a cool room with a bed tonight, and fell asleep immediately.<\/p><\/p>","date":"August 5, 2022","fields":{"date":"08\/03\/2022","day_number":"26","weather":"Inferno","locations":{"single":false,"start":"Brandenburg, KY","end":"Cloverport, KY"},"miles_and_elevation":{"rest_day":false,"miles":"43","elevation_gain":"1529","elevation_loss":"1686","flats":""}}}