{"ID":129,"title":"Day 3 &#8211; Erie, PA to Ashtabula, OH","content":"<blockquote><p>I'll look for you in old Honolulu, San Francisco or Ashtabula<\/p><cite>Bob Dylan, &rdquo;You&rsquo;re Gonna Make Me Lonesome When You Go&rdquo;<\/cite><p>Today we took advantage of the &rdquo;pit stop&rdquo; to beat the heat and the exhaustion it brings. It took longer, but we didn&rsquo;t pass out!<\/p><p>We left Stephanie&rsquo;s before 8am to avoid the reporters who were coming to cover her urban farm. On State Street in downtown Erie we found Ember + Forge, a cafe whose hipster name was a clue to its coffee quality. We met and chatted with Steve Maynard, a nice guy and bike\/skateboard enthusiast. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/163A2218-0050-4A29-98DB-AB77AF8E5C05.jpeg\" alt=\"\"><\/figure><\/figure><p>We started off on a nice separated bike path along the water, which soon brought us back to trusty Route 5. It was our first day using our new padded bike underwear under regular shorts, which we started to realize didn&rsquo;t compare favorably to our lycra bike shorts. Good to know - might need to pick up another pair of shorts on our first rest day in Medina.<\/p><p>We passed some top-notch farmland in the morning. A large painted sign of a paw print (&ldquo;Love Ya Lions&rdquo;) started an interesting debate about whether lions actually have five toes. They do.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DC05AF75-1076-41BF-9DC2-8016EBDA0F1F-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/94829E3C-939B-4F9D-AA3C-A4898DE1DD90.jpeg\" alt=\"\"><\/figure><\/figure><p>Our tent and sleeping gear had gotten super dewy and wet overnight in the garden so we made a pit stop at a farm stand to take it out and dry it in the sun. After a couple of not-quite ripe nectarines we got to work. In the process, we discovered I had missed a spot when applying sunscreen on my lower back.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C30C670F-40A8-4C0C-8379-F8894C0EA3F4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F9B0BB20-41EF-4EA9-907A-6230117C1A72-1024x551.jpeg\" alt=\"\"><\/figure><\/figure><p>After we hit the road the sun was starting to get quite hot. We were working through our water at a good click with most of the day still ahead of us. We hit some pretty good hills too. Tess has had issues switching gears which added another layer of difficulty.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D3082AD3-E3D4-4E43-80DD-863E7CF9988F-1024x766.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BC1EE10A-E547-4F60-9AA6-104EE5A79F07.jpeg\" alt=\"\"><\/figure><\/figure><p>Around this point I heard a scream from behind me and my heart stopped. I skidded to a halt and Tess slowly pedaled up to me looking hysterical. She had been looking at roadkill and ran over something which popped and squirted reddish juice all over her leg. Had she run over a dead thing?! Upon closer inspection there were bits of onion and pepper in the juice, so we determined it was a sauce packet of some kind. We cleaned up and pushed on.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0172AF62-07CD-47CA-930F-847305258AFA.jpeg\" alt=\"\"><figcaption>Cleanup<\/figcaption><\/figure><\/figure><p>We hit the Ohio state line. Two new states in two days - at this rate we should be in California next week.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E7508274-745F-4840-A0F1-27E31F2E30C8.jpeg\" alt=\"\"><\/figure><\/figure><p>A while later we were down to our last bottle of water and decided we needed another pit stop. Mercifully we came upon the White Turkey Drive-In soon after in the town of Conneaut (pronounced &rdquo;Kahn-ee-awt&rdquo;). Our server Chloe was super friendly and very generous with water in frosted mugs. Root beer, iced tea, crinkle fries and cole slaw ensued.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8E692836-432F-419E-B89E-814D9B09FBB1.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/16F2C027-894B-437C-8B5B-1F1493BBF5F9.jpeg\" alt=\"\"><\/figure><\/figure><p>After Conneaut we were on a scenic road along the lake that unfortunately had very little shoulder so we had to concentrate with cars whizzing by. During a break in traffic I was able to snap an action shot.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D080FF76-B362-47B5-A8E1-591AD5634678-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Eventually we entered the cute harbor of Ashtabula. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/03CEFA06-4446-448D-A9B2-974B3E97A737.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BFE452BF-47E9-4AA4-9724-228F61DDF446-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AE6D32AC-52A6-434B-BE13-C1AA0DAC092F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>By this point we had discussed the state of our sleeping bag smell, which after only a couple days started to smell faintly like a mouse had crawled in it and died (Tess was convinced). Was it bad enough to stay in a hotel in Ashtabula tonight (it was supposed to thunderstorm)? We decided it wasn&rsquo;t bad enough to warrant a hotel splurge yet and we could try washing it in Medina. Campground it was.<\/p><p>After much deliberation we decided to eat in town - 5 miles from our destination - at a Neapolitan pizza place called Nights and Weekends. This was a good choice. Everything we ate there was fresh and delicious and the wait staff was great. Cole, the owner, told us about his cross country bike tour years earlier. I even had a special N\/A drink - Topo Chico with bitters!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BD787A97-D30E-45A0-8F5B-962445C0174E-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5EA3DF0F-1A8B-46EA-9E8B-3F5D87286958.jpeg\" alt=\"\"><\/figure><\/figure><p>We paid for our scrumptious meal with the post-dinner, exhausting ride to our campsite through busy streets in Ashtabula&rsquo;s yet unseen more impoverished Rust Belt neighborhood.<\/p><p>The campground was mostly seasonal RV campers, so we had the whole beautifully-manicured primitive camping area to ourselves. We carefully packed everything away to prepare for the night&rsquo;s thunderstorms. After showers we shared a decadent frosting-filled cake piece and quickly fell asleep. The sleeping bag smelled OK.<\/p><p>When nature called later that night and I left the tent, the moon was bright and nearly full and the fireflies were out. We&rsquo;d survived the first mildly challenging day.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E1045DEC-0460-4DE0-8645-489AF9EB0FED-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/blockquote>","date":"July 12, 2022","fields":{"date":"07\/11\/2022","miles_and_elevation":{"rest_day":false,"miles":"50","elevation_gain":"587","elevation_loss":"466","flats":""},"day_number":"3","weather":"Sunny, A Tad Hot","locations":{"single":false,"start":"Erie, PA","end":"Ashtabula, OH"}}}