{"ID":932,"title":"Day 36 &#8211; Farmington, MO to Johnson’s Shut-Ins State Park, MO","content":"<p>Johnson&rsquo;s Shut-Ins is a state park with a big swimming hole, so we were excited for the day&rsquo;s destination with a great weather forecast and a campsite booked. But first we were excited for our big cold brews and muffins waiting in the hostel kitchen. One of the many little pleasures of the tour. <p>We hit the road a little before 7am - we&rsquo;re getting good at the early start. As we biked down the hill out of town, I actually contemplated putting a sweater on it was so chilly. I could see my breath! That&rsquo;s life in the hills for you.<\/p><p>The route took us through pretty back roads to the town of Bismarck, avoiding the busy but more direct route 221. I think this is a fairly new change, because the official Route 76 road signs did not indicate this routing. We were happy to avoid traffic.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F217D00C-57A3-4B3D-8BC9-14FC97CA2445.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/ADFE8B7D-71C1-4D43-B034-4CEB544614C8-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FBDEAF7D-89A0-4BBA-8D3B-303671998E4D-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We stopped in the small town of Bismarck for a bathroom break and so Tess could dilute the mostly half-and-half mixture in her mug with some more coffee. They were having a town-wide yard sale and the place was abuzz. We stopped on a cute road by the train station. At the diner where Tess filled her coffee, a table of nice older folks asked Tess if we wanted to sit down with them for breakfast. We were very tempted, but had already eaten and wanted to take advantage of the light Saturday morning traffic. In hindsight we probably made the right choice, but we missed out on a little tour magic.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0D714386-C791-4501-A667-90F7BD072605-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D34A2637-489B-4D58-813B-CCCF8D6745F4-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>More back roads south of Bismarck until we hit Highway N, which would lead us to Johnson&rsquo;s Shut-Ins. Now we started to see what various sources had warned us about Missouri roads&hellip;lots of turns and hills with no shoulders and consistent traffic. Not as bad as the Dixie Highway outside of Louisville, but not nice per se. <\/p><p>We were glad to see the signs for the Shut-Ins, and pulled down to the trailhead store to see what food they had. There weren&rsquo;t any towns since Bismarck to get food for dinner so we were hoping we could cobble some things together. Not a whole lot there, turns out. We got some Gatorade and dill chips to wind down from our ride. The decision was to bike to the campground (a few miles away) to set up and unload our stuff, and then pack up a day bag for the swimming hole.<\/p><p>I didn&rsquo;t know this at the time I booked it, but our campsite was on a trail off of the very farthest paved loop. Annoying to get to, but it turned out to be really cool. We set up our tent, packed up our stuff and headed back down. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/872637CB-8DB9-4DFF-9AD9-C99E2F49A2A3-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After the fifteen-minute ride down on a nice sidewalk and with the sun getting hotter, we were pretty ready to get to the swimming hole and finally relax. The only food we could get at the lone food truck was tortilla chips with canned cheese. We were hungry enough, so we waited&hellip;about twenty minutes after we placed our order. Frustration building. Tess asked for a plain hamburger bun so she could add her package of tuna, which she put relish on. I supplemented the nachos (sauce wasn&rsquo;t warmed) with a can of Frito-brand refried beans. It was all pretty disgusting. <\/p><p>We locked our bikes and headed down to the Shut-Ins, hoping they would make it all worth it. They did! I grew up going to Stony Brook State Park south of Rochester, which had some natural rock slides and pools - the Shut-Ins are Stony Brook on steroids. The whole time I couldn&rsquo;t stop thinking about how much fun we would have had here as kids. We found a nice deep pool and plunged into it. Pure heaven.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0D66880C-8A5F-4351-8079-49B5954122F9-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1129DD09-061E-40C1-B0B2-D5A1D2CF54C6-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3F72AF4E-FB58-4DF5-B1C3-5B1B35ADA8E3-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>While Tess read in the shade, I walked down the Black River to the other swimming holes, all packed with families and kids jumping off of rocks into the deep water. I sat for a while enjoying some solid people-watching.<\/p><p>Eventually I headed back up to Tess, who was curled up asleep on an uncomfortable-looking rock. I roused her and we decided to head back to camp to shower and make sandwiches. We had a gummy, played some cards and quite enjoyed ourselves. In the tent with the rain fly off, we listened to the sounds of the forest as our stomachs churned from all the junk food we&rsquo;d consumed that day.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F06452C8-B658-4B23-B107-829495A7B5B8-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EFC2DF05-596C-4B0B-994B-8F2E232BEEAB-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3A0AC6F8-5FF5-4EDC-8F02-E5F4A24A201B-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"August 14, 2022","fields":{"date":"08\/13\/2022","day_number":"36","multiple_days":false,"weather":"Very Good","locations":{"single":false,"start":"Farmington, MO","end":"Johnson’s Shut-Ins State Park, MO"},"miles_and_elevation":{"rest_day":false,"miles":"41","elevation_gain":"1394","elevation_loss":"1368","flats":""}}}