{"ID":972,"title":"Day 38 &#8211; Ellington, MO to Eminence, MO","content":"<p>Boy, were we glad we split up the ride with our stay in Ellington as these 27 miles were like a roller coaster. <p>We had some yogurt and fruit at the hostel, stopped at the Ozark Hills gas station for coffee, and hit the road a little after 7am. I took some pictures of the hills we encountered along the way, though it&rsquo;s hard to tell the scale from these photos.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/81849528-C3F4-4829-97FF-C479FDC37022-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6903FEDD-83CB-4D04-AA96-EC369B408FC8-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3536A0C1-B582-4AEC-BD4F-AF8B5CEF30AB-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9FF331FC-0D65-44EB-9C39-EC542D7F52C7-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The good: the roads were similar to the day before but there was very little traffic on a Monday morning. The scenery was also nice although we mostly had trees on either side blocking our view of surrounding hills.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/84AA468B-94CB-48F4-BAFE-9F04BE3EA47F-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>The bad: while going up a steep incline, a weird gear shifting combo got my chain wedged between the largest chain ring and the front derailleur. This ended up bending my derailleur so now whenever I shift gears in the front my chain comes off. Might try to realign it myself on our rest day. I&rsquo;d also banged my knee on the hostel door the day before which was adding pain to the experience. Also, I got a widdle boo-boo!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A6BEC2F0-C0AF-466F-B760-C1C13CDDE781-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>There was one never-ending hill we fondly named Big Bertha. She just wouldn&rsquo;t quit! Tess picked up on a new clipless pedaling trick she hadn&rsquo;t been using on inclines, which really helped conserve her energy. At long last, we were rolling into Eminence to Hawkins House, our B&amp;B for the next two nights.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6957FE3E-0F61-4573-BAB3-7DAC040F73E5-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We were welcomed by the owner Logan who was super nice and got us checked in early. Apparently Hawkins House used to be the only structure in town, and was built by a rich landowner who had water piped in from a spring two miles away. Every so often people working for the town will tell Logan &rdquo;we hit one of your pipes again&rdquo;.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E7166592-EA26-4123-A045-C7A43A7D052B-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We had planned to be picked up at noon by Harvey&rsquo;s Canoe Rentals and go tubing down the Jack&rsquo;s Fork River, so we ventured out to get supplies - cold drinks, snacks and deli sandwiches. We were driven to the put-in point by Hollywood, a local guy originally from L.A. who told us stories of his gang days and various near-death experiences. He had Tess in tears at one point during a story about a vision he had of his dead father during a near-fatal baseball collision. On that note, we got in our tubes and set ourselves afloat!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B79C01A0-9BB1-452A-94BF-EBD4C6CE8762-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Not five minutes after setting off, we pulled over to a sand bar to eat our sandwiches. Who were we kidding? They were delicious though. I cracked by bottle of Mexican Coke and we pushed off again.<\/p><p>There was less relaxing and more maneuvering than we expected, and nothing to maneuver with. A couple initial ideas didn&rsquo;t stick - paddling with flip-flops, half-assedly shoveling with cupped hands - until we got a couple big sticks to push off of things with. This worked pretty well and got us through some quick-moving water safely. We&rsquo;d chosen tubing over kayaking or canoeing because we&rsquo;d thought it would be less work, but I think we were expending more energy this way. The upside was that it was pretty hot so we were thankful to be in the water. After about an hour, we got to a point where we were in full relaxed mode.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2DE5D8CD-1227-44DA-BFA4-4CE9D590A9DE-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/36004B6B-99D2-4A37-AB2B-F6F2662BDBCE-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CBE71E56-DABE-47C4-9FFA-C5EB8453276C-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F1418947-92FB-415C-8C63-86FFCFBCCE95-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>There were a lot of other people on the water in various watercraft - rafts, kayaks, canoes - and in various states of rowdiness and inebriation. Each sand bar had a little group making hot dogs on a fire, or drinking and listening to music, or jumping off of little cliffs into the water. There was one group of four on a raft we kept passing that was getting sloppier and sloppier as the day went on&hellip;wouldn&rsquo;t be surprised if they&rsquo;re still out there.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.343E67AF-C733-4F33-9B3D-F04597EB3FF3.mov\"><\/video><\/figure><p>The last hour the river came to a standstill and we had to paddle ourselves - it took forever. We were told the take-out point was just past the bridge, but where was the bridge?? We finally arrived and were driven back to the B&amp;B by a different man in a van filled with 4,000 flies. The driver vaguely waved his hand every so often, seemingly unaware of the swarm that was blocking out the sunlight.<\/p><p>After showers and investigating the severity of our sunburns we hit the town to explore and look for dinner. Turns out only the Mexican restaurant Dos Rios had anything meatless, so we walked across the river. It was in a row of old western-style buildings that were pretty cute. Apparently there are wild horses and elk in the area, which we saw placards for on our walk. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/776C9A73-EBE1-4F3B-B6E8-136CAE986A62-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/86E167AF-3025-4784-9105-709EBF8B54CA-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2B54A73F-03EB-4009-9053-619AF1EC52D6-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/ED557041-2DBB-427E-A9B5-982A855A62B2-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Tonight we corrected our mistake from the day before and split a chile relleno entree. We succeeded in not becoming overstuffed. Tess tried her best to finish a michelada in a mug about as tall as the length of her forearm.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1576FAC0-468E-48B6-B216-C0F2D4FADB07-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AEC2FE1C-F6CA-414B-A535-0CDDCAD8964D-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>In the fading light we walked back across the river to the B&amp;B, where we - you guessed it - fell asleep watching Glow. We slept like little baby angels.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D5678CAE-1C79-4FF5-ACF4-BEF6FC6EB48B-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"August 16, 2022","fields":{"date":"08\/15\/2022","day_number":"38","multiple_days":false,"weather":"Sunny and Hot","locations":{"single":false,"start":"Ellington, MO","end":"Eminence, MO"},"miles_and_elevation":{"rest_day":false,"miles":"27","elevation_gain":"1581","elevation_loss":"1575","flats":""}}}