{
    "ID": 146,
    "title": "Day 4 &#8211; Ashtabula, OH to Bristolville, OH",
    "content": "<blockquote><p>The trail gods giveth, and the trail gods taketh away.</p><cite>Unknown</cite></blockquote><p>When planning the route months before, I knew this day would be a treat. Forty miles of uninterrupted rails-to-trails separated bike path directly to our destination. It didn&rsquo;t disappoint.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/7A65818B-D799-415A-8770-5B118827B30A-768x1024.jpeg\" alt=\"\"></figure></figure><p>We hit snooze on our alarm six times and then hit the road. It may have rained the night before, but there was no evidence - tent and gear were bone dry. We set our sights on &ldquo;The Station Drive-Thru&rdquo; in the small town of Austinburg 5 miles down the road for a cuppa joe. </p><p>On a side note, a few days in we&rsquo;re starting to think of ways we can whittle down our gear. For instance, we&rsquo;ve really enjoyed packing up and hitting the road each morning as quickly as possible, then finding a place to get coffee rather than making coffee and oatmeal at the campsite. We&rsquo;ve also never really felt like cooking at the end of the day, and prefer to grab something before we get to camp. As long as we pass an iota of civilization each day, we should be able to keep this up and ditch all the camp cooking gear. Might put us over budget on food, but so far we&rsquo;re way under budget for lodging.</p><p>The Drive-Thru in Austinburg was a pleasant place to stop for iced coffee and a homemade english muffin. We also met Thomas, the proprietor, and Wyatt, the building designer/constructor (?) - fine gentlemen. They were trailed by a gaggle of youths as they were also leaders of a teen success camp.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/CFE09C77-96F7-49B5-816A-D49957F36ADB-1024x768.jpeg\" alt=\"\"></figure></figure><p>We tarried longer than expected since we knew we had an easy day ahead of us. Down the street we stopped at Shannon&rsquo;s Mini Mart to restock on sunscreen and chatted with owners Shawn and Tammy. A neat little town.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/E38F00C1-375E-43B5-BA14-B6EDF5EC1898.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/9091E75D-BAC2-4918-BCAE-166657F6B307.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/7246952B-6C0F-40E9-A515-64A8383F4A8C-768x1024.jpeg\" alt=\"\"><figcaption>Shawn Shannon himself</figcaption></figure></figure><p>The rest of the day was a breeze. It was great to be able to ride alongside Tess and talk. It was very reminiscent of our trip last summer on the Empire State Trail.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/1FD5CAD4-FB50-4132-AC49-8B0321F5CC1C.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/2FB024FE-F896-4DC1-8575-2806E98CDB85.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/792DC7AF-8308-4916-A8F5-4B830080729B.jpeg\" alt=\"\"><figcaption>And they&rsquo;re not afraid to say it</figcaption></figure></figure><p>A couple miles from our destination the trail was blocked off. Like good little children, we followed the detour.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/407BA64C-15C6-4445-A54B-E459F5DE366A-768x1024.jpeg\" alt=\"\"></figure></figure><p>Paradise Lakes was an expansive operation, with a big lake and a thousand amenities free for residents, most of whom were seasonal RVers. There didn&rsquo;t seem to be a single vacant spot and yet weirdly no one was around. Were they working? Napping? Occasionally, a bored-looking senior would creep by on a golf cart, situated next to a tiny dog, arm over the passenger seat, taking it all in. An American tableau.</p><p>We were shown to our campsite by a very nice young man that looked like Jude Law but had three teeth. The site was huge, very secluded and right at the lake&rsquo;s edge. We had some chips and Gatorade to replenish.</p><figure><video controls src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/trim.C3296569-FA42-4A19-BCE3-1F48AA25FE06.mov\"></video><figcaption>Sweet and Sassy</figcaption></figure><p>At this point I realized the trail gods, who had given us a beautiful day of riding, had taken one of my flip-flops, my main off-bike shoe. I considered going back to find it, but it could have been anywhere within the past 30 miles. They&rsquo;re the best flops I&rsquo;ve ever owned (and not cheap), but I took a deep breath and ordered another pair. If I ever lose the left one of my new pair, I&rsquo;ll have a replacement.</p><p>We took a swim in the pond (no one there), showered and charged up our electronics at the pavilion (deserted), and went to play free mini golf. We&rsquo;re pretty bad at it but actually really enjoyed ourselves. Almost as much as the couple who were there with their kids, drinking out of matching His and Her&rsquo;s wine thermoses, the mom sporting a &ldquo;Spoiled Wife&rdquo; t-shirt.</p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/21E12C7D-BD55-4590-A53C-55F4156D435C-768x1024.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/86A4EE73-EB53-47D6-86E8-066D283B4D4D-768x1024.jpeg\" alt=\"\"></figure></figure><p>We had to get an early start the next morning to avoid afternoon t-storms so we destroyed the rest of our trail mix and hit the hay before the sun went down. </p><figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/91CED93E-5193-4177-AB9B-55E2EA24A156-1024x768.jpeg\" alt=\"\"></figure><figure><img src=\"https://bsik-media.nyc3.digitaloceanspaces.com/wheelie-babes/61D552DD-8FA1-4170-9943-50FF2A509750-1024x768.jpeg\" alt=\"\"></figure></figure>",
    "date": "July 13, 2022",
    "fields": {
        "date": "07/12/2022",
        "miles_and_elevation": {
            "rest_day": false,
            "miles": "35",
            "elevation_gain": "804",
            "elevation_loss": "653",
            "flats": ""
        },
        "day_number": "4",
        "weather": "Damn Fine",
        "locations": {
            "single": false,
            "start": "Ashtabula, OH",
            "end": "Bristolville, OH"
        }
    }
}
