{"ID":1038,"title":"Day 41 &#8211; Houston, MO to Marshfield, MO","content":"<p>Ian had left by the time we emerged from the tent around 7:30. We had multiple stops we had to make before we left town so we packed away our things (the tent was sopping wet with dew) and departed with haste.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A8A29438-6602-4C64-B619-A08BA2EA8BA5-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>At Mean Muggin we had (free) coffee and chatted with Cindy and Gianna. As we were about to leave, her friend showed up to meet us and see us off. Kathy, originally from Long Island, was very kind and interested in our story - she even brought two energy bars for us to take with us. Before we were out the door Cindy had also given us brownies and Nutty Buddys. We were excited to go to town on these treats later, and so thankful for their generous spirits. We hugged them all goodbye and headed to the hospital to get some breakfast. Hopefully we&rsquo;ll see them again someday!<\/p><p>Apparently, people from Houston go to Texas County Memorial Hospital just for the food. We were starving by the time we&rsquo;d stowed our bikes, masked up, and entered the cafeteria. Marylyn greeted us and whisked us away down the food line, pointing out all the options. She kept encouraging us to take more, and bigger helpings. By the time we were at checkout our trays were pretty heavy, and Marylyn paid for everything. The food really hit the spot. <\/p><p>After we finished, Marylyn came over, put her hands on each of our shoulders and said a prayer for our well-being. It was quiet but I heard &rdquo;idiots in cars&rdquo; thrown in there at one point. It was really touching. She told us that many years ago one of her friends had been killed biking, something she clearly reflects on regularly. We got a picture and hugs before we left.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E5C4736C-86FE-4768-8FC7-D86BFB705769-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Our destination was Hartville, 38 miles down the trail. The spacing of lodging through this section of Missouri was a bit inconvenient - sub-40 miles or over 60. We generally prefer 40-55. The riding day was just as perfect as the day before. After 8 miles on the busier Route 17 we hit Route 38, which has been one of our favorite roads to date. Cow pasture after cow pasture with excellent views. We love the blank stare we get from cows as we pass.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0A2254CC-6AD3-4E1C-A6A4-431BF3110A2B-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/67ED40E1-777A-4FA8-B10C-70E2D9D7A869-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>One of the unfortunate ways we can tell we&rsquo;re moving across the country is the type of roadkill we regularly see. In this stretch, armadillos have overtaken opossum as the most common roadkill. Poor little guys.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0A6C6DFF-1B3A-49D3-A459-9A99DDBB3E23-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We made great time and got to Hartville around 1:30pm. We spread our wet tent on the grass to dry by the courthouse and had a little smorgasbord from our food bag. Pro tip: Ritz cracker + peanut butter + dried date.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/550FA139-D3D1-4677-9E3F-4245C8889C67-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Did we really want to wait around for 6-7 more hours until we could pitch our tent on the courthouse lawn (per the Adventure Cycling app)? There wasn&rsquo;t much to the town so we weren&rsquo;t sure how we&rsquo;d spend our time. Since we felt good and the riding conditions were perfect, we decided to ride 26 more miles to Marshfield. Then we could skip our planned camping stop in Fair Grove and continue on to the bike hostel in Ash Grove the next night. <\/p><p>We were delighted by how good we felt through the rest of the day. My knee didn&rsquo;t act up once! On another note, by keeping the chain on the smaller chain ring in front, I haven&rsquo;t had to use the bent derailleur.  I&rsquo;ll take it to the shop in Pittsburg, Kansas in a couple days so I can employ the bigger chain ring on the long flat days of the Great Plains.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/315CD785-0420-4661-8F75-05157F84EBA5-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><p>A little before 5pm we arrived in Marshfield and made our way directly to &rdquo;The WHOLE Market&rdquo;, a place that looked to have the healthy food we&rsquo;d been craving. We started by splitting an entree but the portions were rather small so we each got another entree, plus a couple London Fogs. We were relieved to have some salad greens. Tess was relieved to be done with our ride.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/794F99BC-C148-4ADE-A355-79C1C2D5F27E-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C57CC250-BEA4-4F41-AC36-AD139A4EA519-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We then headed to the city fairgrounds, where a city employee told us they&rsquo;d leave the shower unlocked. Cold and smelling strongly of sulfur, it was still refreshing to wash off the layers of salt that had accumulated. As the sun went down we went next door to the city park and set up our tent under the pavilion. I should note that through this section it is very common for cyclists to stay in city parks for free, arranged for by the city. We had a nice setup, and we quickly got comfy. <\/p><p>That is, until we heard some thumping outside. A voice said, &rdquo;Do you guys have a lighter?&rdquo; I said, &rdquo;Nah&hellip;&rdquo; and we listened intently for a few minutes. Eventually I left the tent and peered through the darkness towards a big rock, behind which a young guy was standing, scraping at the rock with a stick. He seemed oblivious to the fact that I was sitting there watching him. <\/p><p>When it didn&rsquo;t look like he was going to stop doing&hellip;whatever he was doing, I asked, &ldquo;You good, man&rdquo;? He said he was good. I asked him what he was doing, and he explained he was &rdquo;collecting rocks&rdquo;. I asked him if this was the best time he could be doing that, he said the park wasn&rsquo;t closed yet (it was), and he was just doing his hobby and trying to &ldquo;stay out of trouble&rdquo;. It was clear he was drunk or high on something. I explained that we were trying to sleep, and that him being out there was making that hard to do. He apologized, and after a while he left, moving at 1 mph and dragging a large branch with him. I watched him until he left the park and disappeared up the road.<\/p><p>Things we were wondering:<\/p><ul><li>Would he come back?<\/li><li>Does he own a gun?<\/li><li>Should we leave and go to a hotel?<\/li><\/ul><p>We decided to get a shitty night&rsquo;s sleep and be on high alert. It didn&rsquo;t really seem like he had any bad intentions, or could even find us again if he wanted to. I had the pepper spray at my side, and we planned that if he came back I would go out and Tess would call 911.<\/p><p>Five minutes after we tried to relax again, it was clear this was not going to work. We loaded up our bikes and headed to the Holiday Inn a mile and a half away in the dark. Desserts and TV followed. We decided we&rsquo;d sleep in the next morning and do laundry to get our money&rsquo;s worth. Finally relaxed, we fell soundly asleep. We did not like that man.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8D30FBB1-FA12-4461-A36D-89BF33754A13-1024x772.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"August 19, 2022","fields":{"date":"08\/18\/2022","day_number":"41","multiple_days":false,"weather":"Splendid","locations":{"single":false,"start":"Houston, MO","end":"Marshfield, MO"},"miles_and_elevation":{"rest_day":false,"miles":"66","elevation_gain":"2149","elevation_loss":"2457","flats":""}}}