{"ID":165,"title":"Day 5 &#8211;  Bristolville, OH to Stow, OH","content":"<p>At 5:30am we woke up and felt perky. Our pack-up routine is getting dialed in - I pack my panniers while Tess breaks down our sleep system, she packs hers while I break down the tent. All of our electronics juiced up from the day before, we hit the road&hellip;destination, my friend Nick Miller&rsquo;s house near Kent. A real roof tonight!<p>Up to this point we&rsquo;ve been vaguely following the Underground Railroad trail, one of three Adventure Cycling routes we&rsquo;re taking to San Francisco (the others being Transamerica and Western Express). We were off-book at this point so I wasn&rsquo;t sure what the roads would bring. Turns out Google Maps did a great job for the first half of the day. We wended our way through mostly empty back-country roads, a layer of mist over everything.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/ED69F7-CC0D-4A26-83AC-80AC742AECF6-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B3D11632-A4CB-4F3E-849F-D80F0D0C66A5-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.FE1CD6FB-6CF2-46C8-B8A4-8B50C6A81B49.mov\"><\/video><\/figure><p>Our coffee stop was the first place of business on our route, a Marathon gas station 10 miles in. Upon arrival we noticed a mom-and-pop convenience store across the street that was much more appealing. Turns out Mom and Pop were in there, and they were very friendly. Hurd&rsquo;s in Southington, OH has been continually operated in the same family since the 1800s! Everyone going in and out knew each other well, and all gave us words of encouragement. We had some peanut butter crackers and fig bars with our coffee, refilled water and skedaddled.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6CDC805E-D76A-42D7-9EA6-F4CE7E807F49-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The most direct route to our destination took us along Route 88 for quite a while, which was less pleasant due to car traffic. Tess&rsquo; gear shifting issue became a point of increasing frustration for her as we hit a series of challenging hills. During a pit stop at a Dollar General, we set our sights on Kent Cycle so we could at least figure out what the issue was. I nearly ran over a construction worker as we got back on the road - sorry, sir.<\/p><p>Finally we left Route 88 and hit a rails-to-trails that would take us all the way to Kent. Right at the entrance we met Ben, who was on a ride to D.C. from Spokane, WA (with an impressive ultralight setup), and Fritz, his Warmshowers host from the night before who was riding with him for a bit. The ride to Kent was like butter.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EF3F0BFB-D880-494C-8F74-B6F667A44034.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9D06EB46-89BB-42C7-B3BA-139F58D550C6.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7DA8F722-59F6-4B63-8430-DCE1D81E8986.jpeg\" alt=\"\"><\/figure><\/figure><p>Kent Cycle was right off the trail, and poor Anthony was the only one working with several customers waiting to be helped. That didn&rsquo;t stop him from diligently looking into the issue for us. We decided to leave the bike with him while we got lunch - we were craving Mexican food for some reason. Taco Tontos satisfied that craving with gusto. We wept as we each had a tofu Banh Mi burrito stuffed with veggies and rice, baked to perfection. Tess went back in after to congratulate them.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D07AE3FE-FE51-4391-B6BE-E31FECF6D248-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AAE182CB-5A25-40AE-9300-250E761F3181-768x1024.jpeg\" alt=\"\"><figcaption>Chatting with a man from Western New York<\/figcaption><\/figure><\/figure><p>When we returned, Anthony was back to work on Tess&rsquo; bike. While we waited we had a great conversation with Semilore, a lovely person who is studying aerospace engineering at Kent and who was purchasing a bike for the first time. We hope to see you on the road sometime Semilore!<\/p><p>Anthony tightened the cassette, replaced the cable, lubed up the housing, and gave Tess a few tips on how to handle her touchy gear shifter. After all this work, he only charged us three bucks for the cable, saying he understands how life on the road can be. Thank you Anthony!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1376FBC4-4DD6-489E-A6DC-21A7128F3FC5-768x1024.jpeg\" alt=\"\"><figcaption>Some Kent street art<\/figcaption><\/figure><\/figure><p>The first rain of our trip started up as we left the cycle shop, which felt great. Tess reported her shifting much improved. We got to Nick&rsquo;s, showered and napped until he got home from work.<\/p><p>When Nick got home he caught us up on his new job as a Senior Planner at Akron Metro RTA, the local public transit agency (Nick and I worked together until recently at NFTA Metro). We were overjoyed when he suggested Taco Tontos for dinner. The sweet potato burrito, while not quite as good as the banh mi version, was delicious.<\/p><p>After dinner Nick gave us a semi-professional tour of the Kent State Memorial. It was chilling seeing the location of the shootings, and the weather reflected the mood.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/02FD35E2-F321-4A1C-997A-1C055B05CF35-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4452C1C8-1D9C-43FC-BED1-71F72C868514-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BB26FB5A-4276-4A27-BA0A-E4E2474697DE-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7B05E8D9-6D71-4A17-9833-566B8AFA7146-768x1024.jpeg\" alt=\"\"><figcaption>A bullet hole from the shootings in a still-standing sculpture<\/figcaption><\/figure><\/figure><p>After a beer run we headed back to Nick&rsquo;s to watch a movie. Matthew McConaughey&rsquo;s soothing bass quickly got us in the mood for sleep, and sleep we did.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AF421F83-6B81-4787-AC69-0DA59D81083A.webp\" alt=\"\"><figcaption>This little maneuver&rsquo;s gonna cost us 51 years<\/figcaption><\/figure><\/figure><\/p>","date":"July 14, 2022","fields":{"date":"07\/13\/2022","miles_and_elevation":{"rest_day":false,"miles":"40","elevation_gain":"614","elevation_loss":"449","flats":""},"day_number":"5","weather":"Lovely, Some Showers","locations":{"single":false,"start":"Bristolville, OH","end":"Stow, OH"}}}