{"ID":1276,"title":"Day 52 &#8211; Ness City, KS to Scott City, KS","content":"<p>The convenience store across the street left a little to be desired in the breakfast department. Hostess Pie? Sausage breakfast pizza? We settled on coffee and stroopwafels, which despite being a bit too sugary reminded me fondly of my time abroad in the Netherlands. We brought it back to the hotel room to eat.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/884149B4-E1FD-4E87-89AF-B8F0D5BC8F43-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>I should mention I&rsquo;m in the first week of an experiment to wean myself off coffee. I&rsquo;d been having coffee in the morning (often, with a couple refills), and usually a bigger iced coffee in the afternoon. Aside from being expensive, I felt like it was making me sluggish. I also was starting to get annoyed with the <em>necessity <\/em>of finding coffee in the morning to function, especially as we were entering more remote areas. What better time to ditch caffeine&rsquo;s strong grip on me? Tess will not be joining me on this adventure. I have one week of one cup each morning, then a week of a half cup, then nada. This may disappoint Orvin, who is a strong coffee advocate.<\/p><p>There was a really nice sunrise as we left Ness City, and it was nice that it was cool enough to be able to look at the town. As we rode past the city limit, we sang our new rendition of &ldquo;Bear Necessities&rdquo; from the Jungle Book (&ldquo;Bear Ness Ness Cities&rdquo;).<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BD9ADED7-1EBE-4474-8187-BFB494F09F4C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/25199557-053A-4CE6-B18F-96AD41D2FC69-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/80CAA454-CE88-44B2-B902-45417BD1A60B-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2488E26D-3FEF-4B58-A1EA-9FA7E2A5DB99-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7248ECA5-3CD5-4A62-A011-63BB50A15FE2-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><p>Early on, Tess accidentally dropped one of her water bottles and dragged it ruthlessly across the pavement with her tire. What had the poor water bottle done to deserve this?<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CDC53F35-1055-4E28-8BBC-DC569B4A8CF2-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Our Windy app told us that a southwest wind would turn into an east wind as the day went on. Therefore, the first part of our day was the worst. We decided to stop in Dighton for a break, roughly halfway to Scott City. The scenery was more of the same.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E591207F-5B6E-4CBC-BD29-F7108A7D382D-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/66661996-BED1-4D67-BC5D-665E0EA3E287-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.CA061537-7820-4235-A2A9-4283C8C00ECF.mov\"><\/video><\/figure><p>In this stretch I&rsquo;d started listening to podcasts to break the monotony, but the cross breeze was blowing across my ears such that I couldn&rsquo;t hear a thing. Additionally, there were a lot of trucks in this section which added another layer of noise. I gritted my teeth, put my head down, and pedaled as hard as I could to make it to Dighton. The miles were barely moving. My face was about an inch from this for a long time:<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DA9FB567-4A32-4D7B-9D6C-807D44D824BF-473x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When I looked up, I could barely see Tess in my rear view. I called her to make sure she was good, and then put my head back down and pedaled. The new Panda Bear album, which has some old video game vibes, helped me through this section.<\/p><p>At last, the increasingly beautiful sign for Dollar General. More Gatorades and snacks, and we were on our way. Not long after, the winds started shifting and pretty soon we had a nice tailwind which blew us all the way to Scott City.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9A71A6E8-BA6F-4C5E-8D75-59AC618DB44C-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Scott County Fitness Center is located in the northern part of town, and per the Adventure Cycling App has a room for cyclists. When we arrived we were welcomed by Debbie and the owner&rsquo;s big happy dog. Tess was over the moon.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FEF0ACAF-98CE-40C9-AB5D-B6C9008F6CFB-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/771AB704-D75C-4861-821C-F7E84AED8242-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Up to this point, places listed as bike hostels were either free or suggested donation. We paid 15 per person here, which was fine with us until we saw the room. Located upstairs down a hallway about a foot wide, it contained a twin bed with a suspicious brown stain on it and was lit by one dim light bulb in the corner. It had not been cleaned since the last occupant, and the inside of the mini fridge was smeared with some sort of white crust. We pretended to be delighted.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C09BA3ED-C34E-4822-8650-E2FD334D55E0-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EEF49DFE-4AB9-4FAC-9946-100A21DBC71C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4532946E-FF6C-40B5-9BA0-361B3D02D98D-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After the tour of the room, she gestured at the fully-stocked water bottle fridge behind the counter and said &rdquo;you don&rsquo;t want to drink the water in Kansas, but we have water bottles for a dollar each&rdquo;. She also mentioned that she would turn on the AC in the room before she left that evening. Um, yeah?<\/p><p>We could use the pool for free, which Tess took advantage of and enjoyed. It was inside a greenhouse-type building that was about 500 degrees, so I didn&rsquo;t feel like partaking.  Instead, I showered in the men&rsquo;s bathroom, which was nice except that there was an empty Mountain Dew can and Hershey bar wrappers strewn around in there.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3E153B80-72C7-4879-9757-B9F4BE5279E8-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FBB1418A-0F85-4EA3-A96D-F8007F0B8517-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Feeling a bit grossed out, we left the fitness center and walked through the heat to the local coffee shop Small Talk. Unfortunately, they were closing in a half hour. We sat there as long as we could and had some cold drinks. It was a nice, clean place with a friendly owner. She said she has a group of older women that comes in every Thursday and calls themselves &rdquo;The Nitwits&rdquo;. She has to let them know if she needs to close on a Thursday or they lose their minds.<\/p><p>Afterwards Tess hit up the thrift store across the street. I went into the back room and sat in a chair while Tess browsed. I was tired and overheated, and dozed off. When Tess was finished we went to get an early dinner, hoping some food would do us good. We walked for fifteen minutes to the south side to the other location of El Dos de Oros (same as the night before). We stopped on the way at a gas station for water.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7F134D31-A37D-4D11-84DE-68D3B7075E84-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>This location was not quite as charming but the food was just as good. As we were eating we found out the fitness center closed at 5, which was in twenty minutes. We tried calling, but between yesterday and today the phone line had been disconnected. Worried that they would lock up not knowing we were out, I decided to head back early while Tess paid and got our leftovers boxed up. A few blocks away I noticed the bag I had contained Tess&rsquo; wallet, so I had to go back. At that point I figured I&rsquo;d just go back with Tess and worst case scenario if we were locked out we could fall back on more expensive Best Western in town (we were almost hoping for this).<\/p><p>At the restaurant counter, they told us the card machine was broken so we needed to pay cash. Frustration mounting. We waited what felt like ten minutes for a break in traffic to cross the street to get to the gas station ATM. My usual hatred for motor vehicles hit an all-time high.<\/p><p>After we paid, we started to head back and I almost got run over by a woman who wasn&rsquo;t planning on stopping as we entered the crosswalk. Waiting for minutes to cross Route 96, I let out a loud &rdquo;Argh&rdquo;. I realized that in the heat I had hit my literal boiling point.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D17D475A-ECEA-4CF2-96D5-DB9C3AA03B1E-768x1024.jpeg\" alt=\"\"><figcaption>The &rdquo;argh&rdquo; moment<\/figcaption><\/figure><\/figure><p>Back at the Ritz, Debbie had left but a young man named Gage was doing some cleaning. We stowed our food in the refrigerator behind the counter (Debbie had said earlier, &ldquo;put whatever you want in there!&rdquo;). Tess went to the gas station to get a big jug of water while I set up the room. Upstairs, there was someone in the tanning bed next door to our room blasting country music, and at this point it was clear the wall in between didn&rsquo;t go all the way to the ceiling.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.DD01A209-9033-4E68-81DE-6F9DBEBA0F27.mov\"><\/video><\/figure><p>I also realized the AC wasn&rsquo;t on, which Gage eventually solved for us. Tess came back with a large cup of water, explaining that the gas station was cash only and she had just brought her card. So they let her fill up a big cup of&hellip;tap water. At least it was cold.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0CB4D3A4-445B-43C4-858A-BB743D724BDA-769x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Exhausted and at this point laughing about everything, we decided to just fall asleep at 7pm so we could get the hell out of there early. We fell asleep to the hum of an electrical box directly above our heads.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8DECD8D9-8C44-47E6-A5CE-386A32442772-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.E2619285-9FE9-4D48-B9E6-25F8A5C52DA8.mov\"><\/video><\/figure><\/p>","date":"August 30, 2022","fields":{"date":"08\/29\/2022","day_number":"52","multiple_days":false,"weather":"Stovetop","locations":{"single":false,"start":"Ness City, KS","end":"Scott City, KS"},"miles_and_elevation":{"rest_day":false,"miles":"55","elevation_gain":"722","elevation_loss":"3","flats":""}}}