{"ID":1305,"title":"Day 53 &#8211; Scott City, KS to Tribune, KS","content":"<p>&ldquo;Put anything you want in the fridge,&rdquo; she&rsquo;d said. What she hadn&rsquo;t said was that they would be chaining the fridge closed. Our hopes of eating our leftover quesadillas for breakfast were dashed.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5A2740E9-3AEF-4553-B527-8721CD403259-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>It was an excuse to get out of dodge sooner. We stopped at the Casey&rsquo;s convenience store and finagled a better breakfast than the morning before - egg and cheese on biscuits (albeit not warm) and a danish with coffee. We started out just after sunrise.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1B683447-7FA0-42CE-ADDD-E9911D169AF1-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Leaving town we passed a huge feed yard containing hundreds of cows that lasted for a mile and a half. The north wind was blowing dust and a strong odor in our faces during this stretch.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6D19C215-9338-4B89-A9B6-BF8C77D2EDCC-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><p>The flatness continued today, but there was a lot more traffic, mostly trucks. The shoulder was sufficient, but each truck passing would drown out about ten seconds of the podcast I was listening to, forcing me to constantly rewind. First world problems, I know, and people gotta make a living. In these times I imagine each truck is carrying freight for my dad&rsquo;s company.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5C3EE7A6-B86F-4C60-9B5F-B42166B71D81-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7422B350-0FBE-4432-99A4-D02DE3648ED7-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>All in all, the riding was easy today, especially when a little tailwind started later in the morning. We also entered a new time zone! For some reason (politics) the time zone border doesn&rsquo;t line up with the Kansas-Colorado border. Apparently many people in these few Kansas counties refuse to follow mountain time anyway.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CE0E14F6-14AC-4631-AA94-5B90E59AA07E-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When we started out we were unsure whether we were going to stay in Tribune, KS and camp or continue 28 miles more to Sheridan Lake, CO where there was a church we could stay in. Upon further inspection Sheridan Lake seemed rather small and didn&rsquo;t have anything for food so we did the shorter day to Tribune. We ended up being glad we did, as we enjoyed a nice last evening in Kansas. Important to leave on a high note.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DF19B7E0-9A05-4D69-847D-64EE6B136DD6-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When we arrived in Tribune we headed to the park to scope out our future sleeping area. It was a nice park with lots of shade. Since it wasn&rsquo;t too hot yet, we decided to have a snack and then nap in the shade. We had a lot of day ahead of us, and in past camping experiences we would get exhausted waiting to set up camp. It was really pleasant, and we woke up to two small dogs standing over us. We had a nice conversation with a local woman who was there with her two grandkids.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B1ED29EA-E720-42FD-A43F-B6A6CEF846FF-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We headed back into town to Fortanel Bakery where we had delicious veggie tortas. The front of house was run by young twin girls. We took a peek back into the kitchen to see if they were also cooking because we hadn&rsquo;t seen any adults (they weren&rsquo;t). We had more good conversations with locals and we asked them questions about their work in agriculture. They echoed what most others in Kansas had said - that the drought had been really hard on them.<\/p><p>Our next move was to the library where we could sit in a cool environment and use the free Wifi (the cell reception was pretty poor in Tribune). We only had 45 minutes until they closed, but we used it to the fullest. The librarian was really nice and she urged us to hang out in the nice alcove outside and continue to use the Wifi. We hung out there for a while.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/470FAD18-3816-4950-A5E6-906114B674D6-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1B2A52A1-B04F-4357-A9A8-79F4E6E62187-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2A8E1029-8A79-4F3D-9D15-080D386AB6A8-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Around 5 another cyclist pulled in (also named Eric) who was planning to camp in Tribune as well. We headed to the grocery store for dinner stuff and told him we&rsquo;d see him later on.<\/p><p>We&rsquo;d phoned the sheriff earlier and they said they&rsquo;d leave the pool showers open for us. He also pulled through in his police truck several times throughout the night to check on us. We made egg, avocado and cheddar wraps and had the juiciest nectarines for dessert.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CC11C673-499F-4C2B-8D11-2E175517431D-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Up at the shower house I had a nice talk with Eric. We swapped intel on the directions we&rsquo;d come and he told me about some of his other tours around the west. Down at the park we set up under a pavilion filled with exercise equipment. I tried some of them out.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.5A2B6F84-733D-4B0A-BCC7-0FB7606CFC53.mov\"><\/video><\/figure><p>There was a flurry of activity in the park just before sundown as we were getting in our tent, including a boy who rode his bike around the sidewalk encircling the park about 30 times. Once the visitors left, and with the really nice breeze flowing through the tent, it wasn&rsquo;t long before we went to sleep.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D4580125-3E1F-48A8-B9F0-2716DAE730CE-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"August 31, 2022","fields":{"date":"08\/30\/2022","day_number":"53","multiple_days":false,"weather":"Sunny","locations":{"single":false,"start":"Scott City, KS","end":"Tribune, KS"},"miles_and_elevation":{"rest_day":false,"miles":"47","elevation_gain":"640","elevation_loss":"0","flats":""}}}