{"ID":1325,"title":"Day 54 &#8211;  Tribune, KS to Eads, CO","content":"<p>As usual, I didn&rsquo;t sleep so well in the public town park. At a regular campground I can safely put my earplugs in, but I&rsquo;m always a little on edge when anyone from town could walk up and get up to some funny business. A group of teens pulled in after dark (Tess was asleep) and peeled out not long after. At any rate, I didn&rsquo;t get into a deep sleep until after midnight. Unsurprisingly, I didn&rsquo;t really feel like getting up when our alarm went off. We noticed that Tess&rsquo; front tire had no air in it. We blew it back up and it was holding air fine, so we figured we&rsquo;d keep an eye on it to see if it had a slow leak. I&rsquo;m not counting this as a flat - it still works fine! After we slowly packed up, Tess got some good shots of the amusement park rides next door.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F15CC3F1-B9E1-488B-9052-49F5D3583D5F-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/20520405-6C99-4939-BC3F-5207B51FB9D5-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3F08A8D9-D7CC-49A0-B54B-6D6C2181A2E4-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>For breakfast we headed to Eagle Convenience where we had a surprisingly tasty egg and cheese on a biscuit. Inside, Tess talked to a really nice truck driver who apologized on behalf of all Oversize Load trucks that blow cyclists around on the road. On his way out he wished me a safe trip.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EAB6534C-5D46-4CE1-B9E6-08C91E502E95-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.14FC6B58-38D4-4CDB-993F-9E7A56D9E5D2.mov\"><\/video><\/figure><p>It was cool and eerie how surrounded we were by flat, unpunctuated emptiness throughout the morning&rsquo;s ride. At a pit stop I tried making contact with anyone who might be out in the void.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.34A109CF-B428-463A-AB27-3BEBC862BCA2.mov\"><\/video><\/figure><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FA04A27E-8292-4AA4-90CA-EC5F0367B9A6-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>About 15 miles in, we hit the Colorado border! We were unsure at first because the sign had fallen down. We will miss Kansas and its kind citizens, but we&rsquo;re super excited for everything Colorado has in store for us. It dawned on me that Kansas was the last new state we&rsquo;d visit on the trip.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/80F03DC8-FB8F-45FA-B00D-0E0684FCC27D-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/58E853B2-7098-4C1B-B63C-B808C6E6EA8B-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6F086C19-C99F-4B18-90F6-DB7C55242583-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Just past the Colorado line we passed a huge field of sunflowers. They were the first we&rsquo;d seen - and Kansas&rsquo; state flower is the sunflower! C&rsquo;mon, Kansas!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/694CAAD9-3F4A-4AED-B187-E79C934D10F6-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>In Sheridan Lake we stopped for a cold drink and a snack. We were extra glad we hadn&rsquo;t stayed in Sheridan Lake, as it was pretty desolate. Every town has a grain elevator in this area of the country, often with the town name printed on it. You can usually see it from 10 miles out, letting us know a town is coming up. Here&rsquo;s Sheridan Lake&rsquo;s, and some pretty flowers at the gas station.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FA7E7951-82DA-469F-9E2A-0F14B6427006-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A30FF185-7521-4648-AC27-E98FF843E4DA-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When we left Sheridan Lake there was a point were we crested a hill and could see for miles out across a valley. It was the first real vantage point we&rsquo;d had in days. At some point my phone died, which was kind of nice as I could really tune into my surroundings. For the rest of the day there was an old railroad running alongside the road, the slope covered with wildflowers.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/987E9925-A64D-427D-BCD6-2CFEF0564823-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/41052F6C-BE1F-44C0-97EE-2DD97F9F1A37-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DDCA7373-D027-47DC-BA20-7AD6AF6FD76F-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We passed the turnoff for the Sand Creek Massacre Historical Site, which I later learned was a slaughter of hundreds of Native Americans by the U.S. Army in 1864, two thirds of whom were women and children. Absolutely horrific and shameful.<\/p><p>Tess was wearing a tank top that left her a little too exposed to the sun, and started feeling it as we got closer to Eads. We eventually spotted the town&rsquo;s grain elevator in the distance, but we pedaled for ages and it didn&rsquo;t seem to be getting any closer. I was reminded of old car racing video games where there was a city in the distance but you never actually got there. Or the scene in Monty Python and the Holy Grail where Sir Launcelot was endlessly running towards the castle without reaching it. <\/p><p>Finally we were a couple miles out when we hit a stretch of construction that narrowed the road. At that point, every truck in the county decided to drive on that very stretch of road. Tess was losing her mind with fear as trucks passed each other in opposite directions, leaving very little room for us.<\/p><p>Thankfully, we arrived safely at the Cobblestone Inn and Suites where Tess&rsquo; mom had kindly booked us a room for Tess&rsquo; birthday coming up this weekend! We couldn&rsquo;t check in right away but had some cereal and fruit while we waited. We quickly got real comfy watching US Open tennis on TV in our room. I had a lot of crackers with peanut butter.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B689ED39-33AB-4A8D-8924-C93B07307508-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>In the hall, Tess and I met a trio of really nice cyclists who were headed east - Brice, a guy our age from California, and Guy and Elise, a married couple from Kentucky. They were headed in the same direction and banded together.<\/p><p>We ordered food from the hotel kitchen - some onion rings and a veggie pizza - which turned out to be pretty good. Tess paired it with a little glass of wine.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/88075119-1724-43A8-BDC3-5908A517A247-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>That night, a massive storm rolled through.  Brice, Tess and I watched the lightning in the distance for a while, until really strong winds forced us back inside. With rain pounding on the windows and basking in an unlikely win by Serena Williams, we got to sleeping.<\/p><\/p>","date":"September 1, 2022","fields":{"date":"08\/31\/2022","day_number":"54","multiple_days":false,"weather":"Sunny","locations":{"single":false,"start":"Tribune, KS","end":"Eads, CO"},"miles_and_elevation":{"rest_day":false,"miles":"57","elevation_gain":"797","elevation_loss":"197","flats":""}}}