{"ID":192,"title":"Day 6 &#8211; Stow, OH to Medina, OH","content":"<p>After staying up until 11:30pm watching Interstellar, it was difficult to get up the next morning. I felt hungover despite not having had anything to drink except Tangerine seltzer. My theory is that I&rsquo;m drinking more water than usual, but still not enough to stay hydrated with the amount of physical activity we&rsquo;re doing. I chugged a tall glass and got to work.<p>This was the shortest day of the first segment of the trip, as we had two definite destinations that happened to be pretty close together. We took the less direct, majority bike path route to make it more scenic. This took us along the Freedom Trail and the beautiful Ohio &amp; Erie Canal Towpath trail.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.095EFDF3-789E-4B1B-BF32-BDFFD6FDF798.mov\"><\/video><\/figure><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/36A668D9-D3BB-4C1D-8B0A-8EC28E33C4F9-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We stopped for a snack by the Mustill House, built in the 1850s and one of Akron&rsquo;s oldest buildings. It was once a busy enterprise across from Lock 15 in the canal days.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/96268BA3-C6D1-4BC6-86EC-8C3836489095.jpeg\" alt=\"\"><\/figure><\/figure><p>It was with sadness that we left the gorgeous winding towpath in the town of Botzum. To get down to the level of the Cuyahoga River we had ridden about a mile of steep (and exciting) downward grade, and we knew it was only a matter of time before we paid the price. Yellow Creek Road was the price. It had the steepest hills we&rsquo;d seen so far with very little shoulder, blind curves and lots of vehicular traffic.<\/p><p>We were eventually spit out onto Granger Road (no relation to the road we recently moved away from) which took us most of the way to our destination. Though it was hilly and had plenty of cars, we were thankful it was straight so sightlines were good.<\/p><p>We got in before our 2pm Airbnb check-in time but went for it anyway. Our host Yolanda was putting the finishing touches on our little apartment by setting out fresh flowers. The place is super cute and will be a nice little home for the next couple days.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2F780470-C5E4-42DA-B150-2A75EC6AAE8A-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BE5A6A03-770A-459A-B535-DD611205DDC1-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Tess and I headed into central Medina, a five minute walk from the Airbnb. It has a Pleasantville-esque central square with a bunch of cafes and shops. Tess got a loaded fro-yo and I accidentally ordered two slices of pizza and accidentally ate both. We&rsquo;re finding ourselves to be insatiably hungry on this trip.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D90EA348-2998-4D28-A19A-68797A90EC88-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4FB4461A-598C-4CD6-9B89-4FA08CA7B84C-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We showered and napped in the first real bed since we left. Meg arrived around 5pm, and we headed back to the square for more food! We ate at PJ Marley&rsquo;s, where I had an above average portabella mushroom sandwich and a non-alcoholic Elvis Juice. Was very surprised they had the latter until we realized Brewdog is brewed in Ohio. Then we got &rdquo;artisan&rdquo; ice cream and finally felt full. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/611AB380-42B1-47BD-BC4F-05474A712DC8-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2DEA8A0C-7AFC-4C74-AAD5-93CD446AC88A.jpeg\" alt=\"\"><\/figure><\/figure><p>Tess and Meg had a long day of yoga training ahead of them (8am-8pm), whereas I faced the prospect of sleeping in. Win-win for everyone! We fell asleep watching Glow. TV two nights in a row, we feel spoiled.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6960CB16-2209-4D88-B9C1-9054C2FFFDB5.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"July 15, 2022","fields":{"date":"07\/14\/2022","day_number":"6","miles_and_elevation":{"rest_day":false,"miles":"34","elevation_gain":"942","elevation_loss":"948","flats":""},"weather":"Scrumptious","locations":{"single":false,"start":"Stow, OH","end":"Medina, OH"}}}