{"ID":1446,"title":"Day 60 &#8211; Pueblo, CO to Wetmore, CO","content":"<p>The Great Divide bike shop had our bikes and didn&rsquo;t open until 9:30, so we got to sleep in a little later than usual. After breakfast we took a cab uptown driven by the nicest, gentlest cab driver we&rsquo;d ever had. As we were loading up our bikes, a car T-boned a paratransit bus at the intersection right outside. No one was hurt, but the front of the car was crushed like a beer can. Before we set off we talked to some bikers who had come east on the Western Express, and were doing a week of a cross-country trip each year, 120 miles per day. Not the way I&rsquo;d do it, but to each their own!<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D4765BB9-992A-41C7-9ECD-F2C7862AE33C-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>It was going to be a scorcher, so setting off near 11am wasn&rsquo;t ideal. Fortunately we&rsquo;d only be going 30 miles to Wetmore at the base of the mountains. Our new Da Brims made a world of difference, putting us perpetually in shade in an area with no shade.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B106E796-4168-40BC-AB3B-1CE6E46A7A4B-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CDB18DAD-C2B1-4341-9821-EAC8E7FB8C86-1024x769.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/52D2C7B8-41DD-45A0-964D-152A0D31DFBF-769x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We hit the first hills we&rsquo;d seen in a while, giving Tess a chance to test out the work the bike shop had done on her climbing gears. Apparently the issue was fixed! They were the first to replace the cassette rather than fiddle with the derailleur. Hoping, this time, it&rsquo;s fixed for good.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2F885542-D815-45F1-811B-C490CE455436-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E37A132A-F71C-410C-BE09-320E2B6DE7DA-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4962AEA8-C38B-4C2A-AFDF-A1E29B5C1599-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.921AA8EB-B4BB-4BF0-91A0-6A9EEC4AEA66.mov\"><\/video><\/figure><p>A few miles from our destination, we hit a steep, long hill. It was in the high 90s, and coupled with the altitude changes it kicked our butts. Dizzy, dehydrated and struggling to breathe, we walked up a good portion of it. We hoped this wasn&rsquo;t how we would fare with the steeper stuff in days to come.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.A7C7716D-F89E-44B2-A962-2F1560A3991A.mov\"><\/video><\/figure><p>When we pulled up to the house of our Warmshowers hosts Johnny and Kristin, a dog startled Tess and she fell over, banging her knee pretty good. Kristin, who works from home, saved us from the heat by welcoming us inside for a cold glass of water. She and Johnny are avid cyclists that recently moved to Wetmore from Fort Collins after his mother passed away. Johnny came home a little later, having been cutting down trees all day in the blistering heat. We were originally planning on pitching a tent in the yard, but they&rsquo;d recently been visited by a black bear and thought it would be safer if we slept in his daughter&rsquo;s bunk bed upstairs. We certainly didn&rsquo;t protest. A very welcome nap followed.<\/p><p>Around 6pm we emerged and they were watching the Tour of Spain cycling event on TV. We sat with them watching it, and got some great insight from them about what was happening in the race. They prepared us veggie burgers and pasta salad, followed by delicious baked cookies and milk. We sat up talking with them about cycling and travel until about 9pm, when we all hit the hay. Tomorrow would be one of the steepest climbs of the Rockies section of our trip, and we needed our beauty sleep.<\/p><\/p>","date":"September 7, 2022","fields":{"date":"09\/06\/2022","day_number":"60","multiple_days":false,"weather":"Hot and Sunny","locations":{"single":false,"start":"Pueblo, CO","end":"Wetmore, CO"},"miles_and_elevation":{"rest_day":false,"miles":"30","elevation_gain":"2159","elevation_loss":"735","flats":""}}}