{"ID":1673,"title":"Day 67 &#8211; Black Canyon of the Gunnison NP, CO to Montrose, CO","content":"<p>Best part of camping at the top of a hill? You get to bike back down. Today was more of a rest day than anything, especially since it was downhill the whole way. In the crisp canyon air, we had some applesauce and peanut butter crackers and I did a crossword. We had considered doing a little hike in the morning, but we were in the mood for breakfast and coffee so we rode off instead.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0BEC3E54-DCD2-49F3-951E-B8960899B368-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D2F381CF-8615-4097-8B07-430D358C090C-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D3101A89-F6AA-4984-809C-B75BBD739D5A-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>When we got to the top of the hill we&rsquo;d come up the day before, we felt mightily accomplished. I&rsquo;ll leave a video here of Tess getting to the top that I forgot to include in the last post.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/301ABA0C-4E63-41FC-97B6-B8DA943B517F-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.8BAC512B-7E1C-4F23-AB5F-FC158C111899.mov\"><\/video><\/figure><p>Thirteen miles and 2500+ feet down, we were in Montrose, Colorado. It seemed like a cool town, though with a little too much car traffic on the main road. We ate breakfast at Daily Bread Bakery, right across from the Republican Party of Montrose building. They had a lot of delicious sweet baked goods that we considered coming back for later. They also had the best homemade peach jam I&rsquo;ve ever tasted.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2979477D-A7B5-42AF-96B6-195A520C9679-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Eventually we were drawn to another cafe that had Wifi, as the service was really spotty in town and we had a lot of internet duties to attend to. We ended up at The Coffee Trader, where I ended up spending the next few hours. Tess went to go shopping and get her bangs trimmed, and I just chilled&hellip;hard. Waited out a few downpours as well.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D67BF170-0556-4127-BE44-E3B504B5625F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Eventually we went to check in at our motel, and got a good shower and nap in. The room was immensely large but had the usual furniture, so there was a huge empty space. We twirled in it.<\/p><p>For dinner we headed back downtown to Colorado Boy Brewery and had a couple really delicious pizzas and a salad. I decided that since we&rsquo;re in brewery country I should be trying them, so I got a 10oz of their rotating cask beer. It was delightful. <\/p><p>After dinner we went to Cold Stone Creamery to satisfy our sweet tooth. The creamer (?) had a unique laugh that tickled us. I had to throw half mine out because I got too full, then we biked back to the motel and watched Legally Blonde on TV. Probably the third or fourth time we&rsquo;d caught at least part of it on a hotel TV this trip.<\/p><\/p>","date":"September 16, 2022","fields":{"date":"09\/13\/2022","day_number":"67","multiple_days":false,"weather":"Sunny, Some Rain","locations":{"single":false,"start":"Black Canyon of the Gunnison NP, CO","end":"Montrose, CO"},"miles_and_elevation":{"rest_day":false,"miles":"13","elevation_gain":"43","elevation_loss":"2585","flats":""}}}