{"ID":1684,"title":"Day 68 &#8211;  Montrose, CO to Ridgway, CO","content":"<p>When we&rsquo;d told my parents we were planning on taking a TLC rest day at Orvis Hot Springs, a clothing optional bathing location in Ridgway, they jumped at the chance to treat us (thanks Mom and Pop). By booking a room in the lodge you get two days of soaking free, so we planned to bike there, spend the day\/evening, and most of the following day. A room was only available Wednesday, hence the short in-between day to Montrose.<p>From Montrose, Orvis is a 30-mile ride south on Route 550, a pretty busy road with a lot of commuter traffic. After a bag breakfast from the motel, we set off. It was a cool morning with a lot of low-lying clouds. Thunderstorms were likely in the early afternoon but we&rsquo;d get in before then. Somewhere in the park I&rsquo;d lost my Click-Stand, which has been my way of propping up my fully-loaded bike and not relying on something to lean it against.  Bummer.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E23799D4-F257-4137-9FE9-7856F2EB4A74-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2120589A-4C8C-47EA-BB17-9F3FDED8633C-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>The shoulder was nice and wide for a long time, until it just went away. At the same time, we entered some twists and turns in a little canyon. I braced myself for being berated, honked at or rolled coal upon. But aside from it being stressful, cars were good about giving us a berth. Phew. Soon, we were coming downhill into Ridgway, and beautiful mountains came into view around us.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.6616B721-BF9E-49F4-8DBA-6C9EFDFB5EAE.mov\"><\/video><\/figure><p>Ridgway, like most mountain towns we&rsquo;d come across, was very cute. For being really small (about 1,200 people), it really had a lot going on. After a stop at the pharmacy, we headed to Kate&rsquo;s Place, where I had a really good breakfast burrito and Tess had the best tuna sandwich of her life! They had awful pop music on though.<\/p><p>Outside Kate&rsquo;s we met Dwight, who lives in nearby Placerville and runs a flower shop with his wife. He was trying to help us brainstorm ways to stay in Telluride, where everything was either booked up or outrageously expensive due to the Blues and Brews festival going on. He gave us his number and said if we wanted a place to crash in Placerville to hit him up, and he would try to find us a situation in Telluride.  Meanwhile, we tried every other potential connection we knew of and still came up short. Alas.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9D8BC708-6A52-4D5A-A5FE-EE95A2AC3DFE-768x1024.jpeg\" alt=\"\"><figcaption>Buddy waiting outside the grocery store<\/figcaption><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6EB7D42A-CB37-408D-A94D-B9E6E93940A8-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After lunch we went to the grocery store to pick up food goods, and then biked the 2 miles down 550 to Orvis Hot Springs. The woman who welcomed us was verrrry sincere and suuuper robotic. Her response to everything we said was &rdquo;perrrfect&rdquo;. She gave us a tour of the facilities and showed us to our room. We immediately donned the &rdquo;coveted&rdquo; Orvis white bathrobes and went out to explore the outdoors in our birthday suits.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/521CC4F8-8868-4031-9D2E-53A7FA1525DD-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>You can&rsquo;t take electronics outside due to the nudity, so we don&rsquo;t have much photo evidence from our stay. There are about 8 outdoor pools of different temperatures and vibes. Smoking,  non-smoking, no talking, unbearably hot, ice cold, the list goes on. Our favorite was the largest, which had the perfect temperature as well as a little room-temperature pool adjacent where you could cool off if it was getting too toasty. Plus it was the most populated so there was good people watching. Bodies are all so different, yet, like&hellip;the same, you know?<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/30B2D15C-1CBC-4D51-A38B-BF3DCEEFC46F-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3F79875F-2A9D-4731-B11C-A8ABB7FFE878-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We had several rounds of soaking punctuated by a nap, or eating snacks, or laying in the grass. I was particularly into eating cold Reese&rsquo;s cups. After 9pm, all customers are asked to leave except for those staying overnight. We felt really special to be &rdquo;in the club&rdquo;. The stars were gorgeous. You can technically use the grounds 24 hours as a guest, but we were excited to shower and sleep, which we did. I ended the night shoveling Pretzel Crisps into my mouth. Half a day, and we somehow managed to use all 20 towels of various sizes we were given.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D930903B-8036-4E0E-9138-5C6CA402BE34-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"September 16, 2022","fields":{"date":"09\/14\/2022","day_number":"68","multiple_days":false,"weather":"Cloudy, Rainy","locations":{"single":false,"start":"Montrose, CO","end":"Ridgway, CO"},"miles_and_elevation":{"rest_day":false,"miles":"30","elevation_gain":"1378","elevation_loss":"174","flats":""}}}