{"ID":1700,"title":"Day 69 &#8211; Rest Day in Ridgway, CO","content":"<p>In the hallway outside our room at Orvis Hot Springs, a carafe of hot coffee was waiting when we emerged. We brought two cups to the main pool and soaked before the morning customers arrived. Tess read her New Yorker magazine. We could get used to this.<p>After an hour or so of lounging we decided to get showered and packed up so we&rsquo;d be ready for our checkout time. We could continue to use the spring for the rest of the day, but we felt satisfied with the amount we&rsquo;d soaked and decided instead to lounge on the grounds all squeaky clean. I made sure to have a last Reese&rsquo;s cup, as if Orvis were the only place on Earth they were sold.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/02E1CB42-8B23-4533-8DB2-BEDDE9E527A0-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>In the parking lot as we were leaving around 2pm, we met a woman who was extra excited about the trip we were on. On a side note, now that were in the west, people are now more impressed by our starting location than our destination (&ldquo;you came all the way from Buffalo??). Her name was Natalie, and she lives in Mountain View just above the town of Telluride. Tess went out on a limb and asked if we could camp in her yard and she agreed. We finally scored a place to stay in Telluride!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F853E564-420D-4552-B7ED-41D2A4A84E82-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Elated, we rode the two miles back to Ridgway to get some errands done. We got a couple more spare tubes at the bike shop, seeing as we&rsquo;d just used our last one. Tess got a snazzy Western-style sweater with tassels from a cool thrift store. At the post office we shipped back another load of items we didn&rsquo;t want to carry with us. Outside the post office, a bearded man pulled up on his bike and said &rdquo;Let me guess: Eric.&rdquo; John, our Warmshowers host, had been on an afternoon bike ride and spotted our touring bikes. I told him that the town was lovely, and he said &rdquo;Thanks, I&rsquo;m the mayor.&rdquo; We were staying with the mayor! Fingers crossed for an oversized key to the city. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A868DCA6-7441-402A-8A4D-E406AD978E15-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After a couple baked goods from Ridgway Natural foods and some cold-weather bike gear items at the outdoor store, we headed to John and Mallory&rsquo;s. He showed us to the nice little adjoining apartment where we&rsquo;d be staying, and afterwards we sat downstairs in the kitchen and talked over some Earl Grey tea. He&rsquo;d been mayor for 11 years, and viewed his role as a keeper of the peace in the town. The biggest modern challenge in Ridgway is finding affordable housing, and part of their solution is a big low-cost apartment complex under construction downtown. We were interested to hear about his unique day-to-day schedule, which also included duties in the local planning and arts scene.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C08A8EFA-A0AB-4560-871D-5B0B52EE3EFB-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After long, Mallory came home from her teaching job in Montrose. They had been making a chicken dinner before they realized we were vegetarians, but she and John quickly whipped up a delicious veggie salad with hard boiled eggs, olives, and a homemade salad dressing. She and I shared non-alcoholic beers and they showed us pictures of their younger selves and their children. We all had a nice dinner together in the dining room, after which Mallory had to retire to prepare for a superintendent observation day. We gathered our clean clothes from their laundry, thanked them and went up to the comfortable, cozy studio upstairs. We fell asleep envisioning an alternative life where we lived in Ridgway.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/123B258B-9382-47FF-83EE-537F5CA60B92-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"September 19, 2022","fields":{"date":"09\/15\/2022","day_number":"69","multiple_days":false,"weather":"Nice","locations":{"single":true,"start":"Ridgway, CO","end":""},"miles_and_elevation":{"rest_day":true,"miles":"","elevation_gain":"","elevation_loss":"","flats":""}}}