{"ID":2343,"title":"Day 88 &#8211; Panguitch Lake, UT to Cedar City, UT","content":"<p>Longer desert days and bad cell service has impacted my posting ability, going to try to catch up!<p>Inge finagled some hot coffee from Lorraine downstairs, and we sat around lazily having some breakfast in the room until Jan spoke up. &ldquo;We have a pretty big climb ahead of us - we should probably get going, right?&rdquo; Jan was right.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3C3FF7FB-68AD-4E15-B52A-D49DD1B88800-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>On the way out, I tried to pay Lorraine for the cranberry juice Tess had but she said not to worry about it. The pit bull she was walking at the time jumped up and scratched up my leg, perhaps objecting to the free juice.<\/p><p>Jan and Inge had left before us, so Tess and I set off around the lake alone. I&rsquo;d forgotten we coasted down a really steep hill to get to Aspen Cove, but quickly remembered as we trudged up it right out of the gate. After we rejoined the main road, we had 2,700 feet of climbing to get to the top of Cedar Breaks National Monument.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A83F4757-45EE-4BD3-88A0-126E3C475E5E-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8ED4C610-2852-461C-A654-E62F73560723-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>There&rsquo;d been a frost on the ground that morning, and the air got gradually cooler as we gained elevation. Groves of vibrant yellow aspens surrounded us. It finally felt like the fall we&rsquo;re used to! At one point, hundreds of sheep gushed across the road, guided by an occasional dog and one guy on a horse. The sheep were not a fan of Tame Impala, blaring from my speaker, and all darted out of the way, bleating loudly as I passed. The dogs barked at us, momentarily forgetting their job.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/97CD9A21-4D6F-4BC1-801F-476292C3D146-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D1D944BA-5280-4E12-BB7A-71040B068FB3-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AB1FE448-532A-4923-893F-9448353A27BC-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0BCB8608-1768-4C40-893D-2776FD154886-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D7C8DBF5-B7D5-4921-BDB8-74429CCCFA05-1024x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A574EAD4-6808-477A-B286-0B4DD77C1A7C-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.53FA2ED9-C411-4045-94CB-9A6C52C864C6.mov\"><\/video><\/figure><p>We caught up with Jan and Inge eventually, talking for a bit and then pushing on. There were some really steep bits in there, but finally we got to the top. Our peak elevation was over 10,600 feet, just shy of Marshall Pass on the Continental Divide. Other than an occasional snap from the road, we didn&rsquo;t see much of Cedar Breaks, eager were we to start our downhill.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A6C7102B-2298-4B1F-A540-111B37B259F4-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C3DDA89B-3172-4D98-981A-61A3C7AEDF4E-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We had 5,400 feet to lose in the last 25 miles, so we flew down the mountainside. There was a stretch of road where you could see Zion in the distance, but with our speed and the traffic it didn&rsquo;t feel safe to stop. We hit road work as we entered Cedar Canyon, and there were probably at least 40 vehicles waiting for the pilot car. When we finally got going, we navigated through really tight turns in the road. Drivers were all polite about our slower speed during the one-lane part, but as soon as the road work ended they were flying past us really close on blind curves, some honking at us. The scenery around us was really stellar but we couldn&rsquo;t take our eyes off the road. Later on, another group of angry, inconvenienced drivers passed us and it got me in a pretty foul mood. I managed to get a few shots in between grumbles.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9150866B-7ECA-4AF5-99BD-68B07588BF74-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0DE1D5FC-DC1D-4612-9D4A-F5CC05984052-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When we finally pulled into Cedar City, we met up with Jan and Inge for coffee and a late lunch at The Grind Coffee House. Their plan was to get a rental car to expedite the rest of their US trip, as their travel visa was soon to expire. After about a week of traveling with them, it was time to say goodbye. We will be following the rest of their travels closely! They will be missed.<\/p><p>We headed to the home of our Warmshowers host a mile and a half away. We were greeted at the door by Ken and Pat Cummings. After living in California for a long time, they moved to Cedar City four years ago and fell in love with it. Ken is an avid cyclist, and continues to ride even after being involved in a crash with a truck a few years ago that required an extensive recovery period. We unloaded our gear into the house and then loaded our bikes into the back of Ken&rsquo;s pickup. He drove us to the bike shop, where Bunny and Buddy were to receive a much needed spa day. A deep nap followed.<\/p><p>For dinner Pat made us some delicious soup and rosemary rolls. Ken told us some stories of the time they lived in South Africa where he was a labor manager at a mine (they met while attending the School of Mines in Golden,  Colorado). We capped off the night watching Road Perdition with Pat. A rest day tomorrow, so we turned off our alarm.<\/p><\/p>","date":"October 10, 2022","fields":{"date":"10\/04\/2022","day_number":"88","multiple_days":false,"weather":"Sunny, Crisp","locations":{"single":false,"start":"Panguitch Lake, UT","end":"Cedar City, UT"},"miles_and_elevation":{"rest_day":false,"miles":"45","elevation_gain":"3356","elevation_loss":"5692","flats":""}}}