{"ID":493,"title":"Day 18 &#8211; Columbus, OH to Xenia, OH","content":"<p>The weather forecast was cloudy with a high of mid-70s, and we had a whole day of separated bike path to arrive at our Warmshowers destination, so conditions looked to be perfect for our highest mileage day yet.<p>We woke up to some great news - Tess became officially certified as a Responsive Classroom educator! This was a goal of hers for years and she&rsquo;d undergone a long application process, so we were pumped. A good start to the day.<\/p><p>Gavin was doing a little work from home when we got downstairs, so we sat with him over some coffee and leftover peach cobbler. We took our time packing and saying our goodbyes and left later than planned. Lindsay and Bert saw us off. I came up with a better way to secure my flip-flops so I wouldn&rsquo;t lose any more.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FBE3D179-0B89-4076-9F93-7D97D48B5DF3-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>The morning was cool and gray as we wound our way over the Scioto River on our way out of Columbus. It took some time for our minds to shift back to being on the road.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/125C6CBE-291E-40BE-8CBA-D0A6C6556ED3-768x1024.jpeg\" alt=\"\"><figcaption>The Columbus skyline<\/figcaption><\/figure><\/figure><p>I called the route today the &rdquo;straight and narrow&rdquo;. With few exceptions, the road had no turns and disappeared into the horizon. It got meditative to the point where we may as well have been on a stationary bike. It was good for making calls to family and listening to podcasts and audiobooks.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.CB84C0EF-FEDD-40B7-A354-9654BD0DC012.mov\"><\/video><figcaption>A rare break in the straight and narrow<\/figcaption><\/figure><p>Tess brought a hard-boiled egg with her, and was eagerly anticipating eating it. At the small town of Lilly Chapel, the wait was finally over.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/23252CF8-6FFB-4383-B33A-DC77494E10E2-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D8C5CB1A-79D8-46E7-99C5-56CF178FF23A-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/395B60CC-907F-40F5-9811-2DB6ECF0F0AA-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/12CECD9B-266F-4566-A5E9-10BD3F231AF0-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AFB417DB-F0B3-4255-A03D-D90110E985A4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/13801A17-3117-4B30-AD0E-034FB97038B4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CD6A93AD-E3AB-4DBA-9CD2-AB6242F48C2F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>On a side note, I heard from long-lost friends for the first time in a while - Nigerian scammers that have been contacting me since high school. To them I am Leon Carey, a gullible sap. It was good to hear from them.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6BBA48D4-4A9A-40EE-9BA8-2BF79CDEB21A-473x1024.png\" alt=\"\"><\/figure><\/figure><p>Tess had neglected to put enough milk in her coffee that morning, so she spent a while trying to find a place to get some. We settled down at a cafe in London and waited out some rain by calling my parents and splitting some fudge. A while later I stopped to remove my shoe rain covers and with a shock realized our sleeping bag had fallen off my bike. Tess captured the moment of shock.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DF6C1D53-7608-4646-93EA-E704C6EA2B0B-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Not knowing how far back I&rsquo;d have to go, I furiously pedaled back the way we&rsquo;d come.  Fortunately, I only had to go a mile or so. I clearly had to be more careful about how I strapped down my gear&hellip;this was one of the most expensive items I could have lost.  Yikes.<\/p><p>Right on cue, my right knee started to hurt again around the 40 mile mark. We stopped in South Charleston for a little rest and some trail mix.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/58264914-D9E8-4EBC-8447-1CD5B650C753-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>A little while later we witnessed a helicopter that was being used to water or spray fertilizer on crops, which we&rsquo;d never seen before.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.ECF59E08-7738-4FB5-A5F9-8020A02B6E40.mov\"><\/video><\/figure><p><br><br>We started back down the straight and narrow for what could have been an hour or a week. Nearing Xenia, at a pit stop Tess took another spill when she couldn&rsquo;t unclick her shoes. This was the last straw for her, as she&rsquo;d fallen nearly every day for the same reason up to this point. We entered Xenia ready to be done for the day.<\/p><p>Our original final destination was Spring Valley, eight miles past Xenia where we were planning to camp on our Warmshowers host Trevor&rsquo;s property. As we sat at Acapulco Restaurant (where the employees were nice enough to let us store our bikes inside), we reasoned that, given Tess&rsquo; frustration, the thunderstorms to come that night, and my knee, we should grab a hotel room for the night in Xenia. Trevor was understanding - asked us if we needed anything and offered his place for a rest day if we needed it. The generosity of Warmshowers hosts continues to amaze.<\/p><p>Despite our reservations about dropping extra money on a room, we decided to fully embrace it. Hot showers, hot tea, and relaxation were had. We also considered it a celebration of Tess&rsquo; certification. We fell asleep to an HBO documentary about climbers and kayakers that were doing way crazier activities than we are, which was comforting.<\/p><\/p>","date":"July 27, 2022","fields":{"date":"07\/26\/2022","day_number":"18","weather":"Cloudy and Cool","locations":{"single":false,"start":"Columbus, OH","end":"Xenia, OH"},"miles_and_elevation":{"rest_day":false,"miles":"62","elevation_gain":"610","elevation_loss":"440","flats":""}}}