{"ID":798,"title":"Day 30 &#8211; Cave-In-Rock, IL to Eddyville, IL","content":"<p>We rose when it was still dark (not long after the raccoon incident), determined to get the day&rsquo;s miles in before the worst of the heat. As we pedaled away our legs felt sore from the day before. We were immediately flung onto a hilly back road leaving Cave-In-Rock, a true pre-coffee test. <figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/603D8986-92D8-4F94-A114-ACE68A218BF4-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>About five miles in, a beagle mix ran into the road next to me. It didn&rsquo;t stop running next to us for the next five miles. We named her Sheila. At first we thought it was really cute, but the longer she stayed with us the more concerned we got. &rdquo;Go home!&rdquo; we yelled. &rdquo;Get out of here! Can&rsquo;t you see we don&rsquo;t want you anymore?!&rdquo; But the Harry and the Hendersons treatment didn&rsquo;t have any effect. When we joined a busier road with car traffic we thought she&rsquo;d stop for sure, but she kept going. She&rsquo;d be running in the oncoming lane and get off at the last second as a car approached, giving us little heart attacks. Eventually on the long downhill into Elizabethtown we lost sight of her. We hope she&rsquo;s OK.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.4983DD83-A2A1-42C4-8AD1-B23968BE3AAE.mov\"><\/video><\/figure><p>Around 7:30 we stopped at Town &amp; Country for breakfast in Elizabethtown, which looked a bit neglected and had a &rdquo;For Sale&rdquo; sign out front. There was no one inside except William, the owner, cook, and server. He looked ragged, like things were not going well for him. When I came in he immediately started ranting about COVID restrictions. Next time he came over, the focus of his anger was gas prices, claiming &rdquo;the government oughta be shot&rdquo;. Whenever he cooled down he seemed like a nice enough guy though, we kind of felt bad for him. He took our order and went to get busy in the kitchen. Later he told us this used to be a busy place and it really took a hit the past few years, so he&rsquo;d been trying to get rid of it. You can kind of see why he (and so many others) are angry, even if the anger is misdirected.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/24D9E103-CDD0-4304-8D7D-2CCDDF28A82E-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>The food was pretty good! My breakfast sandwich wasn&rsquo;t enough so I ordered a full stack of french toast to follow it up.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/470CDFD0-B0E8-4538-A84E-6BB343395490-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/99C547EF-A3F0-4EFE-BD1E-A8AB30AF5F0C-768x1024.jpeg\" alt=\"\"><figcaption>But what about second breakfast?<\/figcaption><\/figure><\/figure><p>After last night&rsquo;s camping debacle and with similar heat in the forecast for tonight, we called our campground in Simpson to ask to switch to an air-conditioned room in the lodge. After that we felt a wave of relief - a guarantee of a place to escape the heat and get a good night&rsquo;s sleep!<\/p><p>As we were about to go, a fellow bike tourist came in - one of the few we&rsquo;d seen so far. We&rsquo;re one of the few cyclists in this area heading west so people are usually surprised - most west-goers come through earlier in the year (we&rsquo;re taking the Western Express route to avoid the northern section). Mitch was traveling solo and had lots of little stories to tell. By the time we finished talking to him and paid we&rsquo;d been there almost two hours! Not the jump on the day we were hoping for.<\/p><p>We still had to stop for groceries at the gas station across the street, as this was the last place to stock up before Simpson. We filled up on items for lunch and dinner, and got a big jug of water for midday bottle top-offs.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EBBA2694-ADB4-434B-AA97-308D8B4BC613-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The sun was already mighty hot, and the hills were long. At the top of one hill, I got a call from the campground with bad news - the air conditioner was broken at the lodge. We decided we&rsquo;d go there anyways and just camp as planned. We had an Airbnb the following night in Carbondale so we&rsquo;d just stick it out. It took a lot of wind out of our sails though. <\/p><p>Not long after, we ran into a bike tourist headed east who talked about Eddyville, a town I mistakenly thought we wouldn&rsquo;t be passing through on our route. When I realized we were, I looked up Hayes Canyon Campground, a horse ranch that had air-conditioned cabins. There was no answer when we called, but we decided to set our sights there anyway&hellip;if it was a no-go we&rsquo;d go on to Simpson. Both Mitch and this fella mentioned the good food in town at Shotgun Eddy&rsquo;s, which greatly appealed to us.<\/p><p>Eddyville Blacktop Road took us most of the way to Eddyville, and it had a couple killer hills we had to walk up. The added grocery weight, bad night&rsquo;s sleep, and intense heat smothered our usual ability to conquer inclines atop our steeds.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/572C7CFC-991D-46FA-B780-C17B78826E68-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CC0095B9-1F1D-4D7A-B794-80D689932B9C-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We were wiped when we finally rode into Eddyville, crossing our fingers we didn&rsquo;t have to ride any more miles. Of course when we arrived at Hayes Canyon the office was closed (the Sunday curse). Tess called the emergency number on the door (which I don&rsquo;t think I would have done - thanks Tess) and spoke to Josh, who said he would be right down. While we waited we were treated to ice by a camper named Bev, which I let melt over my head.<\/p><p>Josh set us up in a cabin at a discounted price, and we breathed easy. It wasn&rsquo;t the Hilton but we were very excited to take a nap in A\/C, which we did after we showered and Tess made us pepper jack, avocado and pickle sandwiches on white bread.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/60BE6841-8620-42E4-B907-27AFBC3A6A54.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6C718A96-3A72-473E-8F4A-D1FF2F8FD3BB-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8BDA2363-35CE-43CB-A732-54910139DAAF-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F9DD3D61-5B28-4FAA-AA42-2474500A7DEA-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CD734E15-7ED0-4EE7-A41F-739B98C46A11-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We woke up a couple hours later to the housekeeper knocking on the door - she didn&rsquo;t know we&rsquo;d be there. We figured we&rsquo;d stay up and go get an early dinner at Shotgun Eddy&rsquo;s so we could go to bed early and <em>actually<\/em> get an early start the next day.<\/p><p>We took our time eating and drinking at Shotgun Eddy&rsquo;s, a mile bike ride from the campground. We split a caesar salad, veggie quesadillas, and the best onion rings I&rsquo;ve ever had.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/AB4B43C4-8630-425C-99B5-926EAB66ED11-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/5B4B65EE-99B9-45AB-9B99-D81504A9137E-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After a nice ride back down the hill in the late evening glow, we packed up everything we could, set our alarm for 4:30am, and fell asleep to Law and Order: SVU.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/41881E57-94F0-4EC3-A5AC-030C3A1547B0-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/73D5E32E-B52F-40FA-B5A1-3302B0D71769-844x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"August 8, 2022","fields":{"date":"08\/07\/2022","day_number":"30","multiple_days":false,"weather":"Boiling","locations":{"single":false,"start":"Cave-In-Rock, IL","end":"Eddyville, IL"},"miles_and_elevation":{"rest_day":false,"miles":"34","elevation_gain":"1916","elevation_loss":"1752","flats":""}}}