{"ID":1055,"title":"Day 42 &#8211; Marshfield, MO to Ash Grove, MO","content":"<p>Not all miles feel the same. Today we went 20 fewer miles than the day before, but they were much more taxing. Coming off a big riding day, the sun, and unexpected hills were all culprits.<p>We made sure we got our money&rsquo;s worth at the hotel. We got big breakfasts (and stashed away some for lunch), did our laundry, and laid in bed watching movies until check-out at 11am. It wasn&rsquo;t supposed to get any hotter than the day before so we didn&rsquo;t have any qualms about the late start.<\/p><p>That sun though&hellip;it was beating down when we left the hotel. We longed for the nice cloud cover we&rsquo;d had the day before. Once we got out of Marshfield Route 38 worked its usual magic, but all too soon we were leaving it. From then on, the roads were either busy, really hilly, or a combination of the two. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8388ED37-09DF-4709-B6B0-96BCD83C1A06.jpeg\" alt=\"\"><figcaption>Interesting choice of name<\/figcaption><\/figure><\/figure><p>About 18 miles in, we stopped to get out of the sun for a bit, have something to eat and call my dad (Happy Birthday!). Not long after we set off from there, I was going up a hill and felt something pulling my bike from behind. A huge white dog had silently run up from behind and grabbed hold of my fender. Tess and I both yelled at it for a while until it wandered off. In the yard it had run out from, a man was sitting on his mower watching it unfold and doing nothing. Cool!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B2D53B73-06CB-481D-94B8-C52E432E4825-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>A while later we came to a super scary intersection with a busy highway that was clearly not built with bikes in mind. We had to bolt across, and when crossing the far lane Tess&rsquo; shirt got caught on the bike seat, dangerously stalling her mid-lane. Frustration building.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7E5F1F14-2D92-4202-8E0C-EB62D6AA0C7E-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DF9EED50-899B-464B-9A0E-BCB91F63E4D6-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><p>Over the next stretch the direct sunlight was starting to drain us, particularly Tess. At a stop sign she gulped down an energy gel to give herself a jump. Next to us in the ditch, the bottom part of a deer leg was just chilling there.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F4C9D344-6180-48BD-9D4E-B67814C52B44-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B7557C5D-C547-4A97-9C41-89F0E5D2CA91-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We decided to stop in Walnut Grove for a Gatorade and a sit. It was pretty great to get out of the sun and let our body temperatures go down. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C3A96971-6D8D-4CC3-A36B-96A5FCD79622-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/67E320A3-CA16-496A-9FA4-C06FF97B68E2-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/7444A57E-A40D-4725-8618-6C2B2891BFED-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>From Walnut Grove it was only 8 miles to Ash Grove, but we got hit with some giant inclines on the way. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/99AA009F-3DA9-4400-AC83-92831A40D2FC-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Our moods skyrocketed as we arrived at the Ash Grove park, where we received the key to the hostel and were welcomed by a really nice guy named David. He ran the pool next door to the hostel and told us that we could swim for free. We got right in there and floated for a long time. We had the pool to ourselves.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/ED55D8B8-7562-4778-BFFE-2F077C86D786-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Afterwards we headed into the hostel to shower before we ventured out for dinner. It was delightfully cool and had a kitchen and a living room. After the trials of the night before, we were pretty stoked about the fact that we could lock the doors.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8646BF27-D466-4A0A-82C3-305F7CF8A778-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>David had suggested a newer restaurant nearby called Maple Lane Bakery. We split a vegetarian sandwich and a salad, which were fresh and delicious. I followed it up with an oatmeal cookie and milk, while Tess chose bananas foster ice cream. We were glad we had a walk back to the hostel to work off the meal.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/99A6F862-334E-46F1-BDA0-2B8C3924C625-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EEA216D5-28D9-4971-BFE3-964805EB6D75-768x1024.jpeg\" alt=\"\"><figcaption>A teenaged sidewalk<\/figcaption><\/figure><\/figure><p>Back at the ranch, there was a big church-affiliated party happening at the pool and in the pavilion. We wasted no time setting up our sleeping pad and getting into bed. The day wasn&rsquo;t pretty, but we got it done!<\/p><\/p>","date":"August 20, 2022","fields":{"date":"08\/19\/2022","day_number":"42","multiple_days":false,"weather":"Sunny","locations":{"single":false,"start":"Marshfield, MO","end":"Ash Grove, MO"},"miles_and_elevation":{"rest_day":false,"miles":"46","elevation_gain":"1283","elevation_loss":"1722","flats":""}}}