{"ID":1121,"title":"Day 45 &#8211; Pittsburg, KS to Chanute, KS","content":"<p>We&rsquo;ve been increasing our daily mileage so I&rsquo;ve had less time to post - but rest assured we&rsquo;re alive and well.<br><br>There&rsquo;s nothing like going ham on a free hotel breakfast. Eggs, waffles, cereal, biscuit,  banana, OJ and coffee right into my belly. We got on the road heading back to the trail around 7:30, sun shining as usual. We had our sights on Chanute 63 miles down the route where we would be staying with Rick, a Warmshowers host. <p>The riding was flat as could be, and we tried as hard as we could to get &rdquo;Home Home on the Range&rdquo; out of our heads. We had started singing it a couple days ago not knowing that it was the state song of Kansas. We made a pit stop in Girard for some Gatorade since it would be a while before we&rsquo;d pass another store.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/850ECBD8-EDEB-4664-98CB-D7BACD5D51CC-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Riding conditions have been good so far in Kansas besides the flat and the weather - shoulders and bicycle signage have been far superior to Missouri. As in, they have them.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/36BC0A00-4321-488F-9CCE-566C3776CCC4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F2C8BF5F-34B3-43FD-9843-A6872649FA8B-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>After a sketchy traffic section going north on Route 7, we turned left and rode a nice tailwind for most of the rest of the day. Without much effort we were cruising at around 18 mph. On Google Maps, predicted arrival time is usually pretty accurate for biking directions but I was delighted to see the minutes ticking down as we rode like the wind.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DB08A906-123B-46E9-8E4C-3F4F3F65BCF9-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/9406C1A6-E0BB-4CFE-BC30-10BC3F461BFE-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We stopped in the shade in Walnut for a snack and a rest. Rick told us to expect Heather - a cyclist coming from Chanute who&rsquo;d stayed with him last night - heading our way at some point. Not long after we left Walnut we saw her coming east, and she pulled over to our side to chat. She&rsquo;d started the trip with her husband from Oregon but he&rsquo;d gone home to Sacramento early. She told us about her experience riding the Pacific Coast trail, and offered us her place to stay when we pass through Sacramento. We gifted her a spare reflective triangle to increase her visibility.<\/p><p>Down the road we hit a road block that other cyclists had reported we could get permission to walk across. We were thankful to not have to take a long detour, but it caked our bike shoes with a thick gravelly mud that took a while to remove.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/909AB260-A371-409A-BC20-69A11FF3CBBA-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3C7F29A9-A841-4781-A099-E968935B30CE-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>When we turned north to get into Chanute our tailwind was over, but we still made it into town before 1:30. We went straight to Java Junction downtown for coffee and some food (breakfast sandwich, tuna salad sandwich and jalape&ntilde;o chips). We hung out there for a bit catching up on our posts and then headed to Rick&rsquo;s. The middle school across the street was letting out as we left so we just beat the rush.<\/p><p>Rick and his huge dog Jake greeted us when we pulled in. &rdquo;I&rsquo;m so glad you&rsquo;re here,&rdquo; Rick said with a big smile. Rick is an artist and retired art teacher who currently has a local pet care business. He got us situated in our own bedroom, we showered and then laid down for a bit while he went to pick up his other two dogs Sterling and Walla from the groomer (I might be wrong about the second name). We let Jake into our room and we got to know each other better.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/00104C3A-DE92-407C-B026-ACAC01334FDD-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2C52A07F-2B50-4E8D-9173-0D87DCF23B38-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>After we did our laundry we put our clothes on the line to dry. Rick was impressed by how much clothing we had on us. We couldn&rsquo;t help but wonder - do we have too many clothes?<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E760961E-D2D1-443B-A7DB-B601842890EA-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Rick was generous with food - we had an appetizer spread of a bunch of veggies and dip, and then we made our own pizzas. We thanked him for the delicious pizza to which he said, &rdquo;don&rsquo;t thank me, you made it.&rdquo; We talked about some of the colorful cyclist guests he&rsquo;s had, including a man who had skateboarded across Australia and someone who had worked on the Webb space telescope project for decades before he retired.<\/p><p>Noting that his dogs wake him up at 2:30 every morning to go out, Rick said he wasn&rsquo;t fussy about when to get up the next morning to fix us breakfast. We decided on a 6am breakfast to get ahead of the next day&rsquo;s heat, and went to bed early and satisfied.<\/p><\/p>","date":"August 26, 2022","fields":{"date":"08\/22\/2022","day_number":"45","multiple_days":false,"weather":"Sunny","locations":{"single":false,"start":"Pittsburg, KS","end":"Chanute, KS"},"miles_and_elevation":{"rest_day":false,"miles":"63","elevation_gain":"489","elevation_loss":"397","flats":""}}}