{"ID":1226,"title":"Day 49 &#8211; Rest Day in Hutchinson, KS","content":"<p>We had big plans for this rest day - go to the Cosmosphere, a nearby astronomy museum, visit some antique stores, maybe even visit the underground salt mine museum, Strataca. Ultimately, the intense heat of the day stymied all of these plans. It kind of hurt to go outside.<p>Around the corner from the hostel is Scuttlebutts Coffee, which is inside a cool collective arts space. Farmers and artists co-mingled here. We got some coffees and breakfast and hung out for a while doing some posting.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/115D529D-2D01-4776-9EAC-296088EC7E45-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We stopped by Harley&rsquo;s again and I got an extra water bottle and cage, as I&rsquo;d had a vacancy on my frame for a couple weeks. We also stopped for some groceries for lunch and breakfast for the next morning. I was really craving granola and yogurt after all the baked goods we&rsquo;d been having. When we went back to the hostel we stayed there for a long time, relishing the cool air. Instead of going back out, we took a nap and watched another movie. Sorry, Cosmosphere&hellip;<\/p><p>Around 5pm we biked way down to the end of Main Street to El Patio, a really highly-rated taqueria. On the way we passed a Tyson chicken plant that smelled like shit and death. El Patio turned out to be really cute and cozy, run by a really friendly family for eleven years. They clearly have a diehard following. There were homemade salsas out on the little tables which we took to be a good sign. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/8682F703-9361-45B2-9F00-32E797FE4A90-1024x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We chatted in Spanish with Martha for a bit about our bike trip and our plans to go to Mexico, and then ordered from the menu on the wall. She gave our ticket to her daughter, who brought it to the kitchen. We got chile relleno tacos with rice and beans that were delicious. As we were eating, the kitchen sent us out each a taco loaded with delicious veggies. We were in heaven.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2972B49A-5D03-4376-9738-B814BD663816-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We felt we wanted something to wash down our tacos so we got a couple Cokes in glass bottles, delivered by her husband (whose name we didn&rsquo;t get). He told us they go down to Mexico June and July each year, and that we were welcome to visit anytime. We were taken aback and thanked him.<\/p><p>Later, Martha gave us her business card and wrote her personal phone number and the location of their home outside of Puebla,  Mexico, and also told us we could visit them while they were there. She also offered her home to stay the night if needed and said to call if we needed anything.<\/p><p>If that wasn&rsquo;t enough, when we went to pay she said her credit card machine was broken and that the meal was on them. We were blown away! We asked for a picture with Martha before we left. Outside, their daughter was walking to the recycling, holding our empty Come bottles and clinking them together in rhythm. We waved goodbye, and she yelled &ldquo;Bye!&rdquo; We&rsquo;ll never forget their generosity and hope we can return it someday!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/68FA53EB-2B9B-48C5-8D67-8DA221743851-1024x769.jpeg\" alt=\"\"><\/figure><\/figure><p>We left very full but Tess had a sweet tooth so we stopped at Holly&rsquo;s again on our way back. She got a &rdquo;purple ribbon&rdquo; cookie, one of their signatures - PB&amp;J with chocolate chips on a graham cracker crust. Wowee!<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EA631CAB-C752-4090-91F4-F4D309DF07B3-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Back at the hostel, Harley himself stopped down to see if we needed anything. He told us all about the Cosmosphere and the salt mine, which kind of made us wish we had gone. Apparently the Cosmosphere has the third largest collection of space items after NASA and the Smithsonian. The salt mine is the only working underground salt mine in the Western Hemisphere you can visit. He told us some hilarious stories of his first touring experiences, and he had an infectious smile. We thanked him for all he&rsquo;s done for cyclists in Hutchinson. <\/p><p>That was pretty much all she wrote for our rest day&hellip;the subtle sounds of Mission Impossible 3 lulled us to sleep. We set our alarms for 3:30am, planning to start in the dark to avoid the thunderstorms of midday.<\/p><\/p>","date":"August 27, 2022","fields":{"date":"08\/26\/2022","day_number":"49","multiple_days":false,"weather":"Caliente","locations":{"single":true,"start":"Hutchinson, KS","end":""},"miles_and_elevation":{"rest_day":true,"miles":"","elevation_gain":"","elevation_loss":"","flats":""}}}