{"ID":1259,"title":"Day 51 &#8211; Great Bend, KS to Ness City, KS","content":"<p>Hotel breakfast at 6. Departure at 7. The storms were gone and we had a 100+ degree ahead. We estimated arriving before noon so expected to get in before the heat began in earnest.<p>The morning was cool as usual, and the going was flat. There was really nothing on either side to look at, except for cows and the occasional grain silo. It was clear we&rsquo;d passed a threshold from the lush farmlands of the east to the more barren plains of the west.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4EBC94B9-77D9-4D09-B825-129798DB9E52-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D231C4EF-BB58-4D4F-A796-E6F391C84CAE-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.5AD21082-007B-44FC-97DB-4624E4F69A53.mov\"><\/video><\/figure><p>At a rest stop in Rush Center, we met a little mouse named Bambino. He seemed like he needed a little TLC, which Tess tended to. As we pedaled away, Tess was worried for his future.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.24364EBB-80C5-45C1-A8F7-2E849CCBBB5C.mov\"><\/video><\/figure><p>From then on, we experienced the first significant headwind of our trip. Our ETA slowly moved later as the morning went on, and each mile took forever. The sun had been getting hot around 10:30, which was around that time. To make things worse, we hit a series of long gradual hills. The only upside was that traffic was fairly light. Tess ran out of water about ten miles out so we made periodic stops so she could drink from my water bladder.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/97E2BBC9-C766-48DD-8A28-236E9F202F24-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/20A47775-6B02-4E97-9432-8B894B385989-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>At long last, we hit the outskirts of Ness City and pulled in at a Dollar General for a cold drink. I slammed two Gatorades and it was so hot and dry my voice was more like a croak. Derrick Inn was just down the street, which we struggled over to and went inside.<\/p><p>Derrick Inn clearly had a more illustrious past, but had been neglected. It was recently bought and is in process of being brought back to life. Courtney greeted us at the front desk and though we were early told us they&rsquo;d have the room ready in ten more minutes. We parked ourselves at a table and destroyed some snacks.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/BD620DD2-3EEF-445C-BD53-F3CC9FB01714-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/597A7592-DA51-449D-A90D-483E85B2BAB6-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/DCF1DEA0-CFAD-4BC0-83EC-AFA3E922B5AD-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>The room was comfortable, and they knocked off ten dollars from our bill since they were having an issue with cable TV. We did the usual shower-nap combo, which restored us. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/A470CFB9-E53D-4E2E-8517-697E07A21C96-768x1024.jpeg\" alt=\"\"><figcaption>Feeling restored<\/figcaption><\/figure><\/figure><p>When we went back out for an early dinner, it was 104 degrees and being in the sun was intolerable. The four-minute walk to the Mexican restaurant (typical) required some planning.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.19052009-AF2F-426B-BDCE-82F836597D62.mov\"><\/video><\/figure><p>We had our usual veggie quesadilla at El Dos de Oros, which hit the spot. After dinner we headed to the supermarket for breakfast stuff, but Courtney intercepted us telling us it had already closed. She drove us back to the hotel, after which we walked across the street to the gas station for a sweet treat. Nutter Butters for me and Dunkaroos for Tess. We decided to get coffee and breakfast at the gas station the next morning when they opened at 6. <\/p><p>Hot headwind day successfully survived! What&rsquo;s more, at some point today we also passed the halfway point of our mileage to San Francisco. Hard to believe, and quite a milestone!<\/p><\/p>","date":"August 30, 2022","fields":{"date":"08\/28\/2022","day_number":"51","multiple_days":false,"weather":"Bonfire","locations":{"single":false,"start":"Great Bend, KS","end":"Ness City, KS"},"miles_and_elevation":{"rest_day":false,"miles":"63","elevation_gain":"523","elevation_loss":"125","flats":""}}}