{"ID":1718,"title":"Day 70 &#8211; Ridgway, CO to Placerville, CO","content":"<p>We chose to not ride straight to Telluride as we wanted to have a full day there, and we had to cross Dallas Divide which we heard was a doozie. We texted Dwight who we&rsquo;d met the day before and asked if we could pitch a tent in his yard in Placerville. He said we could sleep in his camper - even better!<p>John said we could meet him downstairs between 7 and 8 if we wanted to share a cup of tea with him before a meeting he had. We all had big mugs of Earl Grey and big slices of Crenshaw melons. Heavenly melon. We discussed transit and the state of the country (we need high-speed continental rail!). Before he departed we got a picture with him.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D891B32E-D98C-43BB-AD93-C1B678062F9D-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>For some reason we were exhausted, so we went back to bed for what turned into an hour. We weren&rsquo;t in any rush since it would only be 24 miles to Placerville and Dwight wouldn&rsquo;t be home until 4:30. Finally we got our stuff together and went to hang out in town. Our first stop was Provisions where we had a nice breakfast outside and split a French press. I had a ginger molasses cookie to wash it all down.<\/p><p>Afterwards we checked out the farmer&rsquo;s market in Ridgway&rsquo;s beautiful town park. A broken credit card machine stopped me from mistakenly spending 20 dollars on a small bag of freeze-dried peaches. I tried on a vivid red jacket from a local outdoor gear purveyor, but didn&rsquo;t get it because Tess said it puffed out weird in the front. We did end up buying a loaf of focaccia, which was reasonably priced.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/D0623583-219A-4C13-8347-A15086D14A1C-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/FD30BED2-9EFE-4865-97FB-32856B656275-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>By the early afternoon, we were like, do we live in Ridgway? What are we doing here? We realized we were suffering from a loss of momentum from the rest day and several other shorter days we&rsquo;d had, and felt like we were rudderless. The once razor-sharp goal of our cross-country trip felt like a distant memory. We shook our heads vigorously, stocked up on groceries, and got outta dodge, hoping the familiar feeling of the road would re-center us.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3E044E07-BCE4-4D08-9CE7-5C2A6CE98B31-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/C22ABC88-49FA-4A0B-9104-ABD6F1BA3DC7-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>From Ridgway, Route 62 goes southwest up a steep incline to Dallas Divide. It was a gorgeous day and we plodded along slowly. A ways up, Tess said she wasn&rsquo;t feeling great. Not long after she had to stop to have diarrhea in a ditch at the side of the road. I tried to block her from view of the cars the best I could. When she was done and all good to continue on, we kept going up the hill. A few minutes later, she was back at it in another grassy ditch. A couple cyclists passed us going down and I waved nonchalantly. Afterwards she felt much better and guessed that it was the omelette she&rsquo;d eaten for breakfast that didn&rsquo;t agree with her. She chugged water to replenish fluids and we pressed on.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/3851B5-2AD4-4CD6-9218-714E568BEFD3-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/EB2ED8B8-3AA6-4733-9D12-2EA75ECBCA6B-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.15D53C27-E9F4-4237-A302-4DEB1FA2447D.mov\"><\/video><\/figure><p>The scenery was getting increasingly breathtaking as we climbed. We could see the sawtooth Cimarron Ridge to the east, and the massive looming mountains to the south slowly revealed themselves. Near the pass we stopped at a lookout point where the view came to a thrilling climax. Dallas Peak, Mount Sneffels, and Whipple Mountain (real names) were laid out in a line before us.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1E39BB28-3C62-49AE-B062-ED83D26BB636-1024x564.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6F95C4BA-1DC0-488E-AAA7-02435C95050C-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/6B7EC999-6235-49D7-A2AC-6BE35CA7B22D-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Minutes later we were going over the divide, and immediately were blasted in the face by a major headwind. We were starting to notice the pattern: going downhill + afternoon = headwind. It was all we could do to stay upright as the wind buffeted us around. I was able to sneak one picture of the downhill when the wind and traffic died down momentarily.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4CBD0490-3419-4899-ADED-2A42FB4F6F57-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1616C1C0-0239-4DF6-8F2C-299AB3D55F26-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Despite the headwind we made good time getting into Placerville, which is a really small town in the San Miguel River valley. Deep red exposed cliffs shot up behind the houses and few stores. We stopped for a cold drink and snacks at the little convenience store and struggled to find shade in the now hot sun.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/229C145C-3FC3-4FBE-A49E-612E18DBE951-1024x768.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/558A7DF3-FAC7-48F2-B0AE-C629A7C0E191-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>We headed to Dwight&rsquo;s house on Surprise Avenue a little early and were surprised to find the man of the house home early. He was working on his hot tub motor on his patio, looking perplexed. He&rsquo;d unexpectedly stayed at home most of the day while some contractors worked on something or other, and said he&rsquo;d started a bunch of projects but finished none of them. He and his wife Amy run a flower shop in Telluride. He offered us some beverages and carried on, chatting with us as he worked. I tried to help him loosen a PVC union under his hot tub, but after many attempts we realized we were screwing the wrong way. We succeeded in making it real tight, though.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F1780280-DF71-439A-B28C-865D6302AAD6-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>His children, Simone and Raymond, came home from school a little later and we all sat and shared smoothies. We showered while Dwight and the kids went for a bike ride around town. Ray had just learned how to ride and was doing a fine job. Dwight made some spaghetti for dinner (pro tip: add banana peppers for a nice zip), and the three of us sat up talking about our trip and the winding path that brought him to the area. He feels very fortunate to be where he is with his family.<\/p><p>When it was bed time, he set us up in his camper. We settled into the surprisingly comfortable mattress and quickly fell asleep.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F28F55B1-1F0E-46A2-B568-B2CB69E03C7D-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"September 20, 2022","fields":{"date":"09\/16\/2022","day_number":"70","multiple_days":false,"weather":"Pleasant","locations":{"single":false,"start":"Ridgway, CO","end":"Placerville, CO"},"miles_and_elevation":{"rest_day":false,"miles":"24","elevation_gain":"2513","elevation_loss":"2215","flats":""}}}