{"ID":2324,"title":"Day 87 &#8211; Bryce, UT to Panguitch Lake, UT","content":"<p>The second night in Bryce was even colder and wetter than the first. We felt the usual sluggishness and resistance to riding that we feel after a rest day, but pushed through. Jan and Inge lent us some coffee and we had some yogurt before we set off. They left before us, assuming we would catch up with them.<figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2671749A-6636-429C-BD3A-8100042B34F3-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>There was a long separated bike path leading out of Bryce that took us most of the way west down Route 12 through Red Canyon. Down by where the lane ended and we were thrust back into busy traffic we caught up with Jan and Inge. At the junction with Route 89 we pulled off at a gift shop with a &rdquo;free coffee&rdquo; sign out front. We drank our free coffee and chatted, not buying anything and feeling a little guilty.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/4DDB6D26-24EC-48EC-90DA-CB483128EBF4-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/F457AAD1-9EA7-436D-8AD2-A988B48A85F6.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2BB3D9AF-96B4-4F85-BCA4-0C2EDBCAB76F-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>Seven miles up the road, we stopped in the town of Panguitch for some lunch and groceries. We ate at Backroads Bistro which had great food but served everything in styrofoam containers. Their excuse was that &ldquo;they&rsquo;d only been open for two months&rdquo;. We later wrote a four star review on Google calling them out for it, hoping it would help them get their butts in gear. <\/p><p>Tess and I decided we were going to stay in a hotel room on Panguitch Lake, as we would be at high elevation and we knew it would get cold and damp. We were worried we might get sick if we had another night like the one before. Since we had two queen beds in the room, we offered to split the cost with Jan and Inge who had planned to camp. They couldn&rsquo;t turn down such a fine offer, and so after a grocery run we headed up the steep climb that would take us to the lake.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/42507322-C6CE-4FB6-BF5F-294A3B6D5549.jpeg\" alt=\"\"><\/figure><\/figure><p>We had a solid 2,000+ feet of climbing to get to the turnoff to Aspen Cove Resort. On the way up we passed over twenty cyclists on their way down, spaced out but all wearing the same red helmets. I&rsquo;m sure they were glad they weren&rsquo;t us. The trees got sparser and more colorful as we ascended, and the traffic was pretty light.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/86FD88B0-97F5-4A90-9368-8D0E1635FD4B-768x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/0345AC78-AB8E-4640-B266-8EF208207DF3-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>At last we spotted the lake, which prompted us to take the right onto the winding road around to the north side of Panguitch Lake. It was off-season, so there weren&rsquo;t many people around and most things were closed. When Tess and I arrived, only one employee was working at the hotel and the bar\/restaurant was closed. Lorraine was a very nice woman from Scotland with a delightful accent (we thought she sounded like Mrs. Doubtfire on the phone) who had only been working there for six months. We told her we were expecting two others and she upgraded us to the suite that had a second floor loft free of charge. <\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/82DD45E4-D29D-47A8-9951-5BF37029E9D4-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>Like us, Jan and Inge were pumped when they found out about the bigger room. After showers and naps we had some dinner and sat on the stairs and floor talking about future plans well into the night. We demolished a big bag of M&amp;Ms while we were at it.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/36C2EBAA-CBDD-4585-AA2D-50AF708031FA-819x1024.jpeg\" alt=\"\"><\/figure><\/figure><\/p>","date":"October 7, 2022","fields":{"date":"10\/03\/2022","day_number":"87","multiple_days":false,"weather":"Partly Cloudy","locations":{"single":false,"start":"Bryce, UT","end":"Panguitch Lake, UT"},"miles_and_elevation":{"rest_day":false,"miles":"42","elevation_gain":"2664","elevation_loss":"2093","flats":""}}}