{"ID":280,"title":"Day 9: Medina, OH to Millersburg, OH","content":"<p>It feels great to be back on the road again.<p>We had coffee at Cool Beans with Matt and Megan, who then witnessed our departure which they were unable to do at the beginning of the trip. Tess was able to sneak into the yoga studio for a picture with the other students who were hoping to receive their certifications that day.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.08AEDEA4-92FD-4C67-AEED-70B2F621397D.mov\"><\/video><\/figure><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/E9BB71F6-1165-46DE-B8A0-0D444625B66D-769x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>It started off gray and humid, with a forecast of thunderstorms beginning in the afternoon. We wanted to get as many miles in as possible before the storms hit, which road conditions turned out to be perfect for. We cruised down a series of long, straight, flat, carless country roads for most of the morning, getting 20 miles out of the way pretty quickly. Eby Road was the big hero of the day, taking us basically the whole way to the beginning of the bike trail in Fredericksburg with ease.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/80923DC9-C70D-4A70-A68D-85E3CB83D95A-768x1024.jpeg\" alt=\"\"><figcaption>Many thanks, Eby<\/figcaption><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CD633FA3-EBC9-4CF3-BBC1-C397899C7380-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.D9DB2675-BB81-4C79-BDA5-9BE876A880CF.mov\"><\/video><\/figure><p>It started to rain as we approached the 20 mile mark, and I kept an eye on our location relative to lightning on the Windy app. Lightning started to strike nearby as we crested a bare hill above the small town of Smithville where a cafe awaited. &rdquo;Let&rsquo;s boogie!&rdquo; I shouted to Tess, feeling a bit like Bill Paxton in Twister.<\/p><p>The cafe was closed, a trend that would continue as we pushed deeper into Amish country on a Sunday. Fortunately they had a cute little gazebo with tables that we decided to annex. Moments after we took cover, a flash and a boom hit at nearly the same time. We were thankful for our timing. We munched on Clif bars waiting for the worst to pass.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/CC122D12-62F2-48AD-AE98-C15AE60B63CB-768x1024.jpeg\" alt=\"\"><\/figure><\/figure><p>The rest of the day was steady rain, which was kind of refreshing. The quality of the roads held up, so it continued to be an easy ride except for the occasional big hill. We started to see more horse-and-buggies as we went along. There was a particularly thrilling moment that I witnessed in my rear-view mirror - Tess locked in a race with a buggy coming up a hill. It looked as though the buggy was about to pass as I crested the top, and I momentarily lost sight of them. I waited with bated breath, watching the hilltop behind me to see who would emerge victorious. Against all odds, Tess powered into sight first, several lengths ahead of the buggy. Everybody cheered.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/75FC8C3D-54CA-4FB0-A4AF-3DE98304B9E6-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.68B5D4AE-77F1-45D7-9FDB-7152769D6B3D.mov\"><\/video><figcaption>My bike fell over as I took this<\/figcaption><\/figure><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.364C740D-B45B-4CA6-917C-E4172A56E098.mov\"><\/video><\/figure><p>We got into Fredericksburg around 1pm and decided to stop for lunch. Unsurprisingly everything was closed. We stopped under an awning and made PB&amp;Js.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/81F27A77-C672-411D-8469-1949279A2178.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/2B0E9C1F-2EA5-4F75-9062-E49918A6D403-768x1024.jpeg\" alt=\"\"><figcaption>The chef at work<\/figcaption><\/figure><\/figure><p>We jumped on the bike path and practically flew to Millersburg where we had a campsite booked. The deli we had our sights on for dinner was closed (could have sworn it said it was open Sundays). Wal-mart to the rescue! Tess got us fixins for sandwiches and salad, plus chips and salsa for a treat. Turns out we would be in need of a treat.<\/p><p>There was a moment where we considered getting a room at the Comfort Inn down the road with the knowledge that it would continue raining. We reasoned that we&rsquo;d be paying the cost of a campsite plus the hotel room if we did, and that this wouldn&rsquo;t be the first or last time we had to camp in the rain, so we stuck to the plan.<\/p><p>The campsite was just 3 miles away, but half of that was a gargantuan hill. My right knee had been starting to hurt throughout the day, and this didn&rsquo;t help things. I waited at the top for Tess to catch up but she wasn&rsquo;t coming into sight. Worried, I called her and she reported that she&rsquo;d taken a fall trying to clip back in on the incline. She was pretty shaken up and part of her brake handle was broken. It still worked and her back brake was fully functional, so we decided we would get it fixed in Columbus and pushed on to the campsite. For the final hills, I was basically pedaling with my left leg alone to avoid putting more strain on my right knee.<\/p><p>There was a long gravel driveway down the hill to the campsites, and not far in Tess hit a big stone and fell again. Our spirits dampened, we walked the rest of the way down to the campground, where we were the only occupants.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/1951A6C0-08DC-43F7-B721-2A05B8BDF6F0-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>As we munched on chips and changed into dry clothes, our spirits began to lift. After stuffing ourselves to the brim with food we took a little walk up to the pond.<\/p><figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/464B0DCF-EE51-4904-AA2F-153171E44B2E-822x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/528303D5-1A99-4FFD-B62D-22FF6AAE365F-822x1024.jpeg\" alt=\"\"><\/figure><figure><img src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/B97E1246-3445-4DFF-997C-1EB943257044-1024x768.jpeg\" alt=\"\"><\/figure><\/figure><p>We got into the tent early and got real cozy. Storms came back in full force throughout the night, but we were bone dry in our trusty tent.<\/p><figure><video controls src=\"https:\/\/bsik-media.nyc3.digitaloceanspaces.com\/wheelie-babes\/trim.2927592A-3489-4F63-93A7-0A894A33CF57.mov\"><\/video><\/figure><\/p>","date":"July 18, 2022","fields":{"date":"07\/17\/2022","day_number":"9","weather":"Rain, Scattered Hell Fire","locations":{"single":false,"start":"Medina, OH","end":"Millersburg, OH"},"miles_and_elevation":{"rest_day":false,"miles":"47","elevation_gain":"1201","elevation_loss":"1198","flats":""}}}